zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SARADC.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_SARADC.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_SARADC
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_SARADC_H_)  /* Check if memory map has not been already included */
#define S32K566_SARADC_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- SARADC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SARADC_Peripheral_Access_Layer SARADC Peripheral Access Layer
 * @{
 */

/** SARADC - Size of Registers Arrays */
#define SARADC_THRHLN_COUNT                       4u
#define SARADC_CD0_P_COUNT                        16u
#define SARADC_CD0_M_COUNT                        16u
#define SARADC_CD1_P_COUNT                        11u
#define SARADC_CD1_M_COUNT                        11u
#define SARADC_CD2_P_COUNT                        16u
#define SARADC_CD2_M_COUNT                        16u

/** SARADC - Register Layout Typedef */
typedef struct SARADC_Struct {
  __IO uint32_t MC;                                /**< Main Configuration, offset: 0x0 */
  __IO uint32_t MS;                                /**< Main Status, offset: 0x4 */
  __IO uint32_t CALBIST;                           /**< Control and Calibration Status, offset: 0x8 */
  uint8_t RESERVED_0[4];
  __IO uint32_t IS;                                /**< Interrupt Status, offset: 0x10 */
  __IO uint32_t CEOCF0;                            /**< Channel End of Conversion Flag for Type 0, offset: 0x14 */
  __IO uint32_t CEOCF1;                            /**< Channel End of Conversion Flag for Type 1, offset: 0x18 */
  __IO uint32_t CEOCF2;                            /**< Channel End of Conversion Flag for Type 2, offset: 0x1C */
  __IO uint32_t IM;                                /**< Interrupt Mask, offset: 0x20 */
  __IO uint32_t CIM0;                              /**< EOC Interrupt Enable for Type 0, offset: 0x24 */
  __IO uint32_t CIM1;                              /**< EOC Interrupt Enable for Type 1, offset: 0x28 */
  __IO uint32_t CIM2;                              /**< EOC Interrupt Enable for Type 2, offset: 0x2C */
  __IO uint32_t WTIS;                              /**< Analog Watchdog Threshold Interrupt Status, offset: 0x30 */
  __IO uint32_t WTIM;                              /**< Analog Watchdog Threshold Interrupt Mask, offset: 0x34 */
  uint8_t RESERVED_1[8];
  __IO uint32_t DMAE;                              /**< Direct Memory Access Configuration, offset: 0x40 */
  __IO uint32_t DMA0;                              /**< DMA Request Enable for Type 0, offset: 0x44 */
  __IO uint32_t DMA1;                              /**< DMA Request Enable for Type 1, offset: 0x48 */
  __IO uint32_t DMA2;                              /**< DMA Request Enable for Type 2, offset: 0x4C */
  uint8_t RESERVED_2[16];
  __IO uint32_t THRHL[SARADC_THRHLN_COUNT];        /**< Analog Watchdog Threshold Values, array offset: 0x60, array step: 0x4 */
  uint8_t RESERVED_3[48];
  __IO uint32_t SMPLTSEL;                          /**< Sample Time Select, offset: 0xA0 */
  __IO uint32_t NCM0;                              /**< Normal Conversion Mask for Type 0, offset: 0xA4 */
  __IO uint32_t NCM1;                              /**< Normal Conversion Mask for Type 1, offset: 0xA8 */
  __IO uint32_t NCM2;                              /**< Normal Conversion Mask for Type 2, offset: 0xAC */
  uint8_t RESERVED_4[4];
  __IO uint32_t JCM0;                              /**< Injected Conversion Mask for Type 0, offset: 0xB4 */
  __IO uint32_t JCM1;                              /**< Injected Conversion Mask for Type 1, offset: 0xB8 */
  __IO uint32_t JCM2;                              /**< Injected Conversion Mask for Type 2, offset: 0xBC */
  uint8_t RESERVED_5[4];
  __IO uint32_t DSD;                               /**< Delay Start of Data Conversion, offset: 0xC4 */
  __IO uint32_t PUDLY;                             /**< Power Up Delay, offset: 0xC8 */
  uint8_t RESERVED_6[52];
  __I  uint32_t CD0_P[SARADC_CD0_P_COUNT];         /**< Type 0 Input n Conversion Data, array offset: 0x100, array step: 0x4 */
  __I  uint32_t CD0_M[SARADC_CD0_M_COUNT];         /**< Type 0 Input n Conversion Data, array offset: 0x140, array step: 0x4 */
  __I  uint32_t CD1_P[SARADC_CD1_P_COUNT];         /**< Type 1 Input n Conversion Data, array offset: 0x180, array step: 0x4 */
  uint8_t RESERVED_7[20];
  __I  uint32_t CD1_M[SARADC_CD1_M_COUNT];         /**< Type 1 Input n Conversion Data, array offset: 0x1C0, array step: 0x4 */
  uint8_t RESERVED_8[20];
  __I  uint32_t CD2_P[SARADC_CD2_P_COUNT];         /**< Type 2 input n Conversion Data, array offset: 0x200, array step: 0x4 */
  __I  uint32_t CD2_M[SARADC_CD2_M_COUNT];         /**< Type 2 input n Conversion Data, array offset: 0x240, array step: 0x4 */
  uint8_t RESERVED_9[48];
  __IO uint32_t CWSEL_0_0;                         /**< Channel Analog Watchdog Select for Type 0, offset: 0x2B0 */
  __IO uint32_t CWSEL_0_1;                         /**< Channel Analog Watchdog Select for Type 0, offset: 0x2B4 */
  __IO uint32_t CWSEL_0_2;                         /**< Channel Analog Watchdog Select for Type 0, offset: 0x2B8 */
  __IO uint32_t CWSEL_0_3;                         /**< Channel Analog Watchdog Select for Type 0, offset: 0x2BC */
  __IO uint32_t CWSEL_1_0;                         /**< Channel Analog Watchdog Select for Type 1, offset: 0x2C0 */
  __IO uint32_t CWSEL_1_1;                         /**< Channel Analog Watchdog Select for Type 1, offset: 0x2C4 */
  __IO uint32_t CWSEL_1_2;                         /**< Channel Analog Watchdog Select for Type 1, offset: 0x2C8 */
  __IO uint32_t CWSEL_1_3;                         /**< Channel Analog Watchdog Select for Type 1, offset: 0x2CC */
  __IO uint32_t CWSEL_2_0;                         /**< Channel Analog Watchdog Select for Type 2, offset: 0x2D0 */
  __IO uint32_t CWSEL_2_1;                         /**< Channel Analog Watchdog Select for Type 2, offset: 0x2D4 */
  __IO uint32_t CWSEL_2_2;                         /**< Channel Analog Watchdog Select for Type 2, offset: 0x2D8 */
  __IO uint32_t CWSEL_2_3;                         /**< Channel Analog Watchdog Select for Type 2, offset: 0x2DC */
  __IO uint32_t CWEN0;                             /**< Channel Watchdog Enable for Type 0, offset: 0x2E0 */
  __IO uint32_t CWEN1;                             /**< Channel Watchdog Enable for Type 1, offset: 0x2E4 */
  __IO uint32_t CWEN2;                             /**< Channel Watchdog Enable for Type 2, offset: 0x2E8 */
  uint8_t RESERVED_10[4];
  __IO uint32_t AWOR0;                             /**< Analog Watchdog Out of Range for Type 0, offset: 0x2F0 */
  __IO uint32_t AWOR1;                             /**< Analog Watchdog Out of Range for Type 1, offset: 0x2F4 */
  __IO uint32_t AWOR2;                             /**< Analog Watchdog Out of Range for Type 2, offset: 0x2F8 */
  uint8_t RESERVED_11[68];
  __IO uint32_t STC1;                              /**< Self-Test Configuration 1, offset: 0x340 */
  __IO uint32_t STC2;                              /**< Self-Test Configuration 2, offset: 0x344 */
  uint8_t RESERVED_12[4];
  __IO uint32_t STBR;                              /**< Self-Test Baud Rate, offset: 0x34C */
  __IO uint32_t STS1_P;                            /**< Self-Test Status 1 for P-SARADC, offset: 0x350 */
  __IO uint32_t STS1_M;                            /**< Self-Test Status 1 for M-SARADC, offset: 0x354 */
  __I  uint32_t STS2_P;                            /**< Self-Test Status 2 for P-SARADC, offset: 0x358 */
  __I  uint32_t STS2_M;                            /**< Self-Test Status 2 for M-SARADC, offset: 0x35C */
  __I  uint32_t STS3_P;                            /**< Self-Test Status 3 for P-SARADC, offset: 0x360 */
  __I  uint32_t STS3_M;                            /**< Self-Test Status 3 for M-SARADC, offset: 0x364 */
  __I  uint32_t STS4_P;                            /**< Self-Test Status 4 for P-SARADC, offset: 0x368 */
  __I  uint32_t STS4_M;                            /**< Self-Test Status 4 for M-SARADC, offset: 0x36C */
  __I  uint32_t STD1_P;                            /**< Self-Test Conversion Data 1 for P-SARADC, offset: 0x370 */
  __I  uint32_t STD1_M;                            /**< Self-Test Conversion Data 1 for M-SARADC, offset: 0x374 */
  __I  uint32_t STD2_P;                            /**< Self-Test Conversion Data 2 for P-SARADC, offset: 0x378 */
  __I  uint32_t STD2_M;                            /**< Self-Test Conversion Data 2 for M-SARADC, offset: 0x37C */
  __IO uint32_t STAWVBG;                           /**< Self Test Analog Watchdog Threshold for Bandgap Supply, offset: 0x380 */
  __IO uint32_t STAWVDDI;                          /**< Self Test Analog Watchdog Threshold for VDD (Integer Part), offset: 0x384 */
  __IO uint32_t STAWVDDF;                          /**< Self Test Analog Watchdog Threshold for VDD (Fractional Part), offset: 0x388 */
  __IO uint32_t STAWVRHL;                          /**< Self Test Analog Watchdog Threshold for Reference High Supply, offset: 0x38C */
  __IO uint32_t STAWOFS;                           /**< Self Test Analog Watchdog Threshold for Offset, offset: 0x390 */
  __IO uint32_t STAWCAPM;                          /**< Self Test Analog Watchdog Threshold for MSB Capacitor, offset: 0x394 */
  __IO uint32_t STAWCAPI;                          /**< Self Test Analog Watchdog Threshold for ISB Capacitor, offset: 0x398 */
  __IO uint32_t STAWCAPL;                          /**< Self Test Analog Watchdog Threshold for LSB Capacitor, offset: 0x39C */
  uint8_t RESERVED_13[8];
  __IO uint32_t GCC_P;                             /**< Gain Calibration Control for P-SARADC Converter, offset: 0x3A8 */
  __IO uint32_t GCC_M;                             /**< Gain Calibration Control for M-SARADC SARADC Converter, offset: 0x3AC */
  __IO uint32_t GCR_P;                             /**< Gain Calculation Result for P-SARADC Converter, offset: 0x3B0 */
  __IO uint32_t GCR_M;                             /**< Gain Calculation Result for M-SARADC Converter, offset: 0x3B4 */
  uint8_t RESERVED_14[268];
  __I  uint32_t CALSTSP0;                          /**< Calibration Fail Status 0 for P-SARADC, offset: 0x4C4 */
  __I  uint32_t CALSTSP1;                          /**< Calibration Fail Status 1 for P-SARADC, offset: 0x4C8 */
  __I  uint32_t CALSTSM0;                          /**< Calibration Fail Status 0 for M-SARADC, offset: 0x4CC */
  __I  uint32_t CALSTSM1;                          /**< Calibration Fail Status 1 for M-SARADC, offset: 0x4D0 */
} SARADC_Type, *SARADC_MemMapPtr;

/** Number of instances of the SARADC module. */
#define SARADC_INSTANCE_COUNT                    (3u)

