zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SARADC.h
/* SARADC - Peripheral instance base addresses */
/** Peripheral LPE_SARADC base address */
#define IP_LPE_SARADC_BASE                       (0x4213C000u)
/** Peripheral LPE_SARADC base pointer */
#define IP_LPE_SARADC                            ((SARADC_Type *)IP_LPE_SARADC_BASE)
/** Peripheral SARADC_0 base address */
#define IP_SARADC_0_BASE                         (0x40698000u)
/** Peripheral SARADC_0 base pointer */
#define IP_SARADC_0                              ((SARADC_Type *)IP_SARADC_0_BASE)
/** Peripheral SARADC_1 base address */
#define IP_SARADC_1_BASE                         (0x4088C000u)
/** Peripheral SARADC_1 base pointer */
#define IP_SARADC_1                              ((SARADC_Type *)IP_SARADC_1_BASE)
/** Array initializer of SARADC peripheral base addresses */
#define IP_SARADC_BASE_ADDRS                     { IP_LPE_SARADC_BASE, IP_SARADC_0_BASE, IP_SARADC_1_BASE }
/** Array initializer of SARADC peripheral base pointers */
#define IP_SARADC_BASE_PTRS                      { IP_LPE_SARADC, IP_SARADC_0, IP_SARADC_1 }

/* ----------------------------------------------------------------------------
   -- SARADC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SARADC_Register_Masks SARADC Register Masks
 * @{
 */

/*! @name MC - Main Configuration */
/*! @{ */

#define SARADC_MC_PWDN_MASK                      (0x1U)
#define SARADC_MC_PWDN_SHIFT                     (0U)
#define SARADC_MC_PWDN_WIDTH                     (1U)
#define SARADC_MC_PWDN(x)                        (((uint32_t)(((uint32_t)(x)) << SARADC_MC_PWDN_SHIFT)) & SARADC_MC_PWDN_MASK)

#define SARADC_MC_ADCLKSEL_MASK                  (0x6U)
#define SARADC_MC_ADCLKSEL_SHIFT                 (1U)
#define SARADC_MC_ADCLKSEL_WIDTH                 (2U)
#define SARADC_MC_ADCLKSEL(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_MC_ADCLKSEL_SHIFT)) & SARADC_MC_ADCLKSEL_MASK)

#define SARADC_MC_ADCLKDIV_MASK                  (0x8U)
#define SARADC_MC_ADCLKDIV_SHIFT                 (3U)
#define SARADC_MC_ADCLKDIV_WIDTH                 (1U)
#define SARADC_MC_ADCLKDIV(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_MC_ADCLKDIV_SHIFT)) & SARADC_MC_ADCLKDIV_MASK)

#define SARADC_MC_ACKO_MASK                      (0x20U)
#define SARADC_MC_ACKO_SHIFT                     (5U)
#define SARADC_MC_ACKO_WIDTH                     (1U)
#define SARADC_MC_ACKO(x)                        (((uint32_t)(((uint32_t)(x)) << SARADC_MC_ACKO_SHIFT)) & SARADC_MC_ACKO_MASK)

#define SARADC_MC_STOP_MASK                      (0x40U)
#define SARADC_MC_STOP_SHIFT                     (6U)
#define SARADC_MC_STOP_WIDTH                     (1U)
#define SARADC_MC_STOP(x)                        (((uint32_t)(((uint32_t)(x)) << SARADC_MC_STOP_SHIFT)) & SARADC_MC_STOP_MASK)

#define SARADC_MC_STOPCHN_MASK                   (0x80U)
#define SARADC_MC_STOPCHN_SHIFT                  (7U)
#define SARADC_MC_STOPCHN_WIDTH                  (1U)
#define SARADC_MC_STOPCHN(x)                     (((uint32_t)(((uint32_t)(x)) << SARADC_MC_STOPCHN_SHIFT)) & SARADC_MC_STOPCHN_MASK)

#define SARADC_MC_AVGS_MASK                      (0x600U)
#define SARADC_MC_AVGS_SHIFT                     (9U)
#define SARADC_MC_AVGS_WIDTH                     (2U)
#define SARADC_MC_AVGS(x)                        (((uint32_t)(((uint32_t)(x)) << SARADC_MC_AVGS_SHIFT)) & SARADC_MC_AVGS_MASK)

#define SARADC_MC_AVGEN_MASK                     (0x800U)
#define SARADC_MC_AVGEN_SHIFT                    (11U)
#define SARADC_MC_AVGEN_WIDTH                    (1U)
#define SARADC_MC_AVGEN(x)                       (((uint32_t)(((uint32_t)(x)) << SARADC_MC_AVGEN_SHIFT)) & SARADC_MC_AVGEN_MASK)

#define SARADC_MC_CTYPE_MASK                     (0x3000U)
#define SARADC_MC_CTYPE_SHIFT                    (12U)
#define SARADC_MC_CTYPE_WIDTH                    (2U)
#define SARADC_MC_CTYPE(x)                       (((uint32_t)(((uint32_t)(x)) << SARADC_MC_CTYPE_SHIFT)) & SARADC_MC_CTYPE_MASK)

#define SARADC_MC_STCL_MASK                      (0x8000U)
#define SARADC_MC_STCL_SHIFT                     (15U)
#define SARADC_MC_STCL_WIDTH                     (1U)
#define SARADC_MC_STCL(x)                        (((uint32_t)(((uint32_t)(x)) << SARADC_MC_STCL_SHIFT)) & SARADC_MC_STCL_MASK)

#define SARADC_MC_CTUMODE_MASK                   (0x10000U)
#define SARADC_MC_CTUMODE_SHIFT                  (16U)
#define SARADC_MC_CTUMODE_WIDTH                  (1U)
#define SARADC_MC_CTUMODE(x)                     (((uint32_t)(((uint32_t)(x)) << SARADC_MC_CTUMODE_SHIFT)) & SARADC_MC_CTUMODE_MASK)

#define SARADC_MC_CTUEN_MASK                     (0x20000U)
#define SARADC_MC_CTUEN_SHIFT                    (17U)
#define SARADC_MC_CTUEN_WIDTH                    (1U)
#define SARADC_MC_CTUEN(x)                       (((uint32_t)(((uint32_t)(x)) << SARADC_MC_CTUEN_SHIFT)) & SARADC_MC_CTUEN_MASK)

#define SARADC_MC_JSTART_MASK                    (0x100000U)
#define SARADC_MC_JSTART_SHIFT                   (20U)
#define SARADC_MC_JSTART_WIDTH                   (1U)
#define SARADC_MC_JSTART(x)                      (((uint32_t)(((uint32_t)(x)) << SARADC_MC_JSTART_SHIFT)) & SARADC_MC_JSTART_MASK)

#define SARADC_MC_JEDGE_MASK                     (0x200000U)
#define SARADC_MC_JEDGE_SHIFT                    (21U)
#define SARADC_MC_JEDGE_WIDTH                    (1U)
#define SARADC_MC_JEDGE(x)                       (((uint32_t)(((uint32_t)(x)) << SARADC_MC_JEDGE_SHIFT)) & SARADC_MC_JEDGE_MASK)

#define SARADC_MC_JTRGEN_MASK                    (0x400000U)
#define SARADC_MC_JTRGEN_SHIFT                   (22U)
#define SARADC_MC_JTRGEN_WIDTH                   (1U)
#define SARADC_MC_JTRGEN(x)                      (((uint32_t)(((uint32_t)(x)) << SARADC_MC_JTRGEN_SHIFT)) & SARADC_MC_JTRGEN_MASK)

#define SARADC_MC_NSTART_MASK                    (0x1000000U)
#define SARADC_MC_NSTART_SHIFT                   (24U)
#define SARADC_MC_NSTART_WIDTH                   (1U)
#define SARADC_MC_NSTART(x)                      (((uint32_t)(((uint32_t)(x)) << SARADC_MC_NSTART_SHIFT)) & SARADC_MC_NSTART_MASK)

#define SARADC_MC_XSTRTEN_MASK                   (0x2000000U)
#define SARADC_MC_XSTRTEN_SHIFT                  (25U)
#define SARADC_MC_XSTRTEN_WIDTH                  (1U)
#define SARADC_MC_XSTRTEN(x)                     (((uint32_t)(((uint32_t)(x)) << SARADC_MC_XSTRTEN_SHIFT)) & SARADC_MC_XSTRTEN_MASK)

#define SARADC_MC_EDGE_MASK                      (0x4000000U)
#define SARADC_MC_EDGE_SHIFT                     (26U)
#define SARADC_MC_EDGE_WIDTH                     (1U)
#define SARADC_MC_EDGE(x)                        (((uint32_t)(((uint32_t)(x)) << SARADC_MC_EDGE_SHIFT)) & SARADC_MC_EDGE_MASK)

#define SARADC_MC_TRGEN_MASK                     (0x8000000U)
#define SARADC_MC_TRGEN_SHIFT                    (27U)
#define SARADC_MC_TRGEN_WIDTH                    (1U)
#define SARADC_MC_TRGEN(x)                       (((uint32_t)(((uint32_t)(x)) << SARADC_MC_TRGEN_SHIFT)) & SARADC_MC_TRGEN_MASK)

#define SARADC_MC_MODE_MASK                      (0x20000000U)
#define SARADC_MC_MODE_SHIFT                     (29U)
#define SARADC_MC_MODE_WIDTH                     (1U)
#define SARADC_MC_MODE(x)                        (((uint32_t)(((uint32_t)(x)) << SARADC_MC_MODE_SHIFT)) & SARADC_MC_MODE_MASK)

#define SARADC_MC_WLSIDE_MASK                    (0x40000000U)
#define SARADC_MC_WLSIDE_SHIFT                   (30U)
#define SARADC_MC_WLSIDE_WIDTH                   (1U)
#define SARADC_MC_WLSIDE(x)                      (((uint32_t)(((uint32_t)(x)) << SARADC_MC_WLSIDE_SHIFT)) & SARADC_MC_WLSIDE_MASK)

#define SARADC_MC_OWREN_MASK                     (0x80000000U)
#define SARADC_MC_OWREN_SHIFT                    (31U)
#define SARADC_MC_OWREN_WIDTH                    (1U)
#define SARADC_MC_OWREN(x)                       (((uint32_t)(((uint32_t)(x)) << SARADC_MC_OWREN_SHIFT)) & SARADC_MC_OWREN_MASK)
/*! @} */

/*! @name MS - Main Status */
/*! @{ */

