zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SARADC.h
#define SARADC_MS_ADCSTS_MASK                    (0xFU)
#define SARADC_MS_ADCSTS_SHIFT                   (0U)
#define SARADC_MS_ADCSTS_WIDTH                   (4U)
#define SARADC_MS_ADCSTS(x)                      (((uint32_t)(((uint32_t)(x)) << SARADC_MS_ADCSTS_SHIFT)) & SARADC_MS_ADCSTS_MASK)

#define SARADC_MS_ACKO_MASK                      (0x20U)
#define SARADC_MS_ACKO_SHIFT                     (5U)
#define SARADC_MS_ACKO_WIDTH                     (1U)
#define SARADC_MS_ACKO(x)                        (((uint32_t)(((uint32_t)(x)) << SARADC_MS_ACKO_SHIFT)) & SARADC_MS_ACKO_MASK)

#define SARADC_MS_CHADDR_MASK                    (0xFE00U)
#define SARADC_MS_CHADDR_SHIFT                   (9U)
#define SARADC_MS_CHADDR_WIDTH                   (7U)
#define SARADC_MS_CHADDR(x)                      (((uint32_t)(((uint32_t)(x)) << SARADC_MS_CHADDR_SHIFT)) & SARADC_MS_CHADDR_MASK)

#define SARADC_MS_CTUSTART_MASK                  (0x10000U)
#define SARADC_MS_CTUSTART_SHIFT                 (16U)
#define SARADC_MS_CTUSTART_WIDTH                 (1U)
#define SARADC_MS_CTUSTART(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_MS_CTUSTART_SHIFT)) & SARADC_MS_CTUSTART_MASK)

#define SARADC_MS_SELF_TST_MASK                  (0x40000U)
#define SARADC_MS_SELF_TST_SHIFT                 (18U)
#define SARADC_MS_SELF_TST_WIDTH                 (1U)
#define SARADC_MS_SELF_TST(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_MS_SELF_TST_SHIFT)) & SARADC_MS_SELF_TST_MASK)

#define SARADC_MS_JSTART_MASK                    (0x100000U)
#define SARADC_MS_JSTART_SHIFT                   (20U)
#define SARADC_MS_JSTART_WIDTH                   (1U)
#define SARADC_MS_JSTART(x)                      (((uint32_t)(((uint32_t)(x)) << SARADC_MS_JSTART_SHIFT)) & SARADC_MS_JSTART_MASK)

#define SARADC_MS_JSTOP_MASK                     (0x800000U)
#define SARADC_MS_JSTOP_SHIFT                    (23U)
#define SARADC_MS_JSTOP_WIDTH                    (1U)
#define SARADC_MS_JSTOP(x)                       (((uint32_t)(((uint32_t)(x)) << SARADC_MS_JSTOP_SHIFT)) & SARADC_MS_JSTOP_MASK)

#define SARADC_MS_NSTART_MASK                    (0x1000000U)
#define SARADC_MS_NSTART_SHIFT                   (24U)
#define SARADC_MS_NSTART_WIDTH                   (1U)
#define SARADC_MS_NSTART(x)                      (((uint32_t)(((uint32_t)(x)) << SARADC_MS_NSTART_SHIFT)) & SARADC_MS_NSTART_MASK)

#define SARADC_MS_CALFAIL_MASK                   (0x8000000U)
#define SARADC_MS_CALFAIL_SHIFT                  (27U)
#define SARADC_MS_CALFAIL_WIDTH                  (1U)
#define SARADC_MS_CALFAIL(x)                     (((uint32_t)(((uint32_t)(x)) << SARADC_MS_CALFAIL_SHIFT)) & SARADC_MS_CALFAIL_MASK)

#define SARADC_MS_OFSBUSY_MASK                   (0x10000000U)
#define SARADC_MS_OFSBUSY_SHIFT                  (28U)
#define SARADC_MS_OFSBUSY_WIDTH                  (1U)
#define SARADC_MS_OFSBUSY(x)                     (((uint32_t)(((uint32_t)(x)) << SARADC_MS_OFSBUSY_SHIFT)) & SARADC_MS_OFSBUSY_MASK)

#define SARADC_MS_CALBUSY_MASK                   (0x20000000U)
#define SARADC_MS_CALBUSY_SHIFT                  (29U)
#define SARADC_MS_CALBUSY_WIDTH                  (1U)
#define SARADC_MS_CALBUSY(x)                     (((uint32_t)(((uint32_t)(x)) << SARADC_MS_CALBUSY_SHIFT)) & SARADC_MS_CALBUSY_MASK)

#define SARADC_MS_CAP_DONE_MASK                  (0x40000000U)
#define SARADC_MS_CAP_DONE_SHIFT                 (30U)
#define SARADC_MS_CAP_DONE_WIDTH                 (1U)
#define SARADC_MS_CAP_DONE(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_MS_CAP_DONE_SHIFT)) & SARADC_MS_CAP_DONE_MASK)

#define SARADC_MS_OFS_DONE_MASK                  (0x80000000U)
#define SARADC_MS_OFS_DONE_SHIFT                 (31U)
#define SARADC_MS_OFS_DONE_WIDTH                 (1U)
#define SARADC_MS_OFS_DONE(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_MS_OFS_DONE_SHIFT)) & SARADC_MS_OFS_DONE_MASK)
/*! @} */

/*! @name CALBIST - Control and Calibration Status */
/*! @{ */

#define SARADC_CALBIST_CAL_AVGS_MASK             (0xFU)
#define SARADC_CALBIST_CAL_AVGS_SHIFT            (0U)
#define SARADC_CALBIST_CAL_AVGS_WIDTH            (4U)
#define SARADC_CALBIST_CAL_AVGS(x)               (((uint32_t)(((uint32_t)(x)) << SARADC_CALBIST_CAL_AVGS_SHIFT)) & SARADC_CALBIST_CAL_AVGS_MASK)

#define SARADC_CALBIST_CALAVGEN_MASK             (0x10U)
#define SARADC_CALBIST_CALAVGEN_SHIFT            (4U)
#define SARADC_CALBIST_CALAVGEN_WIDTH            (1U)
#define SARADC_CALBIST_CALAVGEN(x)               (((uint32_t)(((uint32_t)(x)) << SARADC_CALBIST_CALAVGEN_SHIFT)) & SARADC_CALBIST_CALAVGEN_MASK)

#define SARADC_CALBIST_CST_LONG_MASK             (0x80U)
#define SARADC_CALBIST_CST_LONG_SHIFT            (7U)
#define SARADC_CALBIST_CST_LONG_WIDTH            (1U)
#define SARADC_CALBIST_CST_LONG(x)               (((uint32_t)(((uint32_t)(x)) << SARADC_CALBIST_CST_LONG_SHIFT)) & SARADC_CALBIST_CST_LONG_MASK)

#define SARADC_CALBIST_CAP_REQ_MASK              (0x100U)
#define SARADC_CALBIST_CAP_REQ_SHIFT             (8U)
#define SARADC_CALBIST_CAP_REQ_WIDTH             (1U)
#define SARADC_CALBIST_CAP_REQ(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_CALBIST_CAP_REQ_SHIFT)) & SARADC_CALBIST_CAP_REQ_MASK)

#define SARADC_CALBIST_OFS_REQ_MASK              (0x200U)
#define SARADC_CALBIST_OFS_REQ_SHIFT             (9U)
#define SARADC_CALBIST_OFS_REQ_WIDTH             (1U)
#define SARADC_CALBIST_OFS_REQ(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_CALBIST_OFS_REQ_SHIFT)) & SARADC_CALBIST_OFS_REQ_MASK)

#define SARADC_CALBIST_FRCOFFM_MASK              (0x10000U)
#define SARADC_CALBIST_FRCOFFM_SHIFT             (16U)
#define SARADC_CALBIST_FRCOFFM_WIDTH             (1U)
#define SARADC_CALBIST_FRCOFFM(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_CALBIST_FRCOFFM_SHIFT)) & SARADC_CALBIST_FRCOFFM_MASK)

#define SARADC_CALBIST_FRCOFFP_MASK              (0x20000U)
#define SARADC_CALBIST_FRCOFFP_SHIFT             (17U)
#define SARADC_CALBIST_FRCOFFP_WIDTH             (1U)
#define SARADC_CALBIST_FRCOFFP(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_CALBIST_FRCOFFP_SHIFT)) & SARADC_CALBIST_FRCOFFP_MASK)

