zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SARADC.h
#define SARADC_CALBIST_OFFBSTEN_MASK             (0x40000U)
#define SARADC_CALBIST_OFFBSTEN_SHIFT            (18U)
#define SARADC_CALBIST_OFFBSTEN_WIDTH            (1U)
#define SARADC_CALBIST_OFFBSTEN(x)               (((uint32_t)(((uint32_t)(x)) << SARADC_CALBIST_OFFBSTEN_SHIFT)) & SARADC_CALBIST_OFFBSTEN_MASK)
/*! @} */

/*! @name IS - Interrupt Status */
/*! @{ */

#define SARADC_IS_ECH_MASK                       (0x1U)
#define SARADC_IS_ECH_SHIFT                      (0U)
#define SARADC_IS_ECH_WIDTH                      (1U)
#define SARADC_IS_ECH(x)                         (((uint32_t)(((uint32_t)(x)) << SARADC_IS_ECH_SHIFT)) & SARADC_IS_ECH_MASK)

#define SARADC_IS_EOC_MASK                       (0x2U)
#define SARADC_IS_EOC_SHIFT                      (1U)
#define SARADC_IS_EOC_WIDTH                      (1U)
#define SARADC_IS_EOC(x)                         (((uint32_t)(((uint32_t)(x)) << SARADC_IS_EOC_SHIFT)) & SARADC_IS_EOC_MASK)

#define SARADC_IS_JECH_MASK                      (0x4U)
#define SARADC_IS_JECH_SHIFT                     (2U)
#define SARADC_IS_JECH_WIDTH                     (1U)
#define SARADC_IS_JECH(x)                        (((uint32_t)(((uint32_t)(x)) << SARADC_IS_JECH_SHIFT)) & SARADC_IS_JECH_MASK)

#define SARADC_IS_JEOC_MASK                      (0x8U)
#define SARADC_IS_JEOC_SHIFT                     (3U)
#define SARADC_IS_JEOC_WIDTH                     (1U)
#define SARADC_IS_JEOC(x)                        (((uint32_t)(((uint32_t)(x)) << SARADC_IS_JEOC_SHIFT)) & SARADC_IS_JEOC_MASK)

#define SARADC_IS_EOBCTU_MASK                    (0x10U)
#define SARADC_IS_EOBCTU_SHIFT                   (4U)
#define SARADC_IS_EOBCTU_WIDTH                   (1U)
#define SARADC_IS_EOBCTU(x)                      (((uint32_t)(((uint32_t)(x)) << SARADC_IS_EOBCTU_SHIFT)) & SARADC_IS_EOBCTU_MASK)
/*! @} */

/*! @name CEOCF0 - Channel End of Conversion Flag for Type 0 */
/*! @{ */

#define SARADC_CEOCF0_T0_IEOCF0_MASK             (0x1U)
#define SARADC_CEOCF0_T0_IEOCF0_SHIFT            (0U)
#define SARADC_CEOCF0_T0_IEOCF0_WIDTH            (1U)
#define SARADC_CEOCF0_T0_IEOCF0(x)               (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF0_T0_IEOCF0_SHIFT)) & SARADC_CEOCF0_T0_IEOCF0_MASK)

#define SARADC_CEOCF0_T0_IEOCF1_MASK             (0x2U)
#define SARADC_CEOCF0_T0_IEOCF1_SHIFT            (1U)
#define SARADC_CEOCF0_T0_IEOCF1_WIDTH            (1U)
#define SARADC_CEOCF0_T0_IEOCF1(x)               (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF0_T0_IEOCF1_SHIFT)) & SARADC_CEOCF0_T0_IEOCF1_MASK)

#define SARADC_CEOCF0_T0_IEOCF2_MASK             (0x4U)
#define SARADC_CEOCF0_T0_IEOCF2_SHIFT            (2U)
#define SARADC_CEOCF0_T0_IEOCF2_WIDTH            (1U)
#define SARADC_CEOCF0_T0_IEOCF2(x)               (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF0_T0_IEOCF2_SHIFT)) & SARADC_CEOCF0_T0_IEOCF2_MASK)

#define SARADC_CEOCF0_T0_IEOCF3_MASK             (0x8U)
#define SARADC_CEOCF0_T0_IEOCF3_SHIFT            (3U)
#define SARADC_CEOCF0_T0_IEOCF3_WIDTH            (1U)
#define SARADC_CEOCF0_T0_IEOCF3(x)               (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF0_T0_IEOCF3_SHIFT)) & SARADC_CEOCF0_T0_IEOCF3_MASK)

#define SARADC_CEOCF0_T0_IEOCF4_MASK             (0x10U)
#define SARADC_CEOCF0_T0_IEOCF4_SHIFT            (4U)
#define SARADC_CEOCF0_T0_IEOCF4_WIDTH            (1U)
#define SARADC_CEOCF0_T0_IEOCF4(x)               (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF0_T0_IEOCF4_SHIFT)) & SARADC_CEOCF0_T0_IEOCF4_MASK)

#define SARADC_CEOCF0_T0_IEOCF5_MASK             (0x20U)
#define SARADC_CEOCF0_T0_IEOCF5_SHIFT            (5U)
#define SARADC_CEOCF0_T0_IEOCF5_WIDTH            (1U)
#define SARADC_CEOCF0_T0_IEOCF5(x)               (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF0_T0_IEOCF5_SHIFT)) & SARADC_CEOCF0_T0_IEOCF5_MASK)

#define SARADC_CEOCF0_T0_IEOCF6_MASK             (0x40U)
#define SARADC_CEOCF0_T0_IEOCF6_SHIFT            (6U)
#define SARADC_CEOCF0_T0_IEOCF6_WIDTH            (1U)
#define SARADC_CEOCF0_T0_IEOCF6(x)               (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF0_T0_IEOCF6_SHIFT)) & SARADC_CEOCF0_T0_IEOCF6_MASK)

#define SARADC_CEOCF0_T0_IEOCF7_MASK             (0x80U)
#define SARADC_CEOCF0_T0_IEOCF7_SHIFT            (7U)
#define SARADC_CEOCF0_T0_IEOCF7_WIDTH            (1U)
#define SARADC_CEOCF0_T0_IEOCF7(x)               (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF0_T0_IEOCF7_SHIFT)) & SARADC_CEOCF0_T0_IEOCF7_MASK)

#define SARADC_CEOCF0_T0_IEOCF8_MASK             (0x100U)
#define SARADC_CEOCF0_T0_IEOCF8_SHIFT            (8U)
#define SARADC_CEOCF0_T0_IEOCF8_WIDTH            (1U)
#define SARADC_CEOCF0_T0_IEOCF8(x)               (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF0_T0_IEOCF8_SHIFT)) & SARADC_CEOCF0_T0_IEOCF8_MASK)

#define SARADC_CEOCF0_T0_IEOCF9_MASK             (0x200U)
#define SARADC_CEOCF0_T0_IEOCF9_SHIFT            (9U)
#define SARADC_CEOCF0_T0_IEOCF9_WIDTH            (1U)
#define SARADC_CEOCF0_T0_IEOCF9(x)               (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF0_T0_IEOCF9_SHIFT)) & SARADC_CEOCF0_T0_IEOCF9_MASK)

#define SARADC_CEOCF0_T0_IEOCF10_MASK            (0x400U)
#define SARADC_CEOCF0_T0_IEOCF10_SHIFT           (10U)
#define SARADC_CEOCF0_T0_IEOCF10_WIDTH           (1U)
#define SARADC_CEOCF0_T0_IEOCF10(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF0_T0_IEOCF10_SHIFT)) & SARADC_CEOCF0_T0_IEOCF10_MASK)

#define SARADC_CEOCF0_T0_IEOCF11_MASK            (0x800U)
#define SARADC_CEOCF0_T0_IEOCF11_SHIFT           (11U)
#define SARADC_CEOCF0_T0_IEOCF11_WIDTH           (1U)
#define SARADC_CEOCF0_T0_IEOCF11(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF0_T0_IEOCF11_SHIFT)) & SARADC_CEOCF0_T0_IEOCF11_MASK)

#define SARADC_CEOCF0_T0_IEOCF12_MASK            (0x1000U)
#define SARADC_CEOCF0_T0_IEOCF12_SHIFT           (12U)
#define SARADC_CEOCF0_T0_IEOCF12_WIDTH           (1U)
#define SARADC_CEOCF0_T0_IEOCF12(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF0_T0_IEOCF12_SHIFT)) & SARADC_CEOCF0_T0_IEOCF12_MASK)

#define SARADC_CEOCF0_T0_IEOCF13_MASK            (0x2000U)
#define SARADC_CEOCF0_T0_IEOCF13_SHIFT           (13U)
#define SARADC_CEOCF0_T0_IEOCF13_WIDTH           (1U)
#define SARADC_CEOCF0_T0_IEOCF13(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF0_T0_IEOCF13_SHIFT)) & SARADC_CEOCF0_T0_IEOCF13_MASK)

#define SARADC_CEOCF0_T0_IEOCF14_MASK            (0x4000U)
#define SARADC_CEOCF0_T0_IEOCF14_SHIFT           (14U)
#define SARADC_CEOCF0_T0_IEOCF14_WIDTH           (1U)
#define SARADC_CEOCF0_T0_IEOCF14(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF0_T0_IEOCF14_SHIFT)) & SARADC_CEOCF0_T0_IEOCF14_MASK)

#define SARADC_CEOCF0_T0_IEOCF15_MASK            (0x8000U)
#define SARADC_CEOCF0_T0_IEOCF15_SHIFT           (15U)
#define SARADC_CEOCF0_T0_IEOCF15_WIDTH           (1U)
#define SARADC_CEOCF0_T0_IEOCF15(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF0_T0_IEOCF15_SHIFT)) & SARADC_CEOCF0_T0_IEOCF15_MASK)

#define SARADC_CEOCF0_T0_IEOCF16_MASK            (0x10000U)
#define SARADC_CEOCF0_T0_IEOCF16_SHIFT           (16U)
#define SARADC_CEOCF0_T0_IEOCF16_WIDTH           (1U)
#define SARADC_CEOCF0_T0_IEOCF16(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF0_T0_IEOCF16_SHIFT)) & SARADC_CEOCF0_T0_IEOCF16_MASK)

#define SARADC_CEOCF0_T0_IEOCF17_MASK            (0x20000U)
#define SARADC_CEOCF0_T0_IEOCF17_SHIFT           (17U)
#define SARADC_CEOCF0_T0_IEOCF17_WIDTH           (1U)
#define SARADC_CEOCF0_T0_IEOCF17(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF0_T0_IEOCF17_SHIFT)) & SARADC_CEOCF0_T0_IEOCF17_MASK)

