zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SARADC.h
#define SARADC_CEOCF0_T0_IEOCF18_MASK            (0x40000U)
#define SARADC_CEOCF0_T0_IEOCF18_SHIFT           (18U)
#define SARADC_CEOCF0_T0_IEOCF18_WIDTH           (1U)
#define SARADC_CEOCF0_T0_IEOCF18(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF0_T0_IEOCF18_SHIFT)) & SARADC_CEOCF0_T0_IEOCF18_MASK)

#define SARADC_CEOCF0_T0_IEOCF19_MASK            (0x80000U)
#define SARADC_CEOCF0_T0_IEOCF19_SHIFT           (19U)
#define SARADC_CEOCF0_T0_IEOCF19_WIDTH           (1U)
#define SARADC_CEOCF0_T0_IEOCF19(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF0_T0_IEOCF19_SHIFT)) & SARADC_CEOCF0_T0_IEOCF19_MASK)

#define SARADC_CEOCF0_T0_IEOCF20_MASK            (0x100000U)
#define SARADC_CEOCF0_T0_IEOCF20_SHIFT           (20U)
#define SARADC_CEOCF0_T0_IEOCF20_WIDTH           (1U)
#define SARADC_CEOCF0_T0_IEOCF20(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF0_T0_IEOCF20_SHIFT)) & SARADC_CEOCF0_T0_IEOCF20_MASK)

#define SARADC_CEOCF0_T0_IEOCF21_MASK            (0x200000U)
#define SARADC_CEOCF0_T0_IEOCF21_SHIFT           (21U)
#define SARADC_CEOCF0_T0_IEOCF21_WIDTH           (1U)
#define SARADC_CEOCF0_T0_IEOCF21(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF0_T0_IEOCF21_SHIFT)) & SARADC_CEOCF0_T0_IEOCF21_MASK)

#define SARADC_CEOCF0_T0_IEOCF22_MASK            (0x400000U)
#define SARADC_CEOCF0_T0_IEOCF22_SHIFT           (22U)
#define SARADC_CEOCF0_T0_IEOCF22_WIDTH           (1U)
#define SARADC_CEOCF0_T0_IEOCF22(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF0_T0_IEOCF22_SHIFT)) & SARADC_CEOCF0_T0_IEOCF22_MASK)

#define SARADC_CEOCF0_T0_IEOCF23_MASK            (0x800000U)
#define SARADC_CEOCF0_T0_IEOCF23_SHIFT           (23U)
#define SARADC_CEOCF0_T0_IEOCF23_WIDTH           (1U)
#define SARADC_CEOCF0_T0_IEOCF23(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF0_T0_IEOCF23_SHIFT)) & SARADC_CEOCF0_T0_IEOCF23_MASK)

#define SARADC_CEOCF0_T0_IEOCF24_MASK            (0x1000000U)
#define SARADC_CEOCF0_T0_IEOCF24_SHIFT           (24U)
#define SARADC_CEOCF0_T0_IEOCF24_WIDTH           (1U)
#define SARADC_CEOCF0_T0_IEOCF24(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF0_T0_IEOCF24_SHIFT)) & SARADC_CEOCF0_T0_IEOCF24_MASK)

#define SARADC_CEOCF0_T0_IEOCF25_MASK            (0x2000000U)
#define SARADC_CEOCF0_T0_IEOCF25_SHIFT           (25U)
#define SARADC_CEOCF0_T0_IEOCF25_WIDTH           (1U)
#define SARADC_CEOCF0_T0_IEOCF25(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF0_T0_IEOCF25_SHIFT)) & SARADC_CEOCF0_T0_IEOCF25_MASK)

#define SARADC_CEOCF0_T0_IEOCF26_MASK            (0x4000000U)
#define SARADC_CEOCF0_T0_IEOCF26_SHIFT           (26U)
#define SARADC_CEOCF0_T0_IEOCF26_WIDTH           (1U)
#define SARADC_CEOCF0_T0_IEOCF26(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF0_T0_IEOCF26_SHIFT)) & SARADC_CEOCF0_T0_IEOCF26_MASK)

#define SARADC_CEOCF0_T0_IEOCF27_MASK            (0x8000000U)
#define SARADC_CEOCF0_T0_IEOCF27_SHIFT           (27U)
#define SARADC_CEOCF0_T0_IEOCF27_WIDTH           (1U)
#define SARADC_CEOCF0_T0_IEOCF27(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF0_T0_IEOCF27_SHIFT)) & SARADC_CEOCF0_T0_IEOCF27_MASK)

#define SARADC_CEOCF0_T0_IEOCF28_MASK            (0x10000000U)
#define SARADC_CEOCF0_T0_IEOCF28_SHIFT           (28U)
#define SARADC_CEOCF0_T0_IEOCF28_WIDTH           (1U)
#define SARADC_CEOCF0_T0_IEOCF28(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF0_T0_IEOCF28_SHIFT)) & SARADC_CEOCF0_T0_IEOCF28_MASK)

#define SARADC_CEOCF0_T0_IEOCF29_MASK            (0x20000000U)
#define SARADC_CEOCF0_T0_IEOCF29_SHIFT           (29U)
#define SARADC_CEOCF0_T0_IEOCF29_WIDTH           (1U)
#define SARADC_CEOCF0_T0_IEOCF29(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF0_T0_IEOCF29_SHIFT)) & SARADC_CEOCF0_T0_IEOCF29_MASK)

#define SARADC_CEOCF0_T0_IEOCF30_MASK            (0x40000000U)
#define SARADC_CEOCF0_T0_IEOCF30_SHIFT           (30U)
#define SARADC_CEOCF0_T0_IEOCF30_WIDTH           (1U)
#define SARADC_CEOCF0_T0_IEOCF30(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF0_T0_IEOCF30_SHIFT)) & SARADC_CEOCF0_T0_IEOCF30_MASK)

#define SARADC_CEOCF0_T0_IEOCF31_MASK            (0x80000000U)
#define SARADC_CEOCF0_T0_IEOCF31_SHIFT           (31U)
#define SARADC_CEOCF0_T0_IEOCF31_WIDTH           (1U)
#define SARADC_CEOCF0_T0_IEOCF31(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF0_T0_IEOCF31_SHIFT)) & SARADC_CEOCF0_T0_IEOCF31_MASK)
/*! @} */

/*! @name CEOCF1 - Channel End of Conversion Flag for Type 1 */
/*! @{ */

#define SARADC_CEOCF1_T1_IEOCF0_MASK             (0x1U)
#define SARADC_CEOCF1_T1_IEOCF0_SHIFT            (0U)
#define SARADC_CEOCF1_T1_IEOCF0_WIDTH            (1U)
#define SARADC_CEOCF1_T1_IEOCF0(x)               (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF1_T1_IEOCF0_SHIFT)) & SARADC_CEOCF1_T1_IEOCF0_MASK)

#define SARADC_CEOCF1_T1_IEOCF1_MASK             (0x2U)
#define SARADC_CEOCF1_T1_IEOCF1_SHIFT            (1U)
#define SARADC_CEOCF1_T1_IEOCF1_WIDTH            (1U)
#define SARADC_CEOCF1_T1_IEOCF1(x)               (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF1_T1_IEOCF1_SHIFT)) & SARADC_CEOCF1_T1_IEOCF1_MASK)

#define SARADC_CEOCF1_T1_IEOCF2_MASK             (0x4U)
#define SARADC_CEOCF1_T1_IEOCF2_SHIFT            (2U)
#define SARADC_CEOCF1_T1_IEOCF2_WIDTH            (1U)
#define SARADC_CEOCF1_T1_IEOCF2(x)               (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF1_T1_IEOCF2_SHIFT)) & SARADC_CEOCF1_T1_IEOCF2_MASK)

#define SARADC_CEOCF1_T1_IEOCF3_MASK             (0x8U)
#define SARADC_CEOCF1_T1_IEOCF3_SHIFT            (3U)
#define SARADC_CEOCF1_T1_IEOCF3_WIDTH            (1U)
#define SARADC_CEOCF1_T1_IEOCF3(x)               (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF1_T1_IEOCF3_SHIFT)) & SARADC_CEOCF1_T1_IEOCF3_MASK)

#define SARADC_CEOCF1_T1_IEOCF4_MASK             (0x10U)
#define SARADC_CEOCF1_T1_IEOCF4_SHIFT            (4U)
#define SARADC_CEOCF1_T1_IEOCF4_WIDTH            (1U)
#define SARADC_CEOCF1_T1_IEOCF4(x)               (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF1_T1_IEOCF4_SHIFT)) & SARADC_CEOCF1_T1_IEOCF4_MASK)

#define SARADC_CEOCF1_T1_IEOCF5_MASK             (0x20U)
#define SARADC_CEOCF1_T1_IEOCF5_SHIFT            (5U)
#define SARADC_CEOCF1_T1_IEOCF5_WIDTH            (1U)
#define SARADC_CEOCF1_T1_IEOCF5(x)               (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF1_T1_IEOCF5_SHIFT)) & SARADC_CEOCF1_T1_IEOCF5_MASK)

#define SARADC_CEOCF1_T1_IEOCF6_MASK             (0x40U)
#define SARADC_CEOCF1_T1_IEOCF6_SHIFT            (6U)
#define SARADC_CEOCF1_T1_IEOCF6_WIDTH            (1U)
#define SARADC_CEOCF1_T1_IEOCF6(x)               (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF1_T1_IEOCF6_SHIFT)) & SARADC_CEOCF1_T1_IEOCF6_MASK)

#define SARADC_CEOCF1_T1_IEOCF7_MASK             (0x80U)
#define SARADC_CEOCF1_T1_IEOCF7_SHIFT            (7U)
#define SARADC_CEOCF1_T1_IEOCF7_WIDTH            (1U)
#define SARADC_CEOCF1_T1_IEOCF7(x)               (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF1_T1_IEOCF7_SHIFT)) & SARADC_CEOCF1_T1_IEOCF7_MASK)

#define SARADC_CEOCF1_T1_IEOCF8_MASK             (0x100U)
#define SARADC_CEOCF1_T1_IEOCF8_SHIFT            (8U)
#define SARADC_CEOCF1_T1_IEOCF8_WIDTH            (1U)
#define SARADC_CEOCF1_T1_IEOCF8(x)               (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF1_T1_IEOCF8_SHIFT)) & SARADC_CEOCF1_T1_IEOCF8_MASK)

