zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SARADC.h
#define SARADC_CEOCF1_T1_IEOCF9_MASK             (0x200U)
#define SARADC_CEOCF1_T1_IEOCF9_SHIFT            (9U)
#define SARADC_CEOCF1_T1_IEOCF9_WIDTH            (1U)
#define SARADC_CEOCF1_T1_IEOCF9(x)               (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF1_T1_IEOCF9_SHIFT)) & SARADC_CEOCF1_T1_IEOCF9_MASK)

#define SARADC_CEOCF1_T1_IEOCF10_MASK            (0x400U)
#define SARADC_CEOCF1_T1_IEOCF10_SHIFT           (10U)
#define SARADC_CEOCF1_T1_IEOCF10_WIDTH           (1U)
#define SARADC_CEOCF1_T1_IEOCF10(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF1_T1_IEOCF10_SHIFT)) & SARADC_CEOCF1_T1_IEOCF10_MASK)

#define SARADC_CEOCF1_T1_IEOCF16_MASK            (0x10000U)
#define SARADC_CEOCF1_T1_IEOCF16_SHIFT           (16U)
#define SARADC_CEOCF1_T1_IEOCF16_WIDTH           (1U)
#define SARADC_CEOCF1_T1_IEOCF16(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF1_T1_IEOCF16_SHIFT)) & SARADC_CEOCF1_T1_IEOCF16_MASK)

#define SARADC_CEOCF1_T1_IEOCF17_MASK            (0x20000U)
#define SARADC_CEOCF1_T1_IEOCF17_SHIFT           (17U)
#define SARADC_CEOCF1_T1_IEOCF17_WIDTH           (1U)
#define SARADC_CEOCF1_T1_IEOCF17(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF1_T1_IEOCF17_SHIFT)) & SARADC_CEOCF1_T1_IEOCF17_MASK)

#define SARADC_CEOCF1_T1_IEOCF18_MASK            (0x40000U)
#define SARADC_CEOCF1_T1_IEOCF18_SHIFT           (18U)
#define SARADC_CEOCF1_T1_IEOCF18_WIDTH           (1U)
#define SARADC_CEOCF1_T1_IEOCF18(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF1_T1_IEOCF18_SHIFT)) & SARADC_CEOCF1_T1_IEOCF18_MASK)

#define SARADC_CEOCF1_T1_IEOCF19_MASK            (0x80000U)
#define SARADC_CEOCF1_T1_IEOCF19_SHIFT           (19U)
#define SARADC_CEOCF1_T1_IEOCF19_WIDTH           (1U)
#define SARADC_CEOCF1_T1_IEOCF19(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF1_T1_IEOCF19_SHIFT)) & SARADC_CEOCF1_T1_IEOCF19_MASK)

#define SARADC_CEOCF1_T1_IEOCF20_MASK            (0x100000U)
#define SARADC_CEOCF1_T1_IEOCF20_SHIFT           (20U)
#define SARADC_CEOCF1_T1_IEOCF20_WIDTH           (1U)
#define SARADC_CEOCF1_T1_IEOCF20(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF1_T1_IEOCF20_SHIFT)) & SARADC_CEOCF1_T1_IEOCF20_MASK)

#define SARADC_CEOCF1_T1_IEOCF21_MASK            (0x200000U)
#define SARADC_CEOCF1_T1_IEOCF21_SHIFT           (21U)
#define SARADC_CEOCF1_T1_IEOCF21_WIDTH           (1U)
#define SARADC_CEOCF1_T1_IEOCF21(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF1_T1_IEOCF21_SHIFT)) & SARADC_CEOCF1_T1_IEOCF21_MASK)

#define SARADC_CEOCF1_T1_IEOCF22_MASK            (0x400000U)
#define SARADC_CEOCF1_T1_IEOCF22_SHIFT           (22U)
#define SARADC_CEOCF1_T1_IEOCF22_WIDTH           (1U)
#define SARADC_CEOCF1_T1_IEOCF22(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF1_T1_IEOCF22_SHIFT)) & SARADC_CEOCF1_T1_IEOCF22_MASK)

#define SARADC_CEOCF1_T1_IEOCF23_MASK            (0x800000U)
#define SARADC_CEOCF1_T1_IEOCF23_SHIFT           (23U)
#define SARADC_CEOCF1_T1_IEOCF23_WIDTH           (1U)
#define SARADC_CEOCF1_T1_IEOCF23(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF1_T1_IEOCF23_SHIFT)) & SARADC_CEOCF1_T1_IEOCF23_MASK)

#define SARADC_CEOCF1_T1_IEOCF24_MASK            (0x1000000U)
#define SARADC_CEOCF1_T1_IEOCF24_SHIFT           (24U)
#define SARADC_CEOCF1_T1_IEOCF24_WIDTH           (1U)
#define SARADC_CEOCF1_T1_IEOCF24(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF1_T1_IEOCF24_SHIFT)) & SARADC_CEOCF1_T1_IEOCF24_MASK)

#define SARADC_CEOCF1_T1_IEOCF25_MASK            (0x2000000U)
#define SARADC_CEOCF1_T1_IEOCF25_SHIFT           (25U)
#define SARADC_CEOCF1_T1_IEOCF25_WIDTH           (1U)
#define SARADC_CEOCF1_T1_IEOCF25(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF1_T1_IEOCF25_SHIFT)) & SARADC_CEOCF1_T1_IEOCF25_MASK)

#define SARADC_CEOCF1_T1_IEOCF26_MASK            (0x4000000U)
#define SARADC_CEOCF1_T1_IEOCF26_SHIFT           (26U)
#define SARADC_CEOCF1_T1_IEOCF26_WIDTH           (1U)
#define SARADC_CEOCF1_T1_IEOCF26(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF1_T1_IEOCF26_SHIFT)) & SARADC_CEOCF1_T1_IEOCF26_MASK)
/*! @} */

/*! @name CEOCF2 - Channel End of Conversion Flag for Type 2 */
/*! @{ */

#define SARADC_CEOCF2_T2_IEOCF0_MASK             (0x1U)
#define SARADC_CEOCF2_T2_IEOCF0_SHIFT            (0U)
#define SARADC_CEOCF2_T2_IEOCF0_WIDTH            (1U)
#define SARADC_CEOCF2_T2_IEOCF0(x)               (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF2_T2_IEOCF0_SHIFT)) & SARADC_CEOCF2_T2_IEOCF0_MASK)

#define SARADC_CEOCF2_T2_IEOCF1_MASK             (0x2U)
#define SARADC_CEOCF2_T2_IEOCF1_SHIFT            (1U)
#define SARADC_CEOCF2_T2_IEOCF1_WIDTH            (1U)
#define SARADC_CEOCF2_T2_IEOCF1(x)               (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF2_T2_IEOCF1_SHIFT)) & SARADC_CEOCF2_T2_IEOCF1_MASK)

#define SARADC_CEOCF2_T2_IEOCF2_MASK             (0x4U)
#define SARADC_CEOCF2_T2_IEOCF2_SHIFT            (2U)
#define SARADC_CEOCF2_T2_IEOCF2_WIDTH            (1U)
#define SARADC_CEOCF2_T2_IEOCF2(x)               (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF2_T2_IEOCF2_SHIFT)) & SARADC_CEOCF2_T2_IEOCF2_MASK)

#define SARADC_CEOCF2_T2_IEOCF3_MASK             (0x8U)
#define SARADC_CEOCF2_T2_IEOCF3_SHIFT            (3U)
#define SARADC_CEOCF2_T2_IEOCF3_WIDTH            (1U)
#define SARADC_CEOCF2_T2_IEOCF3(x)               (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF2_T2_IEOCF3_SHIFT)) & SARADC_CEOCF2_T2_IEOCF3_MASK)

#define SARADC_CEOCF2_T2_IEOCF4_MASK             (0x10U)
#define SARADC_CEOCF2_T2_IEOCF4_SHIFT            (4U)
#define SARADC_CEOCF2_T2_IEOCF4_WIDTH            (1U)
#define SARADC_CEOCF2_T2_IEOCF4(x)               (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF2_T2_IEOCF4_SHIFT)) & SARADC_CEOCF2_T2_IEOCF4_MASK)

#define SARADC_CEOCF2_T2_IEOCF5_MASK             (0x20U)
#define SARADC_CEOCF2_T2_IEOCF5_SHIFT            (5U)
#define SARADC_CEOCF2_T2_IEOCF5_WIDTH            (1U)
#define SARADC_CEOCF2_T2_IEOCF5(x)               (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF2_T2_IEOCF5_SHIFT)) & SARADC_CEOCF2_T2_IEOCF5_MASK)

#define SARADC_CEOCF2_T2_IEOCF6_MASK             (0x40U)
#define SARADC_CEOCF2_T2_IEOCF6_SHIFT            (6U)
#define SARADC_CEOCF2_T2_IEOCF6_WIDTH            (1U)
#define SARADC_CEOCF2_T2_IEOCF6(x)               (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF2_T2_IEOCF6_SHIFT)) & SARADC_CEOCF2_T2_IEOCF6_MASK)

#define SARADC_CEOCF2_T2_IEOCF7_MASK             (0x80U)
#define SARADC_CEOCF2_T2_IEOCF7_SHIFT            (7U)
#define SARADC_CEOCF2_T2_IEOCF7_WIDTH            (1U)
#define SARADC_CEOCF2_T2_IEOCF7(x)               (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF2_T2_IEOCF7_SHIFT)) & SARADC_CEOCF2_T2_IEOCF7_MASK)

#define SARADC_CEOCF2_T2_IEOCF8_MASK             (0x100U)
#define SARADC_CEOCF2_T2_IEOCF8_SHIFT            (8U)
#define SARADC_CEOCF2_T2_IEOCF8_WIDTH            (1U)
#define SARADC_CEOCF2_T2_IEOCF8(x)               (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF2_T2_IEOCF8_SHIFT)) & SARADC_CEOCF2_T2_IEOCF8_MASK)

#define SARADC_CEOCF2_T2_IEOCF9_MASK             (0x200U)
#define SARADC_CEOCF2_T2_IEOCF9_SHIFT            (9U)
#define SARADC_CEOCF2_T2_IEOCF9_WIDTH            (1U)
#define SARADC_CEOCF2_T2_IEOCF9(x)               (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF2_T2_IEOCF9_SHIFT)) & SARADC_CEOCF2_T2_IEOCF9_MASK)

#define SARADC_CEOCF2_T2_IEOCF10_MASK            (0x400U)
#define SARADC_CEOCF2_T2_IEOCF10_SHIFT           (10U)
#define SARADC_CEOCF2_T2_IEOCF10_WIDTH           (1U)
#define SARADC_CEOCF2_T2_IEOCF10(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF2_T2_IEOCF10_SHIFT)) & SARADC_CEOCF2_T2_IEOCF10_MASK)

