zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SARADC.h
#define SARADC_CEOCF2_T2_IEOCF11_MASK            (0x800U)
#define SARADC_CEOCF2_T2_IEOCF11_SHIFT           (11U)
#define SARADC_CEOCF2_T2_IEOCF11_WIDTH           (1U)
#define SARADC_CEOCF2_T2_IEOCF11(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF2_T2_IEOCF11_SHIFT)) & SARADC_CEOCF2_T2_IEOCF11_MASK)

#define SARADC_CEOCF2_T2_IEOCF12_MASK            (0x1000U)
#define SARADC_CEOCF2_T2_IEOCF12_SHIFT           (12U)
#define SARADC_CEOCF2_T2_IEOCF12_WIDTH           (1U)
#define SARADC_CEOCF2_T2_IEOCF12(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF2_T2_IEOCF12_SHIFT)) & SARADC_CEOCF2_T2_IEOCF12_MASK)

#define SARADC_CEOCF2_T2_IEOCF13_MASK            (0x2000U)
#define SARADC_CEOCF2_T2_IEOCF13_SHIFT           (13U)
#define SARADC_CEOCF2_T2_IEOCF13_WIDTH           (1U)
#define SARADC_CEOCF2_T2_IEOCF13(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF2_T2_IEOCF13_SHIFT)) & SARADC_CEOCF2_T2_IEOCF13_MASK)

#define SARADC_CEOCF2_T2_IEOCF14_MASK            (0x4000U)
#define SARADC_CEOCF2_T2_IEOCF14_SHIFT           (14U)
#define SARADC_CEOCF2_T2_IEOCF14_WIDTH           (1U)
#define SARADC_CEOCF2_T2_IEOCF14(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF2_T2_IEOCF14_SHIFT)) & SARADC_CEOCF2_T2_IEOCF14_MASK)

#define SARADC_CEOCF2_T2_IEOCF15_MASK            (0x8000U)
#define SARADC_CEOCF2_T2_IEOCF15_SHIFT           (15U)
#define SARADC_CEOCF2_T2_IEOCF15_WIDTH           (1U)
#define SARADC_CEOCF2_T2_IEOCF15(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF2_T2_IEOCF15_SHIFT)) & SARADC_CEOCF2_T2_IEOCF15_MASK)

#define SARADC_CEOCF2_T2_IEOCF16_MASK            (0x10000U)
#define SARADC_CEOCF2_T2_IEOCF16_SHIFT           (16U)
#define SARADC_CEOCF2_T2_IEOCF16_WIDTH           (1U)
#define SARADC_CEOCF2_T2_IEOCF16(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF2_T2_IEOCF16_SHIFT)) & SARADC_CEOCF2_T2_IEOCF16_MASK)

#define SARADC_CEOCF2_T2_IEOCF17_MASK            (0x20000U)
#define SARADC_CEOCF2_T2_IEOCF17_SHIFT           (17U)
#define SARADC_CEOCF2_T2_IEOCF17_WIDTH           (1U)
#define SARADC_CEOCF2_T2_IEOCF17(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF2_T2_IEOCF17_SHIFT)) & SARADC_CEOCF2_T2_IEOCF17_MASK)

#define SARADC_CEOCF2_T2_IEOCF18_MASK            (0x40000U)
#define SARADC_CEOCF2_T2_IEOCF18_SHIFT           (18U)
#define SARADC_CEOCF2_T2_IEOCF18_WIDTH           (1U)
#define SARADC_CEOCF2_T2_IEOCF18(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF2_T2_IEOCF18_SHIFT)) & SARADC_CEOCF2_T2_IEOCF18_MASK)

#define SARADC_CEOCF2_T2_IEOCF19_MASK            (0x80000U)
#define SARADC_CEOCF2_T2_IEOCF19_SHIFT           (19U)
#define SARADC_CEOCF2_T2_IEOCF19_WIDTH           (1U)
#define SARADC_CEOCF2_T2_IEOCF19(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF2_T2_IEOCF19_SHIFT)) & SARADC_CEOCF2_T2_IEOCF19_MASK)

#define SARADC_CEOCF2_T2_IEOCF20_MASK            (0x100000U)
#define SARADC_CEOCF2_T2_IEOCF20_SHIFT           (20U)
#define SARADC_CEOCF2_T2_IEOCF20_WIDTH           (1U)
#define SARADC_CEOCF2_T2_IEOCF20(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF2_T2_IEOCF20_SHIFT)) & SARADC_CEOCF2_T2_IEOCF20_MASK)

#define SARADC_CEOCF2_T2_IEOCF21_MASK            (0x200000U)
#define SARADC_CEOCF2_T2_IEOCF21_SHIFT           (21U)
#define SARADC_CEOCF2_T2_IEOCF21_WIDTH           (1U)
#define SARADC_CEOCF2_T2_IEOCF21(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF2_T2_IEOCF21_SHIFT)) & SARADC_CEOCF2_T2_IEOCF21_MASK)

#define SARADC_CEOCF2_T2_IEOCF22_MASK            (0x400000U)
#define SARADC_CEOCF2_T2_IEOCF22_SHIFT           (22U)
#define SARADC_CEOCF2_T2_IEOCF22_WIDTH           (1U)
#define SARADC_CEOCF2_T2_IEOCF22(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF2_T2_IEOCF22_SHIFT)) & SARADC_CEOCF2_T2_IEOCF22_MASK)

#define SARADC_CEOCF2_T2_IEOCF23_MASK            (0x800000U)
#define SARADC_CEOCF2_T2_IEOCF23_SHIFT           (23U)
#define SARADC_CEOCF2_T2_IEOCF23_WIDTH           (1U)
#define SARADC_CEOCF2_T2_IEOCF23(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF2_T2_IEOCF23_SHIFT)) & SARADC_CEOCF2_T2_IEOCF23_MASK)

#define SARADC_CEOCF2_T2_IEOCF24_MASK            (0x1000000U)
#define SARADC_CEOCF2_T2_IEOCF24_SHIFT           (24U)
#define SARADC_CEOCF2_T2_IEOCF24_WIDTH           (1U)
#define SARADC_CEOCF2_T2_IEOCF24(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF2_T2_IEOCF24_SHIFT)) & SARADC_CEOCF2_T2_IEOCF24_MASK)

#define SARADC_CEOCF2_T2_IEOCF25_MASK            (0x2000000U)
#define SARADC_CEOCF2_T2_IEOCF25_SHIFT           (25U)
#define SARADC_CEOCF2_T2_IEOCF25_WIDTH           (1U)
#define SARADC_CEOCF2_T2_IEOCF25(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF2_T2_IEOCF25_SHIFT)) & SARADC_CEOCF2_T2_IEOCF25_MASK)

#define SARADC_CEOCF2_T2_IEOCF26_MASK            (0x4000000U)
#define SARADC_CEOCF2_T2_IEOCF26_SHIFT           (26U)
#define SARADC_CEOCF2_T2_IEOCF26_WIDTH           (1U)
#define SARADC_CEOCF2_T2_IEOCF26(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF2_T2_IEOCF26_SHIFT)) & SARADC_CEOCF2_T2_IEOCF26_MASK)

#define SARADC_CEOCF2_T2_IEOCF27_MASK            (0x8000000U)
#define SARADC_CEOCF2_T2_IEOCF27_SHIFT           (27U)
#define SARADC_CEOCF2_T2_IEOCF27_WIDTH           (1U)
#define SARADC_CEOCF2_T2_IEOCF27(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF2_T2_IEOCF27_SHIFT)) & SARADC_CEOCF2_T2_IEOCF27_MASK)

#define SARADC_CEOCF2_T2_IEOCF28_MASK            (0x10000000U)
#define SARADC_CEOCF2_T2_IEOCF28_SHIFT           (28U)
#define SARADC_CEOCF2_T2_IEOCF28_WIDTH           (1U)
#define SARADC_CEOCF2_T2_IEOCF28(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF2_T2_IEOCF28_SHIFT)) & SARADC_CEOCF2_T2_IEOCF28_MASK)

#define SARADC_CEOCF2_T2_IEOCF29_MASK            (0x20000000U)
#define SARADC_CEOCF2_T2_IEOCF29_SHIFT           (29U)
#define SARADC_CEOCF2_T2_IEOCF29_WIDTH           (1U)
#define SARADC_CEOCF2_T2_IEOCF29(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF2_T2_IEOCF29_SHIFT)) & SARADC_CEOCF2_T2_IEOCF29_MASK)

#define SARADC_CEOCF2_T2_IEOCF30_MASK            (0x40000000U)
#define SARADC_CEOCF2_T2_IEOCF30_SHIFT           (30U)
#define SARADC_CEOCF2_T2_IEOCF30_WIDTH           (1U)
#define SARADC_CEOCF2_T2_IEOCF30(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF2_T2_IEOCF30_SHIFT)) & SARADC_CEOCF2_T2_IEOCF30_MASK)

#define SARADC_CEOCF2_T2_IEOCF31_MASK            (0x80000000U)
#define SARADC_CEOCF2_T2_IEOCF31_SHIFT           (31U)
#define SARADC_CEOCF2_T2_IEOCF31_WIDTH           (1U)
#define SARADC_CEOCF2_T2_IEOCF31(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_CEOCF2_T2_IEOCF31_SHIFT)) & SARADC_CEOCF2_T2_IEOCF31_MASK)
/*! @} */

/*! @name IM - Interrupt Mask */
/*! @{ */

#define SARADC_IM_MSKECH_MASK                    (0x1U)
#define SARADC_IM_MSKECH_SHIFT                   (0U)
#define SARADC_IM_MSKECH_WIDTH                   (1U)
#define SARADC_IM_MSKECH(x)                      (((uint32_t)(((uint32_t)(x)) << SARADC_IM_MSKECH_SHIFT)) & SARADC_IM_MSKECH_MASK)

