zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SARADC.h
#define SARADC_IM_MSKEOC_MASK                    (0x2U)
#define SARADC_IM_MSKEOC_SHIFT                   (1U)
#define SARADC_IM_MSKEOC_WIDTH                   (1U)
#define SARADC_IM_MSKEOC(x)                      (((uint32_t)(((uint32_t)(x)) << SARADC_IM_MSKEOC_SHIFT)) & SARADC_IM_MSKEOC_MASK)

#define SARADC_IM_MSKJECH_MASK                   (0x4U)
#define SARADC_IM_MSKJECH_SHIFT                  (2U)
#define SARADC_IM_MSKJECH_WIDTH                  (1U)
#define SARADC_IM_MSKJECH(x)                     (((uint32_t)(((uint32_t)(x)) << SARADC_IM_MSKJECH_SHIFT)) & SARADC_IM_MSKJECH_MASK)

#define SARADC_IM_MSKJEOC_MASK                   (0x8U)
#define SARADC_IM_MSKJEOC_SHIFT                  (3U)
#define SARADC_IM_MSKJEOC_WIDTH                  (1U)
#define SARADC_IM_MSKJEOC(x)                     (((uint32_t)(((uint32_t)(x)) << SARADC_IM_MSKJEOC_SHIFT)) & SARADC_IM_MSKJEOC_MASK)

#define SARADC_IM_MSKEOBCTU_MASK                 (0x10U)
#define SARADC_IM_MSKEOBCTU_SHIFT                (4U)
#define SARADC_IM_MSKEOBCTU_WIDTH                (1U)
#define SARADC_IM_MSKEOBCTU(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_IM_MSKEOBCTU_SHIFT)) & SARADC_IM_MSKEOBCTU_MASK)
/*! @} */

/*! @name CIM0 - EOC Interrupt Enable for Type 0 */
/*! @{ */

#define SARADC_CIM0_T0EOCIEN0_MASK               (0x1U)
#define SARADC_CIM0_T0EOCIEN0_SHIFT              (0U)
#define SARADC_CIM0_T0EOCIEN0_WIDTH              (1U)
#define SARADC_CIM0_T0EOCIEN0(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CIM0_T0EOCIEN0_SHIFT)) & SARADC_CIM0_T0EOCIEN0_MASK)

#define SARADC_CIM0_T0EOCIEN1_MASK               (0x2U)
#define SARADC_CIM0_T0EOCIEN1_SHIFT              (1U)
#define SARADC_CIM0_T0EOCIEN1_WIDTH              (1U)
#define SARADC_CIM0_T0EOCIEN1(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CIM0_T0EOCIEN1_SHIFT)) & SARADC_CIM0_T0EOCIEN1_MASK)

#define SARADC_CIM0_T0EOCIEN2_MASK               (0x4U)
#define SARADC_CIM0_T0EOCIEN2_SHIFT              (2U)
#define SARADC_CIM0_T0EOCIEN2_WIDTH              (1U)
#define SARADC_CIM0_T0EOCIEN2(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CIM0_T0EOCIEN2_SHIFT)) & SARADC_CIM0_T0EOCIEN2_MASK)

#define SARADC_CIM0_T0EOCIEN3_MASK               (0x8U)
#define SARADC_CIM0_T0EOCIEN3_SHIFT              (3U)
#define SARADC_CIM0_T0EOCIEN3_WIDTH              (1U)
#define SARADC_CIM0_T0EOCIEN3(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CIM0_T0EOCIEN3_SHIFT)) & SARADC_CIM0_T0EOCIEN3_MASK)

#define SARADC_CIM0_T0EOCIEN4_MASK               (0x10U)
#define SARADC_CIM0_T0EOCIEN4_SHIFT              (4U)
#define SARADC_CIM0_T0EOCIEN4_WIDTH              (1U)
#define SARADC_CIM0_T0EOCIEN4(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CIM0_T0EOCIEN4_SHIFT)) & SARADC_CIM0_T0EOCIEN4_MASK)

#define SARADC_CIM0_T0EOCIEN5_MASK               (0x20U)
#define SARADC_CIM0_T0EOCIEN5_SHIFT              (5U)
#define SARADC_CIM0_T0EOCIEN5_WIDTH              (1U)
#define SARADC_CIM0_T0EOCIEN5(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CIM0_T0EOCIEN5_SHIFT)) & SARADC_CIM0_T0EOCIEN5_MASK)

#define SARADC_CIM0_T0EOCIEN6_MASK               (0x40U)
#define SARADC_CIM0_T0EOCIEN6_SHIFT              (6U)
#define SARADC_CIM0_T0EOCIEN6_WIDTH              (1U)
#define SARADC_CIM0_T0EOCIEN6(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CIM0_T0EOCIEN6_SHIFT)) & SARADC_CIM0_T0EOCIEN6_MASK)

#define SARADC_CIM0_T0EOCIEN7_MASK               (0x80U)
#define SARADC_CIM0_T0EOCIEN7_SHIFT              (7U)
#define SARADC_CIM0_T0EOCIEN7_WIDTH              (1U)
#define SARADC_CIM0_T0EOCIEN7(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CIM0_T0EOCIEN7_SHIFT)) & SARADC_CIM0_T0EOCIEN7_MASK)

#define SARADC_CIM0_T0EOCIEN8_MASK               (0x100U)
#define SARADC_CIM0_T0EOCIEN8_SHIFT              (8U)
#define SARADC_CIM0_T0EOCIEN8_WIDTH              (1U)
#define SARADC_CIM0_T0EOCIEN8(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CIM0_T0EOCIEN8_SHIFT)) & SARADC_CIM0_T0EOCIEN8_MASK)

#define SARADC_CIM0_T0EOCIEN9_MASK               (0x200U)
#define SARADC_CIM0_T0EOCIEN9_SHIFT              (9U)
#define SARADC_CIM0_T0EOCIEN9_WIDTH              (1U)
#define SARADC_CIM0_T0EOCIEN9(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CIM0_T0EOCIEN9_SHIFT)) & SARADC_CIM0_T0EOCIEN9_MASK)

#define SARADC_CIM0_T0EOCIEN10_MASK              (0x400U)
#define SARADC_CIM0_T0EOCIEN10_SHIFT             (10U)
#define SARADC_CIM0_T0EOCIEN10_WIDTH             (1U)
#define SARADC_CIM0_T0EOCIEN10(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_CIM0_T0EOCIEN10_SHIFT)) & SARADC_CIM0_T0EOCIEN10_MASK)

#define SARADC_CIM0_T0EOCIEN11_MASK              (0x800U)
#define SARADC_CIM0_T0EOCIEN11_SHIFT             (11U)
#define SARADC_CIM0_T0EOCIEN11_WIDTH             (1U)
#define SARADC_CIM0_T0EOCIEN11(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_CIM0_T0EOCIEN11_SHIFT)) & SARADC_CIM0_T0EOCIEN11_MASK)

#define SARADC_CIM0_T0EOCIEN12_MASK              (0x1000U)
#define SARADC_CIM0_T0EOCIEN12_SHIFT             (12U)
#define SARADC_CIM0_T0EOCIEN12_WIDTH             (1U)
#define SARADC_CIM0_T0EOCIEN12(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_CIM0_T0EOCIEN12_SHIFT)) & SARADC_CIM0_T0EOCIEN12_MASK)

#define SARADC_CIM0_T0EOCIEN13_MASK              (0x2000U)
#define SARADC_CIM0_T0EOCIEN13_SHIFT             (13U)
#define SARADC_CIM0_T0EOCIEN13_WIDTH             (1U)
#define SARADC_CIM0_T0EOCIEN13(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_CIM0_T0EOCIEN13_SHIFT)) & SARADC_CIM0_T0EOCIEN13_MASK)

#define SARADC_CIM0_T0EOCIEN14_MASK              (0x4000U)
#define SARADC_CIM0_T0EOCIEN14_SHIFT             (14U)
#define SARADC_CIM0_T0EOCIEN14_WIDTH             (1U)
#define SARADC_CIM0_T0EOCIEN14(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_CIM0_T0EOCIEN14_SHIFT)) & SARADC_CIM0_T0EOCIEN14_MASK)

#define SARADC_CIM0_T0EOCIEN15_MASK              (0x8000U)
#define SARADC_CIM0_T0EOCIEN15_SHIFT             (15U)
#define SARADC_CIM0_T0EOCIEN15_WIDTH             (1U)
#define SARADC_CIM0_T0EOCIEN15(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_CIM0_T0EOCIEN15_SHIFT)) & SARADC_CIM0_T0EOCIEN15_MASK)

