zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SARADC.h
#define SARADC_CIM0_T0EOCIEN16_MASK              (0x10000U)
#define SARADC_CIM0_T0EOCIEN16_SHIFT             (16U)
#define SARADC_CIM0_T0EOCIEN16_WIDTH             (1U)
#define SARADC_CIM0_T0EOCIEN16(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_CIM0_T0EOCIEN16_SHIFT)) & SARADC_CIM0_T0EOCIEN16_MASK)

#define SARADC_CIM0_T0EOCIEN17_MASK              (0x20000U)
#define SARADC_CIM0_T0EOCIEN17_SHIFT             (17U)
#define SARADC_CIM0_T0EOCIEN17_WIDTH             (1U)
#define SARADC_CIM0_T0EOCIEN17(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_CIM0_T0EOCIEN17_SHIFT)) & SARADC_CIM0_T0EOCIEN17_MASK)

#define SARADC_CIM0_T0EOCIEN18_MASK              (0x40000U)
#define SARADC_CIM0_T0EOCIEN18_SHIFT             (18U)
#define SARADC_CIM0_T0EOCIEN18_WIDTH             (1U)
#define SARADC_CIM0_T0EOCIEN18(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_CIM0_T0EOCIEN18_SHIFT)) & SARADC_CIM0_T0EOCIEN18_MASK)

#define SARADC_CIM0_T0EOCIEN19_MASK              (0x80000U)
#define SARADC_CIM0_T0EOCIEN19_SHIFT             (19U)
#define SARADC_CIM0_T0EOCIEN19_WIDTH             (1U)
#define SARADC_CIM0_T0EOCIEN19(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_CIM0_T0EOCIEN19_SHIFT)) & SARADC_CIM0_T0EOCIEN19_MASK)

#define SARADC_CIM0_T0EOCIEN20_MASK              (0x100000U)
#define SARADC_CIM0_T0EOCIEN20_SHIFT             (20U)
#define SARADC_CIM0_T0EOCIEN20_WIDTH             (1U)
#define SARADC_CIM0_T0EOCIEN20(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_CIM0_T0EOCIEN20_SHIFT)) & SARADC_CIM0_T0EOCIEN20_MASK)

#define SARADC_CIM0_T0EOCIEN21_MASK              (0x200000U)
#define SARADC_CIM0_T0EOCIEN21_SHIFT             (21U)
#define SARADC_CIM0_T0EOCIEN21_WIDTH             (1U)
#define SARADC_CIM0_T0EOCIEN21(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_CIM0_T0EOCIEN21_SHIFT)) & SARADC_CIM0_T0EOCIEN21_MASK)

#define SARADC_CIM0_T0EOCIEN22_MASK              (0x400000U)
#define SARADC_CIM0_T0EOCIEN22_SHIFT             (22U)
#define SARADC_CIM0_T0EOCIEN22_WIDTH             (1U)
#define SARADC_CIM0_T0EOCIEN22(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_CIM0_T0EOCIEN22_SHIFT)) & SARADC_CIM0_T0EOCIEN22_MASK)

#define SARADC_CIM0_T0EOCIEN23_MASK              (0x800000U)
#define SARADC_CIM0_T0EOCIEN23_SHIFT             (23U)
#define SARADC_CIM0_T0EOCIEN23_WIDTH             (1U)
#define SARADC_CIM0_T0EOCIEN23(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_CIM0_T0EOCIEN23_SHIFT)) & SARADC_CIM0_T0EOCIEN23_MASK)

#define SARADC_CIM0_T0EOCIEN24_MASK              (0x1000000U)
#define SARADC_CIM0_T0EOCIEN24_SHIFT             (24U)
#define SARADC_CIM0_T0EOCIEN24_WIDTH             (1U)
#define SARADC_CIM0_T0EOCIEN24(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_CIM0_T0EOCIEN24_SHIFT)) & SARADC_CIM0_T0EOCIEN24_MASK)

#define SARADC_CIM0_T0EOCIEN25_MASK              (0x2000000U)
#define SARADC_CIM0_T0EOCIEN25_SHIFT             (25U)
#define SARADC_CIM0_T0EOCIEN25_WIDTH             (1U)
#define SARADC_CIM0_T0EOCIEN25(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_CIM0_T0EOCIEN25_SHIFT)) & SARADC_CIM0_T0EOCIEN25_MASK)

#define SARADC_CIM0_T0EOCIEN26_MASK              (0x4000000U)
#define SARADC_CIM0_T0EOCIEN26_SHIFT             (26U)
#define SARADC_CIM0_T0EOCIEN26_WIDTH             (1U)
#define SARADC_CIM0_T0EOCIEN26(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_CIM0_T0EOCIEN26_SHIFT)) & SARADC_CIM0_T0EOCIEN26_MASK)

#define SARADC_CIM0_T0EOCIEN27_MASK              (0x8000000U)
#define SARADC_CIM0_T0EOCIEN27_SHIFT             (27U)
#define SARADC_CIM0_T0EOCIEN27_WIDTH             (1U)
#define SARADC_CIM0_T0EOCIEN27(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_CIM0_T0EOCIEN27_SHIFT)) & SARADC_CIM0_T0EOCIEN27_MASK)

#define SARADC_CIM0_T0EOCIEN28_MASK              (0x10000000U)
#define SARADC_CIM0_T0EOCIEN28_SHIFT             (28U)
#define SARADC_CIM0_T0EOCIEN28_WIDTH             (1U)
#define SARADC_CIM0_T0EOCIEN28(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_CIM0_T0EOCIEN28_SHIFT)) & SARADC_CIM0_T0EOCIEN28_MASK)

#define SARADC_CIM0_T0EOCIEN29_MASK              (0x20000000U)
#define SARADC_CIM0_T0EOCIEN29_SHIFT             (29U)
#define SARADC_CIM0_T0EOCIEN29_WIDTH             (1U)
#define SARADC_CIM0_T0EOCIEN29(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_CIM0_T0EOCIEN29_SHIFT)) & SARADC_CIM0_T0EOCIEN29_MASK)

#define SARADC_CIM0_T0EOCIEN30_MASK              (0x40000000U)
#define SARADC_CIM0_T0EOCIEN30_SHIFT             (30U)
#define SARADC_CIM0_T0EOCIEN30_WIDTH             (1U)
#define SARADC_CIM0_T0EOCIEN30(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_CIM0_T0EOCIEN30_SHIFT)) & SARADC_CIM0_T0EOCIEN30_MASK)

#define SARADC_CIM0_T0EOCIEN31_MASK              (0x80000000U)
#define SARADC_CIM0_T0EOCIEN31_SHIFT             (31U)
#define SARADC_CIM0_T0EOCIEN31_WIDTH             (1U)
#define SARADC_CIM0_T0EOCIEN31(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_CIM0_T0EOCIEN31_SHIFT)) & SARADC_CIM0_T0EOCIEN31_MASK)
/*! @} */

/*! @name CIM1 - EOC Interrupt Enable for Type 1 */
/*! @{ */

#define SARADC_CIM1_T1EOCIEN0_MASK               (0x1U)
#define SARADC_CIM1_T1EOCIEN0_SHIFT              (0U)
#define SARADC_CIM1_T1EOCIEN0_WIDTH              (1U)
#define SARADC_CIM1_T1EOCIEN0(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CIM1_T1EOCIEN0_SHIFT)) & SARADC_CIM1_T1EOCIEN0_MASK)

#define SARADC_CIM1_T1EOCIEN1_MASK               (0x2U)
#define SARADC_CIM1_T1EOCIEN1_SHIFT              (1U)
#define SARADC_CIM1_T1EOCIEN1_WIDTH              (1U)
#define SARADC_CIM1_T1EOCIEN1(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CIM1_T1EOCIEN1_SHIFT)) & SARADC_CIM1_T1EOCIEN1_MASK)

#define SARADC_CIM1_T1EOCIEN2_MASK               (0x4U)
#define SARADC_CIM1_T1EOCIEN2_SHIFT              (2U)
#define SARADC_CIM1_T1EOCIEN2_WIDTH              (1U)
#define SARADC_CIM1_T1EOCIEN2(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CIM1_T1EOCIEN2_SHIFT)) & SARADC_CIM1_T1EOCIEN2_MASK)

#define SARADC_CIM1_T1EOCIEN3_MASK               (0x8U)
#define SARADC_CIM1_T1EOCIEN3_SHIFT              (3U)
#define SARADC_CIM1_T1EOCIEN3_WIDTH              (1U)
#define SARADC_CIM1_T1EOCIEN3(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CIM1_T1EOCIEN3_SHIFT)) & SARADC_CIM1_T1EOCIEN3_MASK)

#define SARADC_CIM1_T1EOCIEN4_MASK               (0x10U)
#define SARADC_CIM1_T1EOCIEN4_SHIFT              (4U)
#define SARADC_CIM1_T1EOCIEN4_WIDTH              (1U)
#define SARADC_CIM1_T1EOCIEN4(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CIM1_T1EOCIEN4_SHIFT)) & SARADC_CIM1_T1EOCIEN4_MASK)

