zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SARADC.h
#define SARADC_CIM1_T1EOCIEN5_MASK               (0x20U)
#define SARADC_CIM1_T1EOCIEN5_SHIFT              (5U)
#define SARADC_CIM1_T1EOCIEN5_WIDTH              (1U)
#define SARADC_CIM1_T1EOCIEN5(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CIM1_T1EOCIEN5_SHIFT)) & SARADC_CIM1_T1EOCIEN5_MASK)

#define SARADC_CIM1_T1EOCIEN6_MASK               (0x40U)
#define SARADC_CIM1_T1EOCIEN6_SHIFT              (6U)
#define SARADC_CIM1_T1EOCIEN6_WIDTH              (1U)
#define SARADC_CIM1_T1EOCIEN6(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CIM1_T1EOCIEN6_SHIFT)) & SARADC_CIM1_T1EOCIEN6_MASK)

#define SARADC_CIM1_T1EOCIEN7_MASK               (0x80U)
#define SARADC_CIM1_T1EOCIEN7_SHIFT              (7U)
#define SARADC_CIM1_T1EOCIEN7_WIDTH              (1U)
#define SARADC_CIM1_T1EOCIEN7(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CIM1_T1EOCIEN7_SHIFT)) & SARADC_CIM1_T1EOCIEN7_MASK)

#define SARADC_CIM1_T1EOCIEN8_MASK               (0x100U)
#define SARADC_CIM1_T1EOCIEN8_SHIFT              (8U)
#define SARADC_CIM1_T1EOCIEN8_WIDTH              (1U)
#define SARADC_CIM1_T1EOCIEN8(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CIM1_T1EOCIEN8_SHIFT)) & SARADC_CIM1_T1EOCIEN8_MASK)

#define SARADC_CIM1_T1EOCIEN9_MASK               (0x200U)
#define SARADC_CIM1_T1EOCIEN9_SHIFT              (9U)
#define SARADC_CIM1_T1EOCIEN9_WIDTH              (1U)
#define SARADC_CIM1_T1EOCIEN9(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CIM1_T1EOCIEN9_SHIFT)) & SARADC_CIM1_T1EOCIEN9_MASK)

#define SARADC_CIM1_T1EOCIEN10_MASK              (0x400U)
#define SARADC_CIM1_T1EOCIEN10_SHIFT             (10U)
#define SARADC_CIM1_T1EOCIEN10_WIDTH             (1U)
#define SARADC_CIM1_T1EOCIEN10(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_CIM1_T1EOCIEN10_SHIFT)) & SARADC_CIM1_T1EOCIEN10_MASK)

#define SARADC_CIM1_T1EOCIEN16_MASK              (0x10000U)
#define SARADC_CIM1_T1EOCIEN16_SHIFT             (16U)
#define SARADC_CIM1_T1EOCIEN16_WIDTH             (1U)
#define SARADC_CIM1_T1EOCIEN16(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_CIM1_T1EOCIEN16_SHIFT)) & SARADC_CIM1_T1EOCIEN16_MASK)

#define SARADC_CIM1_T1EOCIEN17_MASK              (0x20000U)
#define SARADC_CIM1_T1EOCIEN17_SHIFT             (17U)
#define SARADC_CIM1_T1EOCIEN17_WIDTH             (1U)
#define SARADC_CIM1_T1EOCIEN17(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_CIM1_T1EOCIEN17_SHIFT)) & SARADC_CIM1_T1EOCIEN17_MASK)

#define SARADC_CIM1_T1EOCIEN18_MASK              (0x40000U)
#define SARADC_CIM1_T1EOCIEN18_SHIFT             (18U)
#define SARADC_CIM1_T1EOCIEN18_WIDTH             (1U)
#define SARADC_CIM1_T1EOCIEN18(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_CIM1_T1EOCIEN18_SHIFT)) & SARADC_CIM1_T1EOCIEN18_MASK)

#define SARADC_CIM1_T1EOCIEN19_MASK              (0x80000U)
#define SARADC_CIM1_T1EOCIEN19_SHIFT             (19U)
#define SARADC_CIM1_T1EOCIEN19_WIDTH             (1U)
#define SARADC_CIM1_T1EOCIEN19(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_CIM1_T1EOCIEN19_SHIFT)) & SARADC_CIM1_T1EOCIEN19_MASK)

#define SARADC_CIM1_T1EOCIEN20_MASK              (0x100000U)
#define SARADC_CIM1_T1EOCIEN20_SHIFT             (20U)
#define SARADC_CIM1_T1EOCIEN20_WIDTH             (1U)
#define SARADC_CIM1_T1EOCIEN20(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_CIM1_T1EOCIEN20_SHIFT)) & SARADC_CIM1_T1EOCIEN20_MASK)

#define SARADC_CIM1_T1EOCIEN21_MASK              (0x200000U)
#define SARADC_CIM1_T1EOCIEN21_SHIFT             (21U)
#define SARADC_CIM1_T1EOCIEN21_WIDTH             (1U)
#define SARADC_CIM1_T1EOCIEN21(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_CIM1_T1EOCIEN21_SHIFT)) & SARADC_CIM1_T1EOCIEN21_MASK)

#define SARADC_CIM1_T1EOCIEN22_MASK              (0x400000U)
#define SARADC_CIM1_T1EOCIEN22_SHIFT             (22U)
#define SARADC_CIM1_T1EOCIEN22_WIDTH             (1U)
#define SARADC_CIM1_T1EOCIEN22(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_CIM1_T1EOCIEN22_SHIFT)) & SARADC_CIM1_T1EOCIEN22_MASK)

#define SARADC_CIM1_T1EOCIEN23_MASK              (0x800000U)
#define SARADC_CIM1_T1EOCIEN23_SHIFT             (23U)
#define SARADC_CIM1_T1EOCIEN23_WIDTH             (1U)
#define SARADC_CIM1_T1EOCIEN23(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_CIM1_T1EOCIEN23_SHIFT)) & SARADC_CIM1_T1EOCIEN23_MASK)

#define SARADC_CIM1_T1EOCIEN24_MASK              (0x1000000U)
#define SARADC_CIM1_T1EOCIEN24_SHIFT             (24U)
#define SARADC_CIM1_T1EOCIEN24_WIDTH             (1U)
#define SARADC_CIM1_T1EOCIEN24(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_CIM1_T1EOCIEN24_SHIFT)) & SARADC_CIM1_T1EOCIEN24_MASK)

#define SARADC_CIM1_T1EOCIEN25_MASK              (0x2000000U)
#define SARADC_CIM1_T1EOCIEN25_SHIFT             (25U)
#define SARADC_CIM1_T1EOCIEN25_WIDTH             (1U)
#define SARADC_CIM1_T1EOCIEN25(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_CIM1_T1EOCIEN25_SHIFT)) & SARADC_CIM1_T1EOCIEN25_MASK)

#define SARADC_CIM1_T1EOCIEN26_MASK              (0x4000000U)
#define SARADC_CIM1_T1EOCIEN26_SHIFT             (26U)
#define SARADC_CIM1_T1EOCIEN26_WIDTH             (1U)
#define SARADC_CIM1_T1EOCIEN26(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_CIM1_T1EOCIEN26_SHIFT)) & SARADC_CIM1_T1EOCIEN26_MASK)
/*! @} */

/*! @name CIM2 - EOC Interrupt Enable for Type 2 */
/*! @{ */

#define SARADC_CIM2_T1EOCIEN0_MASK               (0x1U)
#define SARADC_CIM2_T1EOCIEN0_SHIFT              (0U)
#define SARADC_CIM2_T1EOCIEN0_WIDTH              (1U)
#define SARADC_CIM2_T1EOCIEN0(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CIM2_T1EOCIEN0_SHIFT)) & SARADC_CIM2_T1EOCIEN0_MASK)

#define SARADC_CIM2_T1EOCIEN1_MASK               (0x2U)
#define SARADC_CIM2_T1EOCIEN1_SHIFT              (1U)
#define SARADC_CIM2_T1EOCIEN1_WIDTH              (1U)
#define SARADC_CIM2_T1EOCIEN1(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CIM2_T1EOCIEN1_SHIFT)) & SARADC_CIM2_T1EOCIEN1_MASK)

#define SARADC_CIM2_T1EOCIEN2_MASK               (0x4U)
#define SARADC_CIM2_T1EOCIEN2_SHIFT              (2U)
#define SARADC_CIM2_T1EOCIEN2_WIDTH              (1U)
#define SARADC_CIM2_T1EOCIEN2(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CIM2_T1EOCIEN2_SHIFT)) & SARADC_CIM2_T1EOCIEN2_MASK)

#define SARADC_CIM2_T1EOCIEN3_MASK               (0x8U)
#define SARADC_CIM2_T1EOCIEN3_SHIFT              (3U)
#define SARADC_CIM2_T1EOCIEN3_WIDTH              (1U)
#define SARADC_CIM2_T1EOCIEN3(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CIM2_T1EOCIEN3_SHIFT)) & SARADC_CIM2_T1EOCIEN3_MASK)

