zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SARADC.h
#define SARADC_CIM2_T1EOCIEN25_MASK              (0x2000000U)
#define SARADC_CIM2_T1EOCIEN25_SHIFT             (25U)
#define SARADC_CIM2_T1EOCIEN25_WIDTH             (1U)
#define SARADC_CIM2_T1EOCIEN25(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_CIM2_T1EOCIEN25_SHIFT)) & SARADC_CIM2_T1EOCIEN25_MASK)

#define SARADC_CIM2_T1EOCIEN26_MASK              (0x4000000U)
#define SARADC_CIM2_T1EOCIEN26_SHIFT             (26U)
#define SARADC_CIM2_T1EOCIEN26_WIDTH             (1U)
#define SARADC_CIM2_T1EOCIEN26(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_CIM2_T1EOCIEN26_SHIFT)) & SARADC_CIM2_T1EOCIEN26_MASK)

#define SARADC_CIM2_T1EOCIEN27_MASK              (0x8000000U)
#define SARADC_CIM2_T1EOCIEN27_SHIFT             (27U)
#define SARADC_CIM2_T1EOCIEN27_WIDTH             (1U)
#define SARADC_CIM2_T1EOCIEN27(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_CIM2_T1EOCIEN27_SHIFT)) & SARADC_CIM2_T1EOCIEN27_MASK)

#define SARADC_CIM2_T1EOCIEN28_MASK              (0x10000000U)
#define SARADC_CIM2_T1EOCIEN28_SHIFT             (28U)
#define SARADC_CIM2_T1EOCIEN28_WIDTH             (1U)
#define SARADC_CIM2_T1EOCIEN28(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_CIM2_T1EOCIEN28_SHIFT)) & SARADC_CIM2_T1EOCIEN28_MASK)

#define SARADC_CIM2_T1EOCIEN29_MASK              (0x20000000U)
#define SARADC_CIM2_T1EOCIEN29_SHIFT             (29U)
#define SARADC_CIM2_T1EOCIEN29_WIDTH             (1U)
#define SARADC_CIM2_T1EOCIEN29(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_CIM2_T1EOCIEN29_SHIFT)) & SARADC_CIM2_T1EOCIEN29_MASK)

#define SARADC_CIM2_T1EOCIEN30_MASK              (0x40000000U)
#define SARADC_CIM2_T1EOCIEN30_SHIFT             (30U)
#define SARADC_CIM2_T1EOCIEN30_WIDTH             (1U)
#define SARADC_CIM2_T1EOCIEN30(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_CIM2_T1EOCIEN30_SHIFT)) & SARADC_CIM2_T1EOCIEN30_MASK)

#define SARADC_CIM2_T1EOCIEN31_MASK              (0x80000000U)
#define SARADC_CIM2_T1EOCIEN31_SHIFT             (31U)
#define SARADC_CIM2_T1EOCIEN31_WIDTH             (1U)
#define SARADC_CIM2_T1EOCIEN31(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_CIM2_T1EOCIEN31_SHIFT)) & SARADC_CIM2_T1EOCIEN31_MASK)
/*! @} */

/*! @name WTIS - Analog Watchdog Threshold Interrupt Status */
/*! @{ */

#define SARADC_WTIS_WDG0_L_MASK                  (0x1U)
#define SARADC_WTIS_WDG0_L_SHIFT                 (0U)
#define SARADC_WTIS_WDG0_L_WIDTH                 (1U)
#define SARADC_WTIS_WDG0_L(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_WTIS_WDG0_L_SHIFT)) & SARADC_WTIS_WDG0_L_MASK)

#define SARADC_WTIS_WDG1_L_MASK                  (0x2U)
#define SARADC_WTIS_WDG1_L_SHIFT                 (1U)
#define SARADC_WTIS_WDG1_L_WIDTH                 (1U)
#define SARADC_WTIS_WDG1_L(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_WTIS_WDG1_L_SHIFT)) & SARADC_WTIS_WDG1_L_MASK)

#define SARADC_WTIS_WDG2_L_MASK                  (0x4U)
#define SARADC_WTIS_WDG2_L_SHIFT                 (2U)
#define SARADC_WTIS_WDG2_L_WIDTH                 (1U)
#define SARADC_WTIS_WDG2_L(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_WTIS_WDG2_L_SHIFT)) & SARADC_WTIS_WDG2_L_MASK)

#define SARADC_WTIS_WDG3_L_MASK                  (0x8U)
#define SARADC_WTIS_WDG3_L_SHIFT                 (3U)
#define SARADC_WTIS_WDG3_L_WIDTH                 (1U)
#define SARADC_WTIS_WDG3_L(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_WTIS_WDG3_L_SHIFT)) & SARADC_WTIS_WDG3_L_MASK)

#define SARADC_WTIS_WDG4_H_MASK                  (0x10U)
#define SARADC_WTIS_WDG4_H_SHIFT                 (4U)
#define SARADC_WTIS_WDG4_H_WIDTH                 (1U)
#define SARADC_WTIS_WDG4_H(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_WTIS_WDG4_H_SHIFT)) & SARADC_WTIS_WDG4_H_MASK)

#define SARADC_WTIS_WDG5_H_MASK                  (0x20U)
#define SARADC_WTIS_WDG5_H_SHIFT                 (5U)
#define SARADC_WTIS_WDG5_H_WIDTH                 (1U)
#define SARADC_WTIS_WDG5_H(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_WTIS_WDG5_H_SHIFT)) & SARADC_WTIS_WDG5_H_MASK)

#define SARADC_WTIS_WDG6_H_MASK                  (0x40U)
#define SARADC_WTIS_WDG6_H_SHIFT                 (6U)
#define SARADC_WTIS_WDG6_H_WIDTH                 (1U)
#define SARADC_WTIS_WDG6_H(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_WTIS_WDG6_H_SHIFT)) & SARADC_WTIS_WDG6_H_MASK)

#define SARADC_WTIS_WDG7_H_MASK                  (0x80U)
#define SARADC_WTIS_WDG7_H_SHIFT                 (7U)
#define SARADC_WTIS_WDG7_H_WIDTH                 (1U)
#define SARADC_WTIS_WDG7_H(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_WTIS_WDG7_H_SHIFT)) & SARADC_WTIS_WDG7_H_MASK)
/*! @} */

/*! @name WTIM - Analog Watchdog Threshold Interrupt Mask */
/*! @{ */

#define SARADC_WTIM_MSKWDG0_L_MASK               (0x1U)
#define SARADC_WTIM_MSKWDG0_L_SHIFT              (0U)
#define SARADC_WTIM_MSKWDG0_L_WIDTH              (1U)
#define SARADC_WTIM_MSKWDG0_L(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_WTIM_MSKWDG0_L_SHIFT)) & SARADC_WTIM_MSKWDG0_L_MASK)

#define SARADC_WTIM_MSKWDG1_L_MASK               (0x2U)
#define SARADC_WTIM_MSKWDG1_L_SHIFT              (1U)
#define SARADC_WTIM_MSKWDG1_L_WIDTH              (1U)
#define SARADC_WTIM_MSKWDG1_L(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_WTIM_MSKWDG1_L_SHIFT)) & SARADC_WTIM_MSKWDG1_L_MASK)

#define SARADC_WTIM_MSKWDG2_L_MASK               (0x4U)
#define SARADC_WTIM_MSKWDG2_L_SHIFT              (2U)
#define SARADC_WTIM_MSKWDG2_L_WIDTH              (1U)
#define SARADC_WTIM_MSKWDG2_L(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_WTIM_MSKWDG2_L_SHIFT)) & SARADC_WTIM_MSKWDG2_L_MASK)

#define SARADC_WTIM_MSKWDG3_L_MASK               (0x8U)
#define SARADC_WTIM_MSKWDG3_L_SHIFT              (3U)
#define SARADC_WTIM_MSKWDG3_L_WIDTH              (1U)
#define SARADC_WTIM_MSKWDG3_L(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_WTIM_MSKWDG3_L_SHIFT)) & SARADC_WTIM_MSKWDG3_L_MASK)

#define SARADC_WTIM_MSKWDG4_H_MASK               (0x10U)
#define SARADC_WTIM_MSKWDG4_H_SHIFT              (4U)
#define SARADC_WTIM_MSKWDG4_H_WIDTH              (1U)
#define SARADC_WTIM_MSKWDG4_H(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_WTIM_MSKWDG4_H_SHIFT)) & SARADC_WTIM_MSKWDG4_H_MASK)

#define SARADC_WTIM_MSKWDG5_H_MASK               (0x20U)
#define SARADC_WTIM_MSKWDG5_H_SHIFT              (5U)
#define SARADC_WTIM_MSKWDG5_H_WIDTH              (1U)
#define SARADC_WTIM_MSKWDG5_H(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_WTIM_MSKWDG5_H_SHIFT)) & SARADC_WTIM_MSKWDG5_H_MASK)

#define SARADC_WTIM_MSKWDG6_H_MASK               (0x40U)
#define SARADC_WTIM_MSKWDG6_H_SHIFT              (6U)
#define SARADC_WTIM_MSKWDG6_H_WIDTH              (1U)
#define SARADC_WTIM_MSKWDG6_H(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_WTIM_MSKWDG6_H_SHIFT)) & SARADC_WTIM_MSKWDG6_H_MASK)

#define SARADC_WTIM_MSKWDG7_H_MASK               (0x80U)
#define SARADC_WTIM_MSKWDG7_H_SHIFT              (7U)
#define SARADC_WTIM_MSKWDG7_H_WIDTH              (1U)
#define SARADC_WTIM_MSKWDG7_H(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_WTIM_MSKWDG7_H_SHIFT)) & SARADC_WTIM_MSKWDG7_H_MASK)
/*! @} */

/*! @name DMAE - Direct Memory Access Configuration */
/*! @{ */

