zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SARADC.h
#define SARADC_DMAE_DMAEN_MASK                   (0x1U)
#define SARADC_DMAE_DMAEN_SHIFT                  (0U)
#define SARADC_DMAE_DMAEN_WIDTH                  (1U)
#define SARADC_DMAE_DMAEN(x)                     (((uint32_t)(((uint32_t)(x)) << SARADC_DMAE_DMAEN_SHIFT)) & SARADC_DMAE_DMAEN_MASK)

#define SARADC_DMAE_DCLR_MASK                    (0x2U)
#define SARADC_DMAE_DCLR_SHIFT                   (1U)
#define SARADC_DMAE_DCLR_WIDTH                   (1U)
#define SARADC_DMAE_DCLR(x)                      (((uint32_t)(((uint32_t)(x)) << SARADC_DMAE_DCLR_SHIFT)) & SARADC_DMAE_DCLR_MASK)
/*! @} */

/*! @name DMA0 - DMA Request Enable for Type 0 */
/*! @{ */

#define SARADC_DMA0_T0DMAEN0_MASK                (0x1U)
#define SARADC_DMA0_T0DMAEN0_SHIFT               (0U)
#define SARADC_DMA0_T0DMAEN0_WIDTH               (1U)
#define SARADC_DMA0_T0DMAEN0(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_DMA0_T0DMAEN0_SHIFT)) & SARADC_DMA0_T0DMAEN0_MASK)

#define SARADC_DMA0_T0DMAEN1_MASK                (0x2U)
#define SARADC_DMA0_T0DMAEN1_SHIFT               (1U)
#define SARADC_DMA0_T0DMAEN1_WIDTH               (1U)
#define SARADC_DMA0_T0DMAEN1(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_DMA0_T0DMAEN1_SHIFT)) & SARADC_DMA0_T0DMAEN1_MASK)

#define SARADC_DMA0_T0DMAEN2_MASK                (0x4U)
#define SARADC_DMA0_T0DMAEN2_SHIFT               (2U)
#define SARADC_DMA0_T0DMAEN2_WIDTH               (1U)
#define SARADC_DMA0_T0DMAEN2(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_DMA0_T0DMAEN2_SHIFT)) & SARADC_DMA0_T0DMAEN2_MASK)

#define SARADC_DMA0_T0DMAEN3_MASK                (0x8U)
#define SARADC_DMA0_T0DMAEN3_SHIFT               (3U)
#define SARADC_DMA0_T0DMAEN3_WIDTH               (1U)
#define SARADC_DMA0_T0DMAEN3(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_DMA0_T0DMAEN3_SHIFT)) & SARADC_DMA0_T0DMAEN3_MASK)

#define SARADC_DMA0_T0DMAEN4_MASK                (0x10U)
#define SARADC_DMA0_T0DMAEN4_SHIFT               (4U)
#define SARADC_DMA0_T0DMAEN4_WIDTH               (1U)
#define SARADC_DMA0_T0DMAEN4(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_DMA0_T0DMAEN4_SHIFT)) & SARADC_DMA0_T0DMAEN4_MASK)

#define SARADC_DMA0_T0DMAEN5_MASK                (0x20U)
#define SARADC_DMA0_T0DMAEN5_SHIFT               (5U)
#define SARADC_DMA0_T0DMAEN5_WIDTH               (1U)
#define SARADC_DMA0_T0DMAEN5(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_DMA0_T0DMAEN5_SHIFT)) & SARADC_DMA0_T0DMAEN5_MASK)

#define SARADC_DMA0_T0DMAEN6_MASK                (0x40U)
#define SARADC_DMA0_T0DMAEN6_SHIFT               (6U)
#define SARADC_DMA0_T0DMAEN6_WIDTH               (1U)
#define SARADC_DMA0_T0DMAEN6(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_DMA0_T0DMAEN6_SHIFT)) & SARADC_DMA0_T0DMAEN6_MASK)

#define SARADC_DMA0_T0DMAEN7_MASK                (0x80U)
#define SARADC_DMA0_T0DMAEN7_SHIFT               (7U)
#define SARADC_DMA0_T0DMAEN7_WIDTH               (1U)
#define SARADC_DMA0_T0DMAEN7(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_DMA0_T0DMAEN7_SHIFT)) & SARADC_DMA0_T0DMAEN7_MASK)

#define SARADC_DMA0_T0DMAEN8_MASK                (0x100U)
#define SARADC_DMA0_T0DMAEN8_SHIFT               (8U)
#define SARADC_DMA0_T0DMAEN8_WIDTH               (1U)
#define SARADC_DMA0_T0DMAEN8(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_DMA0_T0DMAEN8_SHIFT)) & SARADC_DMA0_T0DMAEN8_MASK)

#define SARADC_DMA0_T0DMAEN9_MASK                (0x200U)
#define SARADC_DMA0_T0DMAEN9_SHIFT               (9U)
#define SARADC_DMA0_T0DMAEN9_WIDTH               (1U)
#define SARADC_DMA0_T0DMAEN9(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_DMA0_T0DMAEN9_SHIFT)) & SARADC_DMA0_T0DMAEN9_MASK)

#define SARADC_DMA0_T0DMAEN10_MASK               (0x400U)
#define SARADC_DMA0_T0DMAEN10_SHIFT              (10U)
#define SARADC_DMA0_T0DMAEN10_WIDTH              (1U)
#define SARADC_DMA0_T0DMAEN10(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA0_T0DMAEN10_SHIFT)) & SARADC_DMA0_T0DMAEN10_MASK)

#define SARADC_DMA0_T0DMAEN11_MASK               (0x800U)
#define SARADC_DMA0_T0DMAEN11_SHIFT              (11U)
#define SARADC_DMA0_T0DMAEN11_WIDTH              (1U)
#define SARADC_DMA0_T0DMAEN11(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA0_T0DMAEN11_SHIFT)) & SARADC_DMA0_T0DMAEN11_MASK)

#define SARADC_DMA0_T0DMAEN12_MASK               (0x1000U)
#define SARADC_DMA0_T0DMAEN12_SHIFT              (12U)
#define SARADC_DMA0_T0DMAEN12_WIDTH              (1U)
#define SARADC_DMA0_T0DMAEN12(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA0_T0DMAEN12_SHIFT)) & SARADC_DMA0_T0DMAEN12_MASK)

#define SARADC_DMA0_T0DMAEN13_MASK               (0x2000U)
#define SARADC_DMA0_T0DMAEN13_SHIFT              (13U)
#define SARADC_DMA0_T0DMAEN13_WIDTH              (1U)
#define SARADC_DMA0_T0DMAEN13(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA0_T0DMAEN13_SHIFT)) & SARADC_DMA0_T0DMAEN13_MASK)

#define SARADC_DMA0_T0DMAEN14_MASK               (0x4000U)
#define SARADC_DMA0_T0DMAEN14_SHIFT              (14U)
#define SARADC_DMA0_T0DMAEN14_WIDTH              (1U)
#define SARADC_DMA0_T0DMAEN14(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA0_T0DMAEN14_SHIFT)) & SARADC_DMA0_T0DMAEN14_MASK)

#define SARADC_DMA0_T0DMAEN15_MASK               (0x8000U)
#define SARADC_DMA0_T0DMAEN15_SHIFT              (15U)
#define SARADC_DMA0_T0DMAEN15_WIDTH              (1U)
#define SARADC_DMA0_T0DMAEN15(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA0_T0DMAEN15_SHIFT)) & SARADC_DMA0_T0DMAEN15_MASK)

#define SARADC_DMA0_T0DMAEN16_MASK               (0x10000U)
#define SARADC_DMA0_T0DMAEN16_SHIFT              (16U)
#define SARADC_DMA0_T0DMAEN16_WIDTH              (1U)
#define SARADC_DMA0_T0DMAEN16(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA0_T0DMAEN16_SHIFT)) & SARADC_DMA0_T0DMAEN16_MASK)

#define SARADC_DMA0_T0DMAEN17_MASK               (0x20000U)
#define SARADC_DMA0_T0DMAEN17_SHIFT              (17U)
#define SARADC_DMA0_T0DMAEN17_WIDTH              (1U)
#define SARADC_DMA0_T0DMAEN17(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA0_T0DMAEN17_SHIFT)) & SARADC_DMA0_T0DMAEN17_MASK)

