zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SARADC.h
#define SARADC_DMA0_T0DMAEN18_MASK               (0x40000U)
#define SARADC_DMA0_T0DMAEN18_SHIFT              (18U)
#define SARADC_DMA0_T0DMAEN18_WIDTH              (1U)
#define SARADC_DMA0_T0DMAEN18(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA0_T0DMAEN18_SHIFT)) & SARADC_DMA0_T0DMAEN18_MASK)

#define SARADC_DMA0_T0DMAEN19_MASK               (0x80000U)
#define SARADC_DMA0_T0DMAEN19_SHIFT              (19U)
#define SARADC_DMA0_T0DMAEN19_WIDTH              (1U)
#define SARADC_DMA0_T0DMAEN19(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA0_T0DMAEN19_SHIFT)) & SARADC_DMA0_T0DMAEN19_MASK)

#define SARADC_DMA0_T0DMAEN20_MASK               (0x100000U)
#define SARADC_DMA0_T0DMAEN20_SHIFT              (20U)
#define SARADC_DMA0_T0DMAEN20_WIDTH              (1U)
#define SARADC_DMA0_T0DMAEN20(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA0_T0DMAEN20_SHIFT)) & SARADC_DMA0_T0DMAEN20_MASK)

#define SARADC_DMA0_T0DMAEN21_MASK               (0x200000U)
#define SARADC_DMA0_T0DMAEN21_SHIFT              (21U)
#define SARADC_DMA0_T0DMAEN21_WIDTH              (1U)
#define SARADC_DMA0_T0DMAEN21(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA0_T0DMAEN21_SHIFT)) & SARADC_DMA0_T0DMAEN21_MASK)

#define SARADC_DMA0_T0DMAEN22_MASK               (0x400000U)
#define SARADC_DMA0_T0DMAEN22_SHIFT              (22U)
#define SARADC_DMA0_T0DMAEN22_WIDTH              (1U)
#define SARADC_DMA0_T0DMAEN22(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA0_T0DMAEN22_SHIFT)) & SARADC_DMA0_T0DMAEN22_MASK)

#define SARADC_DMA0_T0DMAEN23_MASK               (0x800000U)
#define SARADC_DMA0_T0DMAEN23_SHIFT              (23U)
#define SARADC_DMA0_T0DMAEN23_WIDTH              (1U)
#define SARADC_DMA0_T0DMAEN23(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA0_T0DMAEN23_SHIFT)) & SARADC_DMA0_T0DMAEN23_MASK)

#define SARADC_DMA0_T0DMAEN24_MASK               (0x1000000U)
#define SARADC_DMA0_T0DMAEN24_SHIFT              (24U)
#define SARADC_DMA0_T0DMAEN24_WIDTH              (1U)
#define SARADC_DMA0_T0DMAEN24(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA0_T0DMAEN24_SHIFT)) & SARADC_DMA0_T0DMAEN24_MASK)

#define SARADC_DMA0_T0DMAEN25_MASK               (0x2000000U)
#define SARADC_DMA0_T0DMAEN25_SHIFT              (25U)
#define SARADC_DMA0_T0DMAEN25_WIDTH              (1U)
#define SARADC_DMA0_T0DMAEN25(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA0_T0DMAEN25_SHIFT)) & SARADC_DMA0_T0DMAEN25_MASK)

#define SARADC_DMA0_T0DMAEN26_MASK               (0x4000000U)
#define SARADC_DMA0_T0DMAEN26_SHIFT              (26U)
#define SARADC_DMA0_T0DMAEN26_WIDTH              (1U)
#define SARADC_DMA0_T0DMAEN26(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA0_T0DMAEN26_SHIFT)) & SARADC_DMA0_T0DMAEN26_MASK)

#define SARADC_DMA0_T0DMAEN27_MASK               (0x8000000U)
#define SARADC_DMA0_T0DMAEN27_SHIFT              (27U)
#define SARADC_DMA0_T0DMAEN27_WIDTH              (1U)
#define SARADC_DMA0_T0DMAEN27(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA0_T0DMAEN27_SHIFT)) & SARADC_DMA0_T0DMAEN27_MASK)

#define SARADC_DMA0_T0DMAEN28_MASK               (0x10000000U)
#define SARADC_DMA0_T0DMAEN28_SHIFT              (28U)
#define SARADC_DMA0_T0DMAEN28_WIDTH              (1U)
#define SARADC_DMA0_T0DMAEN28(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA0_T0DMAEN28_SHIFT)) & SARADC_DMA0_T0DMAEN28_MASK)

#define SARADC_DMA0_T0DMAEN29_MASK               (0x20000000U)
#define SARADC_DMA0_T0DMAEN29_SHIFT              (29U)
#define SARADC_DMA0_T0DMAEN29_WIDTH              (1U)
#define SARADC_DMA0_T0DMAEN29(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA0_T0DMAEN29_SHIFT)) & SARADC_DMA0_T0DMAEN29_MASK)

#define SARADC_DMA0_T0DMAEN30_MASK               (0x40000000U)
#define SARADC_DMA0_T0DMAEN30_SHIFT              (30U)
#define SARADC_DMA0_T0DMAEN30_WIDTH              (1U)
#define SARADC_DMA0_T0DMAEN30(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA0_T0DMAEN30_SHIFT)) & SARADC_DMA0_T0DMAEN30_MASK)

#define SARADC_DMA0_T0DMAEN31_MASK               (0x80000000U)
#define SARADC_DMA0_T0DMAEN31_SHIFT              (31U)
#define SARADC_DMA0_T0DMAEN31_WIDTH              (1U)
#define SARADC_DMA0_T0DMAEN31(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA0_T0DMAEN31_SHIFT)) & SARADC_DMA0_T0DMAEN31_MASK)
/*! @} */

/*! @name DMA1 - DMA Request Enable for Type 1 */
/*! @{ */

#define SARADC_DMA1_T1DMAEN0_MASK                (0x1U)
#define SARADC_DMA1_T1DMAEN0_SHIFT               (0U)
#define SARADC_DMA1_T1DMAEN0_WIDTH               (1U)
#define SARADC_DMA1_T1DMAEN0(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_DMA1_T1DMAEN0_SHIFT)) & SARADC_DMA1_T1DMAEN0_MASK)

#define SARADC_DMA1_T1DMAEN1_MASK                (0x2U)
#define SARADC_DMA1_T1DMAEN1_SHIFT               (1U)
#define SARADC_DMA1_T1DMAEN1_WIDTH               (1U)
#define SARADC_DMA1_T1DMAEN1(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_DMA1_T1DMAEN1_SHIFT)) & SARADC_DMA1_T1DMAEN1_MASK)

#define SARADC_DMA1_T1DMAEN2_MASK                (0x4U)
#define SARADC_DMA1_T1DMAEN2_SHIFT               (2U)
#define SARADC_DMA1_T1DMAEN2_WIDTH               (1U)
#define SARADC_DMA1_T1DMAEN2(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_DMA1_T1DMAEN2_SHIFT)) & SARADC_DMA1_T1DMAEN2_MASK)

#define SARADC_DMA1_T1DMAEN3_MASK                (0x8U)
#define SARADC_DMA1_T1DMAEN3_SHIFT               (3U)
#define SARADC_DMA1_T1DMAEN3_WIDTH               (1U)
#define SARADC_DMA1_T1DMAEN3(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_DMA1_T1DMAEN3_SHIFT)) & SARADC_DMA1_T1DMAEN3_MASK)

#define SARADC_DMA1_T1DMAEN4_MASK                (0x10U)
#define SARADC_DMA1_T1DMAEN4_SHIFT               (4U)
#define SARADC_DMA1_T1DMAEN4_WIDTH               (1U)
#define SARADC_DMA1_T1DMAEN4(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_DMA1_T1DMAEN4_SHIFT)) & SARADC_DMA1_T1DMAEN4_MASK)

#define SARADC_DMA1_T1DMAEN5_MASK                (0x20U)
#define SARADC_DMA1_T1DMAEN5_SHIFT               (5U)
#define SARADC_DMA1_T1DMAEN5_WIDTH               (1U)
#define SARADC_DMA1_T1DMAEN5(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_DMA1_T1DMAEN5_SHIFT)) & SARADC_DMA1_T1DMAEN5_MASK)

#define SARADC_DMA1_T1DMAEN6_MASK                (0x40U)
#define SARADC_DMA1_T1DMAEN6_SHIFT               (6U)
#define SARADC_DMA1_T1DMAEN6_WIDTH               (1U)
#define SARADC_DMA1_T1DMAEN6(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_DMA1_T1DMAEN6_SHIFT)) & SARADC_DMA1_T1DMAEN6_MASK)

#define SARADC_DMA1_T1DMAEN7_MASK                (0x80U)
#define SARADC_DMA1_T1DMAEN7_SHIFT               (7U)
#define SARADC_DMA1_T1DMAEN7_WIDTH               (1U)
#define SARADC_DMA1_T1DMAEN7(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_DMA1_T1DMAEN7_SHIFT)) & SARADC_DMA1_T1DMAEN7_MASK)

