zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SARADC.h
#define SARADC_DMA1_T1DMAEN8_MASK                (0x100U)
#define SARADC_DMA1_T1DMAEN8_SHIFT               (8U)
#define SARADC_DMA1_T1DMAEN8_WIDTH               (1U)
#define SARADC_DMA1_T1DMAEN8(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_DMA1_T1DMAEN8_SHIFT)) & SARADC_DMA1_T1DMAEN8_MASK)

#define SARADC_DMA1_T1DMAEN9_MASK                (0x200U)
#define SARADC_DMA1_T1DMAEN9_SHIFT               (9U)
#define SARADC_DMA1_T1DMAEN9_WIDTH               (1U)
#define SARADC_DMA1_T1DMAEN9(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_DMA1_T1DMAEN9_SHIFT)) & SARADC_DMA1_T1DMAEN9_MASK)

#define SARADC_DMA1_T1DMAEN10_MASK               (0x400U)
#define SARADC_DMA1_T1DMAEN10_SHIFT              (10U)
#define SARADC_DMA1_T1DMAEN10_WIDTH              (1U)
#define SARADC_DMA1_T1DMAEN10(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA1_T1DMAEN10_SHIFT)) & SARADC_DMA1_T1DMAEN10_MASK)

#define SARADC_DMA1_T1DMAEN16_MASK               (0x10000U)
#define SARADC_DMA1_T1DMAEN16_SHIFT              (16U)
#define SARADC_DMA1_T1DMAEN16_WIDTH              (1U)
#define SARADC_DMA1_T1DMAEN16(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA1_T1DMAEN16_SHIFT)) & SARADC_DMA1_T1DMAEN16_MASK)

#define SARADC_DMA1_T1DMAEN17_MASK               (0x20000U)
#define SARADC_DMA1_T1DMAEN17_SHIFT              (17U)
#define SARADC_DMA1_T1DMAEN17_WIDTH              (1U)
#define SARADC_DMA1_T1DMAEN17(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA1_T1DMAEN17_SHIFT)) & SARADC_DMA1_T1DMAEN17_MASK)

#define SARADC_DMA1_T1DMAEN18_MASK               (0x40000U)
#define SARADC_DMA1_T1DMAEN18_SHIFT              (18U)
#define SARADC_DMA1_T1DMAEN18_WIDTH              (1U)
#define SARADC_DMA1_T1DMAEN18(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA1_T1DMAEN18_SHIFT)) & SARADC_DMA1_T1DMAEN18_MASK)

#define SARADC_DMA1_T1DMAEN19_MASK               (0x80000U)
#define SARADC_DMA1_T1DMAEN19_SHIFT              (19U)
#define SARADC_DMA1_T1DMAEN19_WIDTH              (1U)
#define SARADC_DMA1_T1DMAEN19(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA1_T1DMAEN19_SHIFT)) & SARADC_DMA1_T1DMAEN19_MASK)

#define SARADC_DMA1_T1DMAEN20_MASK               (0x100000U)
#define SARADC_DMA1_T1DMAEN20_SHIFT              (20U)
#define SARADC_DMA1_T1DMAEN20_WIDTH              (1U)
#define SARADC_DMA1_T1DMAEN20(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA1_T1DMAEN20_SHIFT)) & SARADC_DMA1_T1DMAEN20_MASK)

#define SARADC_DMA1_T1DMAEN21_MASK               (0x200000U)
#define SARADC_DMA1_T1DMAEN21_SHIFT              (21U)
#define SARADC_DMA1_T1DMAEN21_WIDTH              (1U)
#define SARADC_DMA1_T1DMAEN21(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA1_T1DMAEN21_SHIFT)) & SARADC_DMA1_T1DMAEN21_MASK)

#define SARADC_DMA1_T1DMAEN22_MASK               (0x400000U)
#define SARADC_DMA1_T1DMAEN22_SHIFT              (22U)
#define SARADC_DMA1_T1DMAEN22_WIDTH              (1U)
#define SARADC_DMA1_T1DMAEN22(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA1_T1DMAEN22_SHIFT)) & SARADC_DMA1_T1DMAEN22_MASK)

#define SARADC_DMA1_T1DMAEN23_MASK               (0x800000U)
#define SARADC_DMA1_T1DMAEN23_SHIFT              (23U)
#define SARADC_DMA1_T1DMAEN23_WIDTH              (1U)
#define SARADC_DMA1_T1DMAEN23(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA1_T1DMAEN23_SHIFT)) & SARADC_DMA1_T1DMAEN23_MASK)

#define SARADC_DMA1_T1DMAEN24_MASK               (0x1000000U)
#define SARADC_DMA1_T1DMAEN24_SHIFT              (24U)
#define SARADC_DMA1_T1DMAEN24_WIDTH              (1U)
#define SARADC_DMA1_T1DMAEN24(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA1_T1DMAEN24_SHIFT)) & SARADC_DMA1_T1DMAEN24_MASK)

#define SARADC_DMA1_T1DMAEN25_MASK               (0x2000000U)
#define SARADC_DMA1_T1DMAEN25_SHIFT              (25U)
#define SARADC_DMA1_T1DMAEN25_WIDTH              (1U)
#define SARADC_DMA1_T1DMAEN25(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA1_T1DMAEN25_SHIFT)) & SARADC_DMA1_T1DMAEN25_MASK)

#define SARADC_DMA1_T1DMAEN26_MASK               (0x4000000U)
#define SARADC_DMA1_T1DMAEN26_SHIFT              (26U)
#define SARADC_DMA1_T1DMAEN26_WIDTH              (1U)
#define SARADC_DMA1_T1DMAEN26(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA1_T1DMAEN26_SHIFT)) & SARADC_DMA1_T1DMAEN26_MASK)
/*! @} */

/*! @name DMA2 - DMA Request Enable for Type 2 */
/*! @{ */

#define SARADC_DMA2_T2DMAEN0_MASK                (0x1U)
#define SARADC_DMA2_T2DMAEN0_SHIFT               (0U)
#define SARADC_DMA2_T2DMAEN0_WIDTH               (1U)
#define SARADC_DMA2_T2DMAEN0(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_DMA2_T2DMAEN0_SHIFT)) & SARADC_DMA2_T2DMAEN0_MASK)

#define SARADC_DMA2_T2DMAEN1_MASK                (0x2U)
#define SARADC_DMA2_T2DMAEN1_SHIFT               (1U)
#define SARADC_DMA2_T2DMAEN1_WIDTH               (1U)
#define SARADC_DMA2_T2DMAEN1(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_DMA2_T2DMAEN1_SHIFT)) & SARADC_DMA2_T2DMAEN1_MASK)

#define SARADC_DMA2_T2DMAEN2_MASK                (0x4U)
#define SARADC_DMA2_T2DMAEN2_SHIFT               (2U)
#define SARADC_DMA2_T2DMAEN2_WIDTH               (1U)
#define SARADC_DMA2_T2DMAEN2(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_DMA2_T2DMAEN2_SHIFT)) & SARADC_DMA2_T2DMAEN2_MASK)

#define SARADC_DMA2_T2DMAEN3_MASK                (0x8U)
#define SARADC_DMA2_T2DMAEN3_SHIFT               (3U)
#define SARADC_DMA2_T2DMAEN3_WIDTH               (1U)
#define SARADC_DMA2_T2DMAEN3(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_DMA2_T2DMAEN3_SHIFT)) & SARADC_DMA2_T2DMAEN3_MASK)

#define SARADC_DMA2_T2DMAEN4_MASK                (0x10U)
#define SARADC_DMA2_T2DMAEN4_SHIFT               (4U)
#define SARADC_DMA2_T2DMAEN4_WIDTH               (1U)
#define SARADC_DMA2_T2DMAEN4(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_DMA2_T2DMAEN4_SHIFT)) & SARADC_DMA2_T2DMAEN4_MASK)

#define SARADC_DMA2_T2DMAEN5_MASK                (0x20U)
#define SARADC_DMA2_T2DMAEN5_SHIFT               (5U)
#define SARADC_DMA2_T2DMAEN5_WIDTH               (1U)
#define SARADC_DMA2_T2DMAEN5(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_DMA2_T2DMAEN5_SHIFT)) & SARADC_DMA2_T2DMAEN5_MASK)

