zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SARADC.h
#define SARADC_DMA2_T2DMAEN6_MASK                (0x40U)
#define SARADC_DMA2_T2DMAEN6_SHIFT               (6U)
#define SARADC_DMA2_T2DMAEN6_WIDTH               (1U)
#define SARADC_DMA2_T2DMAEN6(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_DMA2_T2DMAEN6_SHIFT)) & SARADC_DMA2_T2DMAEN6_MASK)

#define SARADC_DMA2_T2DMAEN7_MASK                (0x80U)
#define SARADC_DMA2_T2DMAEN7_SHIFT               (7U)
#define SARADC_DMA2_T2DMAEN7_WIDTH               (1U)
#define SARADC_DMA2_T2DMAEN7(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_DMA2_T2DMAEN7_SHIFT)) & SARADC_DMA2_T2DMAEN7_MASK)

#define SARADC_DMA2_T2DMAEN8_MASK                (0x100U)
#define SARADC_DMA2_T2DMAEN8_SHIFT               (8U)
#define SARADC_DMA2_T2DMAEN8_WIDTH               (1U)
#define SARADC_DMA2_T2DMAEN8(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_DMA2_T2DMAEN8_SHIFT)) & SARADC_DMA2_T2DMAEN8_MASK)

#define SARADC_DMA2_T2DMAEN9_MASK                (0x200U)
#define SARADC_DMA2_T2DMAEN9_SHIFT               (9U)
#define SARADC_DMA2_T2DMAEN9_WIDTH               (1U)
#define SARADC_DMA2_T2DMAEN9(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_DMA2_T2DMAEN9_SHIFT)) & SARADC_DMA2_T2DMAEN9_MASK)

#define SARADC_DMA2_T2DMAEN10_MASK               (0x400U)
#define SARADC_DMA2_T2DMAEN10_SHIFT              (10U)
#define SARADC_DMA2_T2DMAEN10_WIDTH              (1U)
#define SARADC_DMA2_T2DMAEN10(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA2_T2DMAEN10_SHIFT)) & SARADC_DMA2_T2DMAEN10_MASK)

#define SARADC_DMA2_T2DMAEN11_MASK               (0x800U)
#define SARADC_DMA2_T2DMAEN11_SHIFT              (11U)
#define SARADC_DMA2_T2DMAEN11_WIDTH              (1U)
#define SARADC_DMA2_T2DMAEN11(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA2_T2DMAEN11_SHIFT)) & SARADC_DMA2_T2DMAEN11_MASK)

#define SARADC_DMA2_T2DMAEN12_MASK               (0x1000U)
#define SARADC_DMA2_T2DMAEN12_SHIFT              (12U)
#define SARADC_DMA2_T2DMAEN12_WIDTH              (1U)
#define SARADC_DMA2_T2DMAEN12(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA2_T2DMAEN12_SHIFT)) & SARADC_DMA2_T2DMAEN12_MASK)

#define SARADC_DMA2_T2DMAEN13_MASK               (0x2000U)
#define SARADC_DMA2_T2DMAEN13_SHIFT              (13U)
#define SARADC_DMA2_T2DMAEN13_WIDTH              (1U)
#define SARADC_DMA2_T2DMAEN13(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA2_T2DMAEN13_SHIFT)) & SARADC_DMA2_T2DMAEN13_MASK)

#define SARADC_DMA2_T2DMAEN14_MASK               (0x4000U)
#define SARADC_DMA2_T2DMAEN14_SHIFT              (14U)
#define SARADC_DMA2_T2DMAEN14_WIDTH              (1U)
#define SARADC_DMA2_T2DMAEN14(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA2_T2DMAEN14_SHIFT)) & SARADC_DMA2_T2DMAEN14_MASK)

#define SARADC_DMA2_T2DMAEN15_MASK               (0x8000U)
#define SARADC_DMA2_T2DMAEN15_SHIFT              (15U)
#define SARADC_DMA2_T2DMAEN15_WIDTH              (1U)
#define SARADC_DMA2_T2DMAEN15(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA2_T2DMAEN15_SHIFT)) & SARADC_DMA2_T2DMAEN15_MASK)

#define SARADC_DMA2_T2DMAEN16_MASK               (0x10000U)
#define SARADC_DMA2_T2DMAEN16_SHIFT              (16U)
#define SARADC_DMA2_T2DMAEN16_WIDTH              (1U)
#define SARADC_DMA2_T2DMAEN16(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA2_T2DMAEN16_SHIFT)) & SARADC_DMA2_T2DMAEN16_MASK)

#define SARADC_DMA2_T2DMAEN17_MASK               (0x20000U)
#define SARADC_DMA2_T2DMAEN17_SHIFT              (17U)
#define SARADC_DMA2_T2DMAEN17_WIDTH              (1U)
#define SARADC_DMA2_T2DMAEN17(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA2_T2DMAEN17_SHIFT)) & SARADC_DMA2_T2DMAEN17_MASK)

#define SARADC_DMA2_T2DMAEN18_MASK               (0x40000U)
#define SARADC_DMA2_T2DMAEN18_SHIFT              (18U)
#define SARADC_DMA2_T2DMAEN18_WIDTH              (1U)
#define SARADC_DMA2_T2DMAEN18(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA2_T2DMAEN18_SHIFT)) & SARADC_DMA2_T2DMAEN18_MASK)

#define SARADC_DMA2_T2DMAEN19_MASK               (0x80000U)
#define SARADC_DMA2_T2DMAEN19_SHIFT              (19U)
#define SARADC_DMA2_T2DMAEN19_WIDTH              (1U)
#define SARADC_DMA2_T2DMAEN19(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA2_T2DMAEN19_SHIFT)) & SARADC_DMA2_T2DMAEN19_MASK)

#define SARADC_DMA2_T2DMAEN20_MASK               (0x100000U)
#define SARADC_DMA2_T2DMAEN20_SHIFT              (20U)
#define SARADC_DMA2_T2DMAEN20_WIDTH              (1U)
#define SARADC_DMA2_T2DMAEN20(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA2_T2DMAEN20_SHIFT)) & SARADC_DMA2_T2DMAEN20_MASK)

#define SARADC_DMA2_T2DMAEN21_MASK               (0x200000U)
#define SARADC_DMA2_T2DMAEN21_SHIFT              (21U)
#define SARADC_DMA2_T2DMAEN21_WIDTH              (1U)
#define SARADC_DMA2_T2DMAEN21(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA2_T2DMAEN21_SHIFT)) & SARADC_DMA2_T2DMAEN21_MASK)

#define SARADC_DMA2_T2DMAEN22_MASK               (0x400000U)
#define SARADC_DMA2_T2DMAEN22_SHIFT              (22U)
#define SARADC_DMA2_T2DMAEN22_WIDTH              (1U)
#define SARADC_DMA2_T2DMAEN22(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA2_T2DMAEN22_SHIFT)) & SARADC_DMA2_T2DMAEN22_MASK)

#define SARADC_DMA2_T2DMAEN23_MASK               (0x800000U)
#define SARADC_DMA2_T2DMAEN23_SHIFT              (23U)
#define SARADC_DMA2_T2DMAEN23_WIDTH              (1U)
#define SARADC_DMA2_T2DMAEN23(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA2_T2DMAEN23_SHIFT)) & SARADC_DMA2_T2DMAEN23_MASK)

#define SARADC_DMA2_T2DMAEN24_MASK               (0x1000000U)
#define SARADC_DMA2_T2DMAEN24_SHIFT              (24U)
#define SARADC_DMA2_T2DMAEN24_WIDTH              (1U)
#define SARADC_DMA2_T2DMAEN24(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA2_T2DMAEN24_SHIFT)) & SARADC_DMA2_T2DMAEN24_MASK)

#define SARADC_DMA2_T2DMAEN25_MASK               (0x2000000U)
#define SARADC_DMA2_T2DMAEN25_SHIFT              (25U)
#define SARADC_DMA2_T2DMAEN25_WIDTH              (1U)
#define SARADC_DMA2_T2DMAEN25(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA2_T2DMAEN25_SHIFT)) & SARADC_DMA2_T2DMAEN25_MASK)

#define SARADC_DMA2_T2DMAEN26_MASK               (0x4000000U)
#define SARADC_DMA2_T2DMAEN26_SHIFT              (26U)
#define SARADC_DMA2_T2DMAEN26_WIDTH              (1U)
#define SARADC_DMA2_T2DMAEN26(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA2_T2DMAEN26_SHIFT)) & SARADC_DMA2_T2DMAEN26_MASK)

#define SARADC_DMA2_T2DMAEN27_MASK               (0x8000000U)
#define SARADC_DMA2_T2DMAEN27_SHIFT              (27U)
#define SARADC_DMA2_T2DMAEN27_WIDTH              (1U)
#define SARADC_DMA2_T2DMAEN27(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA2_T2DMAEN27_SHIFT)) & SARADC_DMA2_T2DMAEN27_MASK)

#define SARADC_DMA2_T2DMAEN28_MASK               (0x10000000U)
#define SARADC_DMA2_T2DMAEN28_SHIFT              (28U)
#define SARADC_DMA2_T2DMAEN28_WIDTH              (1U)
#define SARADC_DMA2_T2DMAEN28(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA2_T2DMAEN28_SHIFT)) & SARADC_DMA2_T2DMAEN28_MASK)

#define SARADC_DMA2_T2DMAEN29_MASK               (0x20000000U)
#define SARADC_DMA2_T2DMAEN29_SHIFT              (29U)
#define SARADC_DMA2_T2DMAEN29_WIDTH              (1U)
#define SARADC_DMA2_T2DMAEN29(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA2_T2DMAEN29_SHIFT)) & SARADC_DMA2_T2DMAEN29_MASK)

#define SARADC_DMA2_T2DMAEN30_MASK               (0x40000000U)
#define SARADC_DMA2_T2DMAEN30_SHIFT              (30U)
#define SARADC_DMA2_T2DMAEN30_WIDTH              (1U)
#define SARADC_DMA2_T2DMAEN30(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA2_T2DMAEN30_SHIFT)) & SARADC_DMA2_T2DMAEN30_MASK)

#define SARADC_DMA2_T2DMAEN31_MASK               (0x80000000U)
#define SARADC_DMA2_T2DMAEN31_SHIFT              (31U)
#define SARADC_DMA2_T2DMAEN31_WIDTH              (1U)
#define SARADC_DMA2_T2DMAEN31(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_DMA2_T2DMAEN31_SHIFT)) & SARADC_DMA2_T2DMAEN31_MASK)
/*! @} */

