zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SARADC.h
/*! @name THRHL - Analog Watchdog Threshold Values */
/*! @{ */

#define SARADC_THRHL_THRL_MASK                   (0xFFFFU)
#define SARADC_THRHL_THRL_SHIFT                  (0U)
#define SARADC_THRHL_THRL_WIDTH                  (16U)
#define SARADC_THRHL_THRL(x)                     (((uint32_t)(((uint32_t)(x)) << SARADC_THRHL_THRL_SHIFT)) & SARADC_THRHL_THRL_MASK)

#define SARADC_THRHL_THRH_MASK                   (0xFFFF0000U)
#define SARADC_THRHL_THRH_SHIFT                  (16U)
#define SARADC_THRHL_THRH_WIDTH                  (16U)
#define SARADC_THRHL_THRH(x)                     (((uint32_t)(((uint32_t)(x)) << SARADC_THRHL_THRH_SHIFT)) & SARADC_THRHL_THRH_MASK)
/*! @} */

/*! @name SMPLTSEL - Sample Time Select */
/*! @{ */

#define SARADC_SMPLTSEL_STS_0_MASK               (0x7U)
#define SARADC_SMPLTSEL_STS_0_SHIFT              (0U)
#define SARADC_SMPLTSEL_STS_0_WIDTH              (3U)
#define SARADC_SMPLTSEL_STS_0(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_SMPLTSEL_STS_0_SHIFT)) & SARADC_SMPLTSEL_STS_0_MASK)

#define SARADC_SMPLTSEL_STS_1_MASK               (0x700U)
#define SARADC_SMPLTSEL_STS_1_SHIFT              (8U)
#define SARADC_SMPLTSEL_STS_1_WIDTH              (3U)
#define SARADC_SMPLTSEL_STS_1(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_SMPLTSEL_STS_1_SHIFT)) & SARADC_SMPLTSEL_STS_1_MASK)

#define SARADC_SMPLTSEL_STS_2_MASK               (0x70000U)
#define SARADC_SMPLTSEL_STS_2_SHIFT              (16U)
#define SARADC_SMPLTSEL_STS_2_WIDTH              (3U)
#define SARADC_SMPLTSEL_STS_2(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_SMPLTSEL_STS_2_SHIFT)) & SARADC_SMPLTSEL_STS_2_MASK)
/*! @} */

/*! @name NCM0 - Normal Conversion Mask for Type 0 */
/*! @{ */

#define SARADC_NCM0_CH0_MASK                     (0x1U)
#define SARADC_NCM0_CH0_SHIFT                    (0U)
#define SARADC_NCM0_CH0_WIDTH                    (1U)
#define SARADC_NCM0_CH0(x)                       (((uint32_t)(((uint32_t)(x)) << SARADC_NCM0_CH0_SHIFT)) & SARADC_NCM0_CH0_MASK)

#define SARADC_NCM0_CH1_MASK                     (0x2U)
#define SARADC_NCM0_CH1_SHIFT                    (1U)
#define SARADC_NCM0_CH1_WIDTH                    (1U)
#define SARADC_NCM0_CH1(x)                       (((uint32_t)(((uint32_t)(x)) << SARADC_NCM0_CH1_SHIFT)) & SARADC_NCM0_CH1_MASK)

#define SARADC_NCM0_CH2_MASK                     (0x4U)
#define SARADC_NCM0_CH2_SHIFT                    (2U)
#define SARADC_NCM0_CH2_WIDTH                    (1U)
#define SARADC_NCM0_CH2(x)                       (((uint32_t)(((uint32_t)(x)) << SARADC_NCM0_CH2_SHIFT)) & SARADC_NCM0_CH2_MASK)

#define SARADC_NCM0_CH3_MASK                     (0x8U)
#define SARADC_NCM0_CH3_SHIFT                    (3U)
#define SARADC_NCM0_CH3_WIDTH                    (1U)
#define SARADC_NCM0_CH3(x)                       (((uint32_t)(((uint32_t)(x)) << SARADC_NCM0_CH3_SHIFT)) & SARADC_NCM0_CH3_MASK)

#define SARADC_NCM0_CH4_MASK                     (0x10U)
#define SARADC_NCM0_CH4_SHIFT                    (4U)
#define SARADC_NCM0_CH4_WIDTH                    (1U)
#define SARADC_NCM0_CH4(x)                       (((uint32_t)(((uint32_t)(x)) << SARADC_NCM0_CH4_SHIFT)) & SARADC_NCM0_CH4_MASK)

#define SARADC_NCM0_CH5_MASK                     (0x20U)
#define SARADC_NCM0_CH5_SHIFT                    (5U)
#define SARADC_NCM0_CH5_WIDTH                    (1U)
#define SARADC_NCM0_CH5(x)                       (((uint32_t)(((uint32_t)(x)) << SARADC_NCM0_CH5_SHIFT)) & SARADC_NCM0_CH5_MASK)

#define SARADC_NCM0_CH6_MASK                     (0x40U)
#define SARADC_NCM0_CH6_SHIFT                    (6U)
#define SARADC_NCM0_CH6_WIDTH                    (1U)
#define SARADC_NCM0_CH6(x)                       (((uint32_t)(((uint32_t)(x)) << SARADC_NCM0_CH6_SHIFT)) & SARADC_NCM0_CH6_MASK)

#define SARADC_NCM0_CH7_MASK                     (0x80U)
#define SARADC_NCM0_CH7_SHIFT                    (7U)
#define SARADC_NCM0_CH7_WIDTH                    (1U)
#define SARADC_NCM0_CH7(x)                       (((uint32_t)(((uint32_t)(x)) << SARADC_NCM0_CH7_SHIFT)) & SARADC_NCM0_CH7_MASK)

#define SARADC_NCM0_CH8_MASK                     (0x100U)
#define SARADC_NCM0_CH8_SHIFT                    (8U)
#define SARADC_NCM0_CH8_WIDTH                    (1U)
#define SARADC_NCM0_CH8(x)                       (((uint32_t)(((uint32_t)(x)) << SARADC_NCM0_CH8_SHIFT)) & SARADC_NCM0_CH8_MASK)

#define SARADC_NCM0_CH9_MASK                     (0x200U)
#define SARADC_NCM0_CH9_SHIFT                    (9U)
#define SARADC_NCM0_CH9_WIDTH                    (1U)
#define SARADC_NCM0_CH9(x)                       (((uint32_t)(((uint32_t)(x)) << SARADC_NCM0_CH9_SHIFT)) & SARADC_NCM0_CH9_MASK)

#define SARADC_NCM0_CH10_MASK                    (0x400U)
#define SARADC_NCM0_CH10_SHIFT                   (10U)
#define SARADC_NCM0_CH10_WIDTH                   (1U)
#define SARADC_NCM0_CH10(x)                      (((uint32_t)(((uint32_t)(x)) << SARADC_NCM0_CH10_SHIFT)) & SARADC_NCM0_CH10_MASK)

#define SARADC_NCM0_CH11_MASK                    (0x800U)
#define SARADC_NCM0_CH11_SHIFT                   (11U)
#define SARADC_NCM0_CH11_WIDTH                   (1U)
#define SARADC_NCM0_CH11(x)                      (((uint32_t)(((uint32_t)(x)) << SARADC_NCM0_CH11_SHIFT)) & SARADC_NCM0_CH11_MASK)

#define SARADC_NCM0_CH12_MASK                    (0x1000U)
#define SARADC_NCM0_CH12_SHIFT                   (12U)
#define SARADC_NCM0_CH12_WIDTH                   (1U)
#define SARADC_NCM0_CH12(x)                      (((uint32_t)(((uint32_t)(x)) << SARADC_NCM0_CH12_SHIFT)) & SARADC_NCM0_CH12_MASK)

#define SARADC_NCM0_CH13_MASK                    (0x2000U)
#define SARADC_NCM0_CH13_SHIFT                   (13U)
#define SARADC_NCM0_CH13_WIDTH                   (1U)
#define SARADC_NCM0_CH13(x)                      (((uint32_t)(((uint32_t)(x)) << SARADC_NCM0_CH13_SHIFT)) & SARADC_NCM0_CH13_MASK)

#define SARADC_NCM0_CH14_MASK                    (0x4000U)
#define SARADC_NCM0_CH14_SHIFT                   (14U)
#define SARADC_NCM0_CH14_WIDTH                   (1U)
#define SARADC_NCM0_CH14(x)                      (((uint32_t)(((uint32_t)(x)) << SARADC_NCM0_CH14_SHIFT)) & SARADC_NCM0_CH14_MASK)

#define SARADC_NCM0_CH15_MASK                    (0x8000U)
#define SARADC_NCM0_CH15_SHIFT                   (15U)
#define SARADC_NCM0_CH15_WIDTH                   (1U)
#define SARADC_NCM0_CH15(x)                      (((uint32_t)(((uint32_t)(x)) << SARADC_NCM0_CH15_SHIFT)) & SARADC_NCM0_CH15_MASK)

