zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SARADC.h
#define SARADC_NCM2_CH10_MASK                    (0x400U)
#define SARADC_NCM2_CH10_SHIFT                   (10U)
#define SARADC_NCM2_CH10_WIDTH                   (1U)
#define SARADC_NCM2_CH10(x)                      (((uint32_t)(((uint32_t)(x)) << SARADC_NCM2_CH10_SHIFT)) & SARADC_NCM2_CH10_MASK)

#define SARADC_NCM2_CH11_MASK                    (0x800U)
#define SARADC_NCM2_CH11_SHIFT                   (11U)
#define SARADC_NCM2_CH11_WIDTH                   (1U)
#define SARADC_NCM2_CH11(x)                      (((uint32_t)(((uint32_t)(x)) << SARADC_NCM2_CH11_SHIFT)) & SARADC_NCM2_CH11_MASK)

#define SARADC_NCM2_CH12_MASK                    (0x1000U)
#define SARADC_NCM2_CH12_SHIFT                   (12U)
#define SARADC_NCM2_CH12_WIDTH                   (1U)
#define SARADC_NCM2_CH12(x)                      (((uint32_t)(((uint32_t)(x)) << SARADC_NCM2_CH12_SHIFT)) & SARADC_NCM2_CH12_MASK)

#define SARADC_NCM2_CH13_MASK                    (0x2000U)
#define SARADC_NCM2_CH13_SHIFT                   (13U)
#define SARADC_NCM2_CH13_WIDTH                   (1U)
#define SARADC_NCM2_CH13(x)                      (((uint32_t)(((uint32_t)(x)) << SARADC_NCM2_CH13_SHIFT)) & SARADC_NCM2_CH13_MASK)

#define SARADC_NCM2_CH14_MASK                    (0x4000U)
#define SARADC_NCM2_CH14_SHIFT                   (14U)
#define SARADC_NCM2_CH14_WIDTH                   (1U)
#define SARADC_NCM2_CH14(x)                      (((uint32_t)(((uint32_t)(x)) << SARADC_NCM2_CH14_SHIFT)) & SARADC_NCM2_CH14_MASK)

#define SARADC_NCM2_CH15_MASK                    (0x8000U)
#define SARADC_NCM2_CH15_SHIFT                   (15U)
#define SARADC_NCM2_CH15_WIDTH                   (1U)
#define SARADC_NCM2_CH15(x)                      (((uint32_t)(((uint32_t)(x)) << SARADC_NCM2_CH15_SHIFT)) & SARADC_NCM2_CH15_MASK)

#define SARADC_NCM2_CH16_MASK                    (0x10000U)
#define SARADC_NCM2_CH16_SHIFT                   (16U)
#define SARADC_NCM2_CH16_WIDTH                   (1U)
#define SARADC_NCM2_CH16(x)                      (((uint32_t)(((uint32_t)(x)) << SARADC_NCM2_CH16_SHIFT)) & SARADC_NCM2_CH16_MASK)

#define SARADC_NCM2_CH17_MASK                    (0x20000U)
#define SARADC_NCM2_CH17_SHIFT                   (17U)
#define SARADC_NCM2_CH17_WIDTH                   (1U)
#define SARADC_NCM2_CH17(x)                      (((uint32_t)(((uint32_t)(x)) << SARADC_NCM2_CH17_SHIFT)) & SARADC_NCM2_CH17_MASK)

#define SARADC_NCM2_CH18_MASK                    (0x40000U)
#define SARADC_NCM2_CH18_SHIFT                   (18U)
#define SARADC_NCM2_CH18_WIDTH                   (1U)
#define SARADC_NCM2_CH18(x)                      (((uint32_t)(((uint32_t)(x)) << SARADC_NCM2_CH18_SHIFT)) & SARADC_NCM2_CH18_MASK)

#define SARADC_NCM2_CH19_MASK                    (0x80000U)
#define SARADC_NCM2_CH19_SHIFT                   (19U)
#define SARADC_NCM2_CH19_WIDTH                   (1U)
#define SARADC_NCM2_CH19(x)                      (((uint32_t)(((uint32_t)(x)) << SARADC_NCM2_CH19_SHIFT)) & SARADC_NCM2_CH19_MASK)

#define SARADC_NCM2_CH20_MASK                    (0x100000U)
#define SARADC_NCM2_CH20_SHIFT                   (20U)
#define SARADC_NCM2_CH20_WIDTH                   (1U)
#define SARADC_NCM2_CH20(x)                      (((uint32_t)(((uint32_t)(x)) << SARADC_NCM2_CH20_SHIFT)) & SARADC_NCM2_CH20_MASK)

#define SARADC_NCM2_CH21_MASK                    (0x200000U)
#define SARADC_NCM2_CH21_SHIFT                   (21U)
#define SARADC_NCM2_CH21_WIDTH                   (1U)
#define SARADC_NCM2_CH21(x)                      (((uint32_t)(((uint32_t)(x)) << SARADC_NCM2_CH21_SHIFT)) & SARADC_NCM2_CH21_MASK)

#define SARADC_NCM2_CH22_MASK                    (0x400000U)
#define SARADC_NCM2_CH22_SHIFT                   (22U)
#define SARADC_NCM2_CH22_WIDTH                   (1U)
#define SARADC_NCM2_CH22(x)                      (((uint32_t)(((uint32_t)(x)) << SARADC_NCM2_CH22_SHIFT)) & SARADC_NCM2_CH22_MASK)

#define SARADC_NCM2_CH23_MASK                    (0x800000U)
#define SARADC_NCM2_CH23_SHIFT                   (23U)
#define SARADC_NCM2_CH23_WIDTH                   (1U)
#define SARADC_NCM2_CH23(x)                      (((uint32_t)(((uint32_t)(x)) << SARADC_NCM2_CH23_SHIFT)) & SARADC_NCM2_CH23_MASK)

#define SARADC_NCM2_CH24_MASK                    (0x1000000U)
#define SARADC_NCM2_CH24_SHIFT                   (24U)
#define SARADC_NCM2_CH24_WIDTH                   (1U)
#define SARADC_NCM2_CH24(x)                      (((uint32_t)(((uint32_t)(x)) << SARADC_NCM2_CH24_SHIFT)) & SARADC_NCM2_CH24_MASK)

#define SARADC_NCM2_CH25_MASK                    (0x2000000U)
#define SARADC_NCM2_CH25_SHIFT                   (25U)
#define SARADC_NCM2_CH25_WIDTH                   (1U)
#define SARADC_NCM2_CH25(x)                      (((uint32_t)(((uint32_t)(x)) << SARADC_NCM2_CH25_SHIFT)) & SARADC_NCM2_CH25_MASK)

#define SARADC_NCM2_CH26_MASK                    (0x4000000U)
#define SARADC_NCM2_CH26_SHIFT                   (26U)
#define SARADC_NCM2_CH26_WIDTH                   (1U)
#define SARADC_NCM2_CH26(x)                      (((uint32_t)(((uint32_t)(x)) << SARADC_NCM2_CH26_SHIFT)) & SARADC_NCM2_CH26_MASK)

#define SARADC_NCM2_CH27_MASK                    (0x8000000U)
#define SARADC_NCM2_CH27_SHIFT                   (27U)
#define SARADC_NCM2_CH27_WIDTH                   (1U)
#define SARADC_NCM2_CH27(x)                      (((uint32_t)(((uint32_t)(x)) << SARADC_NCM2_CH27_SHIFT)) & SARADC_NCM2_CH27_MASK)

#define SARADC_NCM2_CH28_MASK                    (0x10000000U)
#define SARADC_NCM2_CH28_SHIFT                   (28U)
#define SARADC_NCM2_CH28_WIDTH                   (1U)
#define SARADC_NCM2_CH28(x)                      (((uint32_t)(((uint32_t)(x)) << SARADC_NCM2_CH28_SHIFT)) & SARADC_NCM2_CH28_MASK)

#define SARADC_NCM2_CH29_MASK                    (0x20000000U)
#define SARADC_NCM2_CH29_SHIFT                   (29U)
#define SARADC_NCM2_CH29_WIDTH                   (1U)
#define SARADC_NCM2_CH29(x)                      (((uint32_t)(((uint32_t)(x)) << SARADC_NCM2_CH29_SHIFT)) & SARADC_NCM2_CH29_MASK)

