zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SARADC.h
#define SARADC_JCM0_CH19_MASK                    (0x80000U)
#define SARADC_JCM0_CH19_SHIFT                   (19U)
#define SARADC_JCM0_CH19_WIDTH                   (1U)
#define SARADC_JCM0_CH19(x)                      (((uint32_t)(((uint32_t)(x)) << SARADC_JCM0_CH19_SHIFT)) & SARADC_JCM0_CH19_MASK)

#define SARADC_JCM0_CH20_MASK                    (0x100000U)
#define SARADC_JCM0_CH20_SHIFT                   (20U)
#define SARADC_JCM0_CH20_WIDTH                   (1U)
#define SARADC_JCM0_CH20(x)                      (((uint32_t)(((uint32_t)(x)) << SARADC_JCM0_CH20_SHIFT)) & SARADC_JCM0_CH20_MASK)

#define SARADC_JCM0_CH21_MASK                    (0x200000U)
#define SARADC_JCM0_CH21_SHIFT                   (21U)
#define SARADC_JCM0_CH21_WIDTH                   (1U)
#define SARADC_JCM0_CH21(x)                      (((uint32_t)(((uint32_t)(x)) << SARADC_JCM0_CH21_SHIFT)) & SARADC_JCM0_CH21_MASK)

#define SARADC_JCM0_CH22_MASK                    (0x400000U)
#define SARADC_JCM0_CH22_SHIFT                   (22U)
#define SARADC_JCM0_CH22_WIDTH                   (1U)
#define SARADC_JCM0_CH22(x)                      (((uint32_t)(((uint32_t)(x)) << SARADC_JCM0_CH22_SHIFT)) & SARADC_JCM0_CH22_MASK)

#define SARADC_JCM0_CH23_MASK                    (0x800000U)
#define SARADC_JCM0_CH23_SHIFT                   (23U)
#define SARADC_JCM0_CH23_WIDTH                   (1U)
#define SARADC_JCM0_CH23(x)                      (((uint32_t)(((uint32_t)(x)) << SARADC_JCM0_CH23_SHIFT)) & SARADC_JCM0_CH23_MASK)

#define SARADC_JCM0_CH24_MASK                    (0x1000000U)
#define SARADC_JCM0_CH24_SHIFT                   (24U)
#define SARADC_JCM0_CH24_WIDTH                   (1U)
#define SARADC_JCM0_CH24(x)                      (((uint32_t)(((uint32_t)(x)) << SARADC_JCM0_CH24_SHIFT)) & SARADC_JCM0_CH24_MASK)

#define SARADC_JCM0_CH25_MASK                    (0x2000000U)
#define SARADC_JCM0_CH25_SHIFT                   (25U)
#define SARADC_JCM0_CH25_WIDTH                   (1U)
#define SARADC_JCM0_CH25(x)                      (((uint32_t)(((uint32_t)(x)) << SARADC_JCM0_CH25_SHIFT)) & SARADC_JCM0_CH25_MASK)

#define SARADC_JCM0_CH26_MASK                    (0x4000000U)
#define SARADC_JCM0_CH26_SHIFT                   (26U)
#define SARADC_JCM0_CH26_WIDTH                   (1U)
#define SARADC_JCM0_CH26(x)                      (((uint32_t)(((uint32_t)(x)) << SARADC_JCM0_CH26_SHIFT)) & SARADC_JCM0_CH26_MASK)

#define SARADC_JCM0_CH27_MASK                    (0x8000000U)
#define SARADC_JCM0_CH27_SHIFT                   (27U)
#define SARADC_JCM0_CH27_WIDTH                   (1U)
#define SARADC_JCM0_CH27(x)                      (((uint32_t)(((uint32_t)(x)) << SARADC_JCM0_CH27_SHIFT)) & SARADC_JCM0_CH27_MASK)

#define SARADC_JCM0_CH28_MASK                    (0x10000000U)
#define SARADC_JCM0_CH28_SHIFT                   (28U)
#define SARADC_JCM0_CH28_WIDTH                   (1U)
#define SARADC_JCM0_CH28(x)                      (((uint32_t)(((uint32_t)(x)) << SARADC_JCM0_CH28_SHIFT)) & SARADC_JCM0_CH28_MASK)

#define SARADC_JCM0_CH29_MASK                    (0x20000000U)
#define SARADC_JCM0_CH29_SHIFT                   (29U)
#define SARADC_JCM0_CH29_WIDTH                   (1U)
#define SARADC_JCM0_CH29(x)                      (((uint32_t)(((uint32_t)(x)) << SARADC_JCM0_CH29_SHIFT)) & SARADC_JCM0_CH29_MASK)

#define SARADC_JCM0_CH30_MASK                    (0x40000000U)
#define SARADC_JCM0_CH30_SHIFT                   (30U)
#define SARADC_JCM0_CH30_WIDTH                   (1U)
#define SARADC_JCM0_CH30(x)                      (((uint32_t)(((uint32_t)(x)) << SARADC_JCM0_CH30_SHIFT)) & SARADC_JCM0_CH30_MASK)

#define SARADC_JCM0_CH31_MASK                    (0x80000000U)
#define SARADC_JCM0_CH31_SHIFT                   (31U)
#define SARADC_JCM0_CH31_WIDTH                   (1U)
#define SARADC_JCM0_CH31(x)                      (((uint32_t)(((uint32_t)(x)) << SARADC_JCM0_CH31_SHIFT)) & SARADC_JCM0_CH31_MASK)
/*! @} */

/*! @name JCM1 - Injected Conversion Mask for Type 1 */
/*! @{ */

#define SARADC_JCM1_CH0_MASK                     (0x1U)
#define SARADC_JCM1_CH0_SHIFT                    (0U)
#define SARADC_JCM1_CH0_WIDTH                    (1U)
#define SARADC_JCM1_CH0(x)                       (((uint32_t)(((uint32_t)(x)) << SARADC_JCM1_CH0_SHIFT)) & SARADC_JCM1_CH0_MASK)

#define SARADC_JCM1_CH1_MASK                     (0x2U)
#define SARADC_JCM1_CH1_SHIFT                    (1U)
#define SARADC_JCM1_CH1_WIDTH                    (1U)
#define SARADC_JCM1_CH1(x)                       (((uint32_t)(((uint32_t)(x)) << SARADC_JCM1_CH1_SHIFT)) & SARADC_JCM1_CH1_MASK)

#define SARADC_JCM1_CH2_MASK                     (0x4U)
#define SARADC_JCM1_CH2_SHIFT                    (2U)
#define SARADC_JCM1_CH2_WIDTH                    (1U)
#define SARADC_JCM1_CH2(x)                       (((uint32_t)(((uint32_t)(x)) << SARADC_JCM1_CH2_SHIFT)) & SARADC_JCM1_CH2_MASK)

#define SARADC_JCM1_CH3_MASK                     (0x8U)
#define SARADC_JCM1_CH3_SHIFT                    (3U)
#define SARADC_JCM1_CH3_WIDTH                    (1U)
#define SARADC_JCM1_CH3(x)                       (((uint32_t)(((uint32_t)(x)) << SARADC_JCM1_CH3_SHIFT)) & SARADC_JCM1_CH3_MASK)

#define SARADC_JCM1_CH4_MASK                     (0x10U)
#define SARADC_JCM1_CH4_SHIFT                    (4U)
#define SARADC_JCM1_CH4_WIDTH                    (1U)
#define SARADC_JCM1_CH4(x)                       (((uint32_t)(((uint32_t)(x)) << SARADC_JCM1_CH4_SHIFT)) & SARADC_JCM1_CH4_MASK)

#define SARADC_JCM1_CH5_MASK                     (0x20U)
#define SARADC_JCM1_CH5_SHIFT                    (5U)
#define SARADC_JCM1_CH5_WIDTH                    (1U)
#define SARADC_JCM1_CH5(x)                       (((uint32_t)(((uint32_t)(x)) << SARADC_JCM1_CH5_SHIFT)) & SARADC_JCM1_CH5_MASK)

#define SARADC_JCM1_CH6_MASK                     (0x40U)
#define SARADC_JCM1_CH6_SHIFT                    (6U)
#define SARADC_JCM1_CH6_WIDTH                    (1U)
#define SARADC_JCM1_CH6(x)                       (((uint32_t)(((uint32_t)(x)) << SARADC_JCM1_CH6_SHIFT)) & SARADC_JCM1_CH6_MASK)

