zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SARADC.h
#define SARADC_PUDLY_PUED_MASK                   (0x3FFU)
#define SARADC_PUDLY_PUED_SHIFT                  (0U)
#define SARADC_PUDLY_PUED_WIDTH                  (10U)
#define SARADC_PUDLY_PUED(x)                     (((uint32_t)(((uint32_t)(x)) << SARADC_PUDLY_PUED_SHIFT)) & SARADC_PUDLY_PUED_MASK)
/*! @} */

/*! @name CD0_P - Type 0 Input n Conversion Data */
/*! @{ */

#define SARADC_CD0_P_CDATA_MASK                  (0xFFFFU)
#define SARADC_CD0_P_CDATA_SHIFT                 (0U)
#define SARADC_CD0_P_CDATA_WIDTH                 (16U)
#define SARADC_CD0_P_CDATA(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_CD0_P_CDATA_SHIFT)) & SARADC_CD0_P_CDATA_MASK)

#define SARADC_CD0_P_RESULT_MASK                 (0x30000U)
#define SARADC_CD0_P_RESULT_SHIFT                (16U)
#define SARADC_CD0_P_RESULT_WIDTH                (2U)
#define SARADC_CD0_P_RESULT(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_CD0_P_RESULT_SHIFT)) & SARADC_CD0_P_RESULT_MASK)

#define SARADC_CD0_P_OVERW_MASK                  (0x40000U)
#define SARADC_CD0_P_OVERW_SHIFT                 (18U)
#define SARADC_CD0_P_OVERW_WIDTH                 (1U)
#define SARADC_CD0_P_OVERW(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_CD0_P_OVERW_SHIFT)) & SARADC_CD0_P_OVERW_MASK)

#define SARADC_CD0_P_VALID_MASK                  (0x80000U)
#define SARADC_CD0_P_VALID_SHIFT                 (19U)
#define SARADC_CD0_P_VALID_WIDTH                 (1U)
#define SARADC_CD0_P_VALID(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_CD0_P_VALID_SHIFT)) & SARADC_CD0_P_VALID_MASK)
/*! @} */

/*! @name CD0_M - Type 0 Input n Conversion Data */
/*! @{ */

#define SARADC_CD0_M_CDATA_MASK                  (0xFFFFU)
#define SARADC_CD0_M_CDATA_SHIFT                 (0U)
#define SARADC_CD0_M_CDATA_WIDTH                 (16U)
#define SARADC_CD0_M_CDATA(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_CD0_M_CDATA_SHIFT)) & SARADC_CD0_M_CDATA_MASK)

#define SARADC_CD0_M_RESULT_MASK                 (0x30000U)
#define SARADC_CD0_M_RESULT_SHIFT                (16U)
#define SARADC_CD0_M_RESULT_WIDTH                (2U)
#define SARADC_CD0_M_RESULT(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_CD0_M_RESULT_SHIFT)) & SARADC_CD0_M_RESULT_MASK)

#define SARADC_CD0_M_OVERW_MASK                  (0x40000U)
#define SARADC_CD0_M_OVERW_SHIFT                 (18U)
#define SARADC_CD0_M_OVERW_WIDTH                 (1U)
#define SARADC_CD0_M_OVERW(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_CD0_M_OVERW_SHIFT)) & SARADC_CD0_M_OVERW_MASK)

#define SARADC_CD0_M_VALID_MASK                  (0x80000U)
#define SARADC_CD0_M_VALID_SHIFT                 (19U)
#define SARADC_CD0_M_VALID_WIDTH                 (1U)
#define SARADC_CD0_M_VALID(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_CD0_M_VALID_SHIFT)) & SARADC_CD0_M_VALID_MASK)
/*! @} */

/*! @name CD1_P - Type 1 Input n Conversion Data */
/*! @{ */

#define SARADC_CD1_P_CDATA_MASK                  (0xFFFFU)
#define SARADC_CD1_P_CDATA_SHIFT                 (0U)
#define SARADC_CD1_P_CDATA_WIDTH                 (16U)
#define SARADC_CD1_P_CDATA(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_CD1_P_CDATA_SHIFT)) & SARADC_CD1_P_CDATA_MASK)

#define SARADC_CD1_P_RESULT_MASK                 (0x30000U)
#define SARADC_CD1_P_RESULT_SHIFT                (16U)
#define SARADC_CD1_P_RESULT_WIDTH                (2U)
#define SARADC_CD1_P_RESULT(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_CD1_P_RESULT_SHIFT)) & SARADC_CD1_P_RESULT_MASK)

#define SARADC_CD1_P_OVERW_MASK                  (0x40000U)
#define SARADC_CD1_P_OVERW_SHIFT                 (18U)
#define SARADC_CD1_P_OVERW_WIDTH                 (1U)
#define SARADC_CD1_P_OVERW(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_CD1_P_OVERW_SHIFT)) & SARADC_CD1_P_OVERW_MASK)

#define SARADC_CD1_P_VALID_MASK                  (0x80000U)
#define SARADC_CD1_P_VALID_SHIFT                 (19U)
#define SARADC_CD1_P_VALID_WIDTH                 (1U)
#define SARADC_CD1_P_VALID(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_CD1_P_VALID_SHIFT)) & SARADC_CD1_P_VALID_MASK)
/*! @} */

/*! @name CD1_M - Type 1 Input n Conversion Data */
/*! @{ */

#define SARADC_CD1_M_CDATA_MASK                  (0xFFFFU)
#define SARADC_CD1_M_CDATA_SHIFT                 (0U)
#define SARADC_CD1_M_CDATA_WIDTH                 (16U)
#define SARADC_CD1_M_CDATA(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_CD1_M_CDATA_SHIFT)) & SARADC_CD1_M_CDATA_MASK)

#define SARADC_CD1_M_RESULT_MASK                 (0x30000U)
#define SARADC_CD1_M_RESULT_SHIFT                (16U)
#define SARADC_CD1_M_RESULT_WIDTH                (2U)
#define SARADC_CD1_M_RESULT(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_CD1_M_RESULT_SHIFT)) & SARADC_CD1_M_RESULT_MASK)

#define SARADC_CD1_M_OVERW_MASK                  (0x40000U)
#define SARADC_CD1_M_OVERW_SHIFT                 (18U)
#define SARADC_CD1_M_OVERW_WIDTH                 (1U)
#define SARADC_CD1_M_OVERW(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_CD1_M_OVERW_SHIFT)) & SARADC_CD1_M_OVERW_MASK)

#define SARADC_CD1_M_VALID_MASK                  (0x80000U)
#define SARADC_CD1_M_VALID_SHIFT                 (19U)
#define SARADC_CD1_M_VALID_WIDTH                 (1U)
#define SARADC_CD1_M_VALID(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_CD1_M_VALID_SHIFT)) & SARADC_CD1_M_VALID_MASK)
/*! @} */

/*! @name CD2_P - Type 2 input n Conversion Data */
/*! @{ */

#define SARADC_CD2_P_CDATA_MASK                  (0xFFFFU)
#define SARADC_CD2_P_CDATA_SHIFT                 (0U)
#define SARADC_CD2_P_CDATA_WIDTH                 (16U)
#define SARADC_CD2_P_CDATA(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_CD2_P_CDATA_SHIFT)) & SARADC_CD2_P_CDATA_MASK)

#define SARADC_CD2_P_RESULT_MASK                 (0x30000U)
#define SARADC_CD2_P_RESULT_SHIFT                (16U)
#define SARADC_CD2_P_RESULT_WIDTH                (2U)
#define SARADC_CD2_P_RESULT(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_CD2_P_RESULT_SHIFT)) & SARADC_CD2_P_RESULT_MASK)

