zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SARADC.h
#define SARADC_CD2_P_OVERW_MASK                  (0x40000U)
#define SARADC_CD2_P_OVERW_SHIFT                 (18U)
#define SARADC_CD2_P_OVERW_WIDTH                 (1U)
#define SARADC_CD2_P_OVERW(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_CD2_P_OVERW_SHIFT)) & SARADC_CD2_P_OVERW_MASK)

#define SARADC_CD2_P_VALID_MASK                  (0x80000U)
#define SARADC_CD2_P_VALID_SHIFT                 (19U)
#define SARADC_CD2_P_VALID_WIDTH                 (1U)
#define SARADC_CD2_P_VALID(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_CD2_P_VALID_SHIFT)) & SARADC_CD2_P_VALID_MASK)
/*! @} */

/*! @name CD2_M - Type 2 input n Conversion Data */
/*! @{ */

#define SARADC_CD2_M_CDATA_MASK                  (0xFFFFU)
#define SARADC_CD2_M_CDATA_SHIFT                 (0U)
#define SARADC_CD2_M_CDATA_WIDTH                 (16U)
#define SARADC_CD2_M_CDATA(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_CD2_M_CDATA_SHIFT)) & SARADC_CD2_M_CDATA_MASK)

#define SARADC_CD2_M_RESULT_MASK                 (0x30000U)
#define SARADC_CD2_M_RESULT_SHIFT                (16U)
#define SARADC_CD2_M_RESULT_WIDTH                (2U)
#define SARADC_CD2_M_RESULT(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_CD2_M_RESULT_SHIFT)) & SARADC_CD2_M_RESULT_MASK)

#define SARADC_CD2_M_OVERW_MASK                  (0x40000U)
#define SARADC_CD2_M_OVERW_SHIFT                 (18U)
#define SARADC_CD2_M_OVERW_WIDTH                 (1U)
#define SARADC_CD2_M_OVERW(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_CD2_M_OVERW_SHIFT)) & SARADC_CD2_M_OVERW_MASK)

#define SARADC_CD2_M_VALID_MASK                  (0x80000U)
#define SARADC_CD2_M_VALID_SHIFT                 (19U)
#define SARADC_CD2_M_VALID_WIDTH                 (1U)
#define SARADC_CD2_M_VALID(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_CD2_M_VALID_SHIFT)) & SARADC_CD2_M_VALID_MASK)
/*! @} */

/*! @name CWSEL_0_0 - Channel Analog Watchdog Select for Type 0 */
/*! @{ */

#define SARADC_CWSEL_0_0_WSEL_T00_0_MASK         (0x3U)
#define SARADC_CWSEL_0_0_WSEL_T00_0_SHIFT        (0U)
#define SARADC_CWSEL_0_0_WSEL_T00_0_WIDTH        (2U)
#define SARADC_CWSEL_0_0_WSEL_T00_0(x)           (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_0_0_WSEL_T00_0_SHIFT)) & SARADC_CWSEL_0_0_WSEL_T00_0_MASK)

#define SARADC_CWSEL_0_0_WSEL_T00_1_MASK         (0x30U)
#define SARADC_CWSEL_0_0_WSEL_T00_1_SHIFT        (4U)
#define SARADC_CWSEL_0_0_WSEL_T00_1_WIDTH        (2U)
#define SARADC_CWSEL_0_0_WSEL_T00_1(x)           (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_0_0_WSEL_T00_1_SHIFT)) & SARADC_CWSEL_0_0_WSEL_T00_1_MASK)

#define SARADC_CWSEL_0_0_WSEL_T00_2_MASK         (0x300U)
#define SARADC_CWSEL_0_0_WSEL_T00_2_SHIFT        (8U)
#define SARADC_CWSEL_0_0_WSEL_T00_2_WIDTH        (2U)
#define SARADC_CWSEL_0_0_WSEL_T00_2(x)           (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_0_0_WSEL_T00_2_SHIFT)) & SARADC_CWSEL_0_0_WSEL_T00_2_MASK)

#define SARADC_CWSEL_0_0_WSEL_T00_3_MASK         (0x3000U)
#define SARADC_CWSEL_0_0_WSEL_T00_3_SHIFT        (12U)
#define SARADC_CWSEL_0_0_WSEL_T00_3_WIDTH        (2U)
#define SARADC_CWSEL_0_0_WSEL_T00_3(x)           (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_0_0_WSEL_T00_3_SHIFT)) & SARADC_CWSEL_0_0_WSEL_T00_3_MASK)

#define SARADC_CWSEL_0_0_WSEL_T00_4_MASK         (0x30000U)
#define SARADC_CWSEL_0_0_WSEL_T00_4_SHIFT        (16U)
#define SARADC_CWSEL_0_0_WSEL_T00_4_WIDTH        (2U)
#define SARADC_CWSEL_0_0_WSEL_T00_4(x)           (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_0_0_WSEL_T00_4_SHIFT)) & SARADC_CWSEL_0_0_WSEL_T00_4_MASK)

#define SARADC_CWSEL_0_0_WSEL_T00_5_MASK         (0x300000U)
#define SARADC_CWSEL_0_0_WSEL_T00_5_SHIFT        (20U)
#define SARADC_CWSEL_0_0_WSEL_T00_5_WIDTH        (2U)
#define SARADC_CWSEL_0_0_WSEL_T00_5(x)           (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_0_0_WSEL_T00_5_SHIFT)) & SARADC_CWSEL_0_0_WSEL_T00_5_MASK)

#define SARADC_CWSEL_0_0_WSEL_T00_6_MASK         (0x3000000U)
#define SARADC_CWSEL_0_0_WSEL_T00_6_SHIFT        (24U)
#define SARADC_CWSEL_0_0_WSEL_T00_6_WIDTH        (2U)
#define SARADC_CWSEL_0_0_WSEL_T00_6(x)           (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_0_0_WSEL_T00_6_SHIFT)) & SARADC_CWSEL_0_0_WSEL_T00_6_MASK)

#define SARADC_CWSEL_0_0_WSEL_T00_7_MASK         (0x30000000U)
#define SARADC_CWSEL_0_0_WSEL_T00_7_SHIFT        (28U)
#define SARADC_CWSEL_0_0_WSEL_T00_7_WIDTH        (2U)
#define SARADC_CWSEL_0_0_WSEL_T00_7(x)           (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_0_0_WSEL_T00_7_SHIFT)) & SARADC_CWSEL_0_0_WSEL_T00_7_MASK)
/*! @} */

/*! @name CWSEL_0_1 - Channel Analog Watchdog Select for Type 0 */
/*! @{ */

#define SARADC_CWSEL_0_1_WSEL_T01_8_MASK         (0x3U)
#define SARADC_CWSEL_0_1_WSEL_T01_8_SHIFT        (0U)
#define SARADC_CWSEL_0_1_WSEL_T01_8_WIDTH        (2U)
#define SARADC_CWSEL_0_1_WSEL_T01_8(x)           (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_0_1_WSEL_T01_8_SHIFT)) & SARADC_CWSEL_0_1_WSEL_T01_8_MASK)

#define SARADC_CWSEL_0_1_WSEL_T01_9_MASK         (0x30U)
#define SARADC_CWSEL_0_1_WSEL_T01_9_SHIFT        (4U)
#define SARADC_CWSEL_0_1_WSEL_T01_9_WIDTH        (2U)
#define SARADC_CWSEL_0_1_WSEL_T01_9(x)           (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_0_1_WSEL_T01_9_SHIFT)) & SARADC_CWSEL_0_1_WSEL_T01_9_MASK)

#define SARADC_CWSEL_0_1_WSEL_T01_10_MASK        (0x300U)
#define SARADC_CWSEL_0_1_WSEL_T01_10_SHIFT       (8U)
#define SARADC_CWSEL_0_1_WSEL_T01_10_WIDTH       (2U)
#define SARADC_CWSEL_0_1_WSEL_T01_10(x)          (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_0_1_WSEL_T01_10_SHIFT)) & SARADC_CWSEL_0_1_WSEL_T01_10_MASK)

#define SARADC_CWSEL_0_1_WSEL_T01_11_MASK        (0x3000U)
#define SARADC_CWSEL_0_1_WSEL_T01_11_SHIFT       (12U)
#define SARADC_CWSEL_0_1_WSEL_T01_11_WIDTH       (2U)
#define SARADC_CWSEL_0_1_WSEL_T01_11(x)          (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_0_1_WSEL_T01_11_SHIFT)) & SARADC_CWSEL_0_1_WSEL_T01_11_MASK)

#define SARADC_CWSEL_0_1_WSEL_T01_12_MASK        (0x30000U)
#define SARADC_CWSEL_0_1_WSEL_T01_12_SHIFT       (16U)
#define SARADC_CWSEL_0_1_WSEL_T01_12_WIDTH       (2U)
#define SARADC_CWSEL_0_1_WSEL_T01_12(x)          (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_0_1_WSEL_T01_12_SHIFT)) & SARADC_CWSEL_0_1_WSEL_T01_12_MASK)

