zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SARADC.h
#define SARADC_CWSEL_0_1_WSEL_T01_13_MASK        (0x300000U)
#define SARADC_CWSEL_0_1_WSEL_T01_13_SHIFT       (20U)
#define SARADC_CWSEL_0_1_WSEL_T01_13_WIDTH       (2U)
#define SARADC_CWSEL_0_1_WSEL_T01_13(x)          (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_0_1_WSEL_T01_13_SHIFT)) & SARADC_CWSEL_0_1_WSEL_T01_13_MASK)

#define SARADC_CWSEL_0_1_WSEL_T01_14_MASK        (0x3000000U)
#define SARADC_CWSEL_0_1_WSEL_T01_14_SHIFT       (24U)
#define SARADC_CWSEL_0_1_WSEL_T01_14_WIDTH       (2U)
#define SARADC_CWSEL_0_1_WSEL_T01_14(x)          (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_0_1_WSEL_T01_14_SHIFT)) & SARADC_CWSEL_0_1_WSEL_T01_14_MASK)

#define SARADC_CWSEL_0_1_WSEL_T01_15_MASK        (0x30000000U)
#define SARADC_CWSEL_0_1_WSEL_T01_15_SHIFT       (28U)
#define SARADC_CWSEL_0_1_WSEL_T01_15_WIDTH       (2U)
#define SARADC_CWSEL_0_1_WSEL_T01_15(x)          (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_0_1_WSEL_T01_15_SHIFT)) & SARADC_CWSEL_0_1_WSEL_T01_15_MASK)
/*! @} */

/*! @name CWSEL_0_2 - Channel Analog Watchdog Select for Type 0 */
/*! @{ */

#define SARADC_CWSEL_0_2_WSEL_T02_16_MASK        (0x3U)
#define SARADC_CWSEL_0_2_WSEL_T02_16_SHIFT       (0U)
#define SARADC_CWSEL_0_2_WSEL_T02_16_WIDTH       (2U)
#define SARADC_CWSEL_0_2_WSEL_T02_16(x)          (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_0_2_WSEL_T02_16_SHIFT)) & SARADC_CWSEL_0_2_WSEL_T02_16_MASK)

#define SARADC_CWSEL_0_2_WSEL_T02_17_MASK        (0x30U)
#define SARADC_CWSEL_0_2_WSEL_T02_17_SHIFT       (4U)
#define SARADC_CWSEL_0_2_WSEL_T02_17_WIDTH       (2U)
#define SARADC_CWSEL_0_2_WSEL_T02_17(x)          (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_0_2_WSEL_T02_17_SHIFT)) & SARADC_CWSEL_0_2_WSEL_T02_17_MASK)

#define SARADC_CWSEL_0_2_WSEL_T02_18_MASK        (0x300U)
#define SARADC_CWSEL_0_2_WSEL_T02_18_SHIFT       (8U)
#define SARADC_CWSEL_0_2_WSEL_T02_18_WIDTH       (2U)
#define SARADC_CWSEL_0_2_WSEL_T02_18(x)          (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_0_2_WSEL_T02_18_SHIFT)) & SARADC_CWSEL_0_2_WSEL_T02_18_MASK)

#define SARADC_CWSEL_0_2_WSEL_T02_19_MASK        (0x3000U)
#define SARADC_CWSEL_0_2_WSEL_T02_19_SHIFT       (12U)
#define SARADC_CWSEL_0_2_WSEL_T02_19_WIDTH       (2U)
#define SARADC_CWSEL_0_2_WSEL_T02_19(x)          (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_0_2_WSEL_T02_19_SHIFT)) & SARADC_CWSEL_0_2_WSEL_T02_19_MASK)

#define SARADC_CWSEL_0_2_WSEL_T02_20_MASK        (0x30000U)
#define SARADC_CWSEL_0_2_WSEL_T02_20_SHIFT       (16U)
#define SARADC_CWSEL_0_2_WSEL_T02_20_WIDTH       (2U)
#define SARADC_CWSEL_0_2_WSEL_T02_20(x)          (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_0_2_WSEL_T02_20_SHIFT)) & SARADC_CWSEL_0_2_WSEL_T02_20_MASK)

#define SARADC_CWSEL_0_2_WSEL_T02_21_MASK        (0x300000U)
#define SARADC_CWSEL_0_2_WSEL_T02_21_SHIFT       (20U)
#define SARADC_CWSEL_0_2_WSEL_T02_21_WIDTH       (2U)
#define SARADC_CWSEL_0_2_WSEL_T02_21(x)          (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_0_2_WSEL_T02_21_SHIFT)) & SARADC_CWSEL_0_2_WSEL_T02_21_MASK)

#define SARADC_CWSEL_0_2_WSEL_T02_22_MASK        (0x3000000U)
#define SARADC_CWSEL_0_2_WSEL_T02_22_SHIFT       (24U)
#define SARADC_CWSEL_0_2_WSEL_T02_22_WIDTH       (2U)
#define SARADC_CWSEL_0_2_WSEL_T02_22(x)          (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_0_2_WSEL_T02_22_SHIFT)) & SARADC_CWSEL_0_2_WSEL_T02_22_MASK)

#define SARADC_CWSEL_0_2_WSEL_T02_23_MASK        (0x30000000U)
#define SARADC_CWSEL_0_2_WSEL_T02_23_SHIFT       (28U)
#define SARADC_CWSEL_0_2_WSEL_T02_23_WIDTH       (2U)
#define SARADC_CWSEL_0_2_WSEL_T02_23(x)          (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_0_2_WSEL_T02_23_SHIFT)) & SARADC_CWSEL_0_2_WSEL_T02_23_MASK)
/*! @} */

/*! @name CWSEL_0_3 - Channel Analog Watchdog Select for Type 0 */
/*! @{ */

#define SARADC_CWSEL_0_3_WSEL_T03_24_MASK        (0x3U)
#define SARADC_CWSEL_0_3_WSEL_T03_24_SHIFT       (0U)
#define SARADC_CWSEL_0_3_WSEL_T03_24_WIDTH       (2U)
#define SARADC_CWSEL_0_3_WSEL_T03_24(x)          (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_0_3_WSEL_T03_24_SHIFT)) & SARADC_CWSEL_0_3_WSEL_T03_24_MASK)

#define SARADC_CWSEL_0_3_WSEL_T03_25_MASK        (0x30U)
#define SARADC_CWSEL_0_3_WSEL_T03_25_SHIFT       (4U)
#define SARADC_CWSEL_0_3_WSEL_T03_25_WIDTH       (2U)
#define SARADC_CWSEL_0_3_WSEL_T03_25(x)          (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_0_3_WSEL_T03_25_SHIFT)) & SARADC_CWSEL_0_3_WSEL_T03_25_MASK)

#define SARADC_CWSEL_0_3_WSEL_T03_26_MASK        (0x300U)
#define SARADC_CWSEL_0_3_WSEL_T03_26_SHIFT       (8U)
#define SARADC_CWSEL_0_3_WSEL_T03_26_WIDTH       (2U)
#define SARADC_CWSEL_0_3_WSEL_T03_26(x)          (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_0_3_WSEL_T03_26_SHIFT)) & SARADC_CWSEL_0_3_WSEL_T03_26_MASK)

#define SARADC_CWSEL_0_3_WSEL_T03_27_MASK        (0x3000U)
#define SARADC_CWSEL_0_3_WSEL_T03_27_SHIFT       (12U)
#define SARADC_CWSEL_0_3_WSEL_T03_27_WIDTH       (2U)
#define SARADC_CWSEL_0_3_WSEL_T03_27(x)          (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_0_3_WSEL_T03_27_SHIFT)) & SARADC_CWSEL_0_3_WSEL_T03_27_MASK)

#define SARADC_CWSEL_0_3_WSEL_T03_28_MASK        (0x30000U)
#define SARADC_CWSEL_0_3_WSEL_T03_28_SHIFT       (16U)
#define SARADC_CWSEL_0_3_WSEL_T03_28_WIDTH       (2U)
#define SARADC_CWSEL_0_3_WSEL_T03_28(x)          (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_0_3_WSEL_T03_28_SHIFT)) & SARADC_CWSEL_0_3_WSEL_T03_28_MASK)

#define SARADC_CWSEL_0_3_WSEL_T03_29_MASK        (0x300000U)
#define SARADC_CWSEL_0_3_WSEL_T03_29_SHIFT       (20U)
#define SARADC_CWSEL_0_3_WSEL_T03_29_WIDTH       (2U)
#define SARADC_CWSEL_0_3_WSEL_T03_29(x)          (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_0_3_WSEL_T03_29_SHIFT)) & SARADC_CWSEL_0_3_WSEL_T03_29_MASK)

#define SARADC_CWSEL_0_3_WSEL_T03_30_MASK        (0x3000000U)
#define SARADC_CWSEL_0_3_WSEL_T03_30_SHIFT       (24U)
#define SARADC_CWSEL_0_3_WSEL_T03_30_WIDTH       (2U)
#define SARADC_CWSEL_0_3_WSEL_T03_30(x)          (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_0_3_WSEL_T03_30_SHIFT)) & SARADC_CWSEL_0_3_WSEL_T03_30_MASK)

#define SARADC_CWSEL_0_3_WSEL_T03_31_MASK        (0x30000000U)
#define SARADC_CWSEL_0_3_WSEL_T03_31_SHIFT       (28U)
#define SARADC_CWSEL_0_3_WSEL_T03_31_WIDTH       (2U)
#define SARADC_CWSEL_0_3_WSEL_T03_31(x)          (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_0_3_WSEL_T03_31_SHIFT)) & SARADC_CWSEL_0_3_WSEL_T03_31_MASK)
/*! @} */

/*! @name CWSEL_1_0 - Channel Analog Watchdog Select for Type 1 */
/*! @{ */

#define SARADC_CWSEL_1_0_WSEL_T10_0_MASK         (0x3U)
#define SARADC_CWSEL_1_0_WSEL_T10_0_SHIFT        (0U)
#define SARADC_CWSEL_1_0_WSEL_T10_0_WIDTH        (2U)
#define SARADC_CWSEL_1_0_WSEL_T10_0(x)           (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_1_0_WSEL_T10_0_SHIFT)) & SARADC_CWSEL_1_0_WSEL_T10_0_MASK)

#define SARADC_CWSEL_1_0_WSEL_T10_1_MASK         (0x30U)
#define SARADC_CWSEL_1_0_WSEL_T10_1_SHIFT        (4U)
#define SARADC_CWSEL_1_0_WSEL_T10_1_WIDTH        (2U)
#define SARADC_CWSEL_1_0_WSEL_T10_1(x)           (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_1_0_WSEL_T10_1_SHIFT)) & SARADC_CWSEL_1_0_WSEL_T10_1_MASK)

#define SARADC_CWSEL_1_0_WSEL_T10_2_MASK         (0x300U)
#define SARADC_CWSEL_1_0_WSEL_T10_2_SHIFT        (8U)
#define SARADC_CWSEL_1_0_WSEL_T10_2_WIDTH        (2U)
#define SARADC_CWSEL_1_0_WSEL_T10_2(x)           (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_1_0_WSEL_T10_2_SHIFT)) & SARADC_CWSEL_1_0_WSEL_T10_2_MASK)

#define SARADC_CWSEL_1_0_WSEL_T10_3_MASK         (0x3000U)
#define SARADC_CWSEL_1_0_WSEL_T10_3_SHIFT        (12U)
#define SARADC_CWSEL_1_0_WSEL_T10_3_WIDTH        (2U)
#define SARADC_CWSEL_1_0_WSEL_T10_3(x)           (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_1_0_WSEL_T10_3_SHIFT)) & SARADC_CWSEL_1_0_WSEL_T10_3_MASK)

#define SARADC_CWSEL_1_0_WSEL_T10_4_MASK         (0x30000U)
#define SARADC_CWSEL_1_0_WSEL_T10_4_SHIFT        (16U)
#define SARADC_CWSEL_1_0_WSEL_T10_4_WIDTH        (2U)
#define SARADC_CWSEL_1_0_WSEL_T10_4(x)           (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_1_0_WSEL_T10_4_SHIFT)) & SARADC_CWSEL_1_0_WSEL_T10_4_MASK)

#define SARADC_CWSEL_1_0_WSEL_T10_5_MASK         (0x300000U)
#define SARADC_CWSEL_1_0_WSEL_T10_5_SHIFT        (20U)
#define SARADC_CWSEL_1_0_WSEL_T10_5_WIDTH        (2U)
#define SARADC_CWSEL_1_0_WSEL_T10_5(x)           (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_1_0_WSEL_T10_5_SHIFT)) & SARADC_CWSEL_1_0_WSEL_T10_5_MASK)

#define SARADC_CWSEL_1_0_WSEL_T10_6_MASK         (0x3000000U)
#define SARADC_CWSEL_1_0_WSEL_T10_6_SHIFT        (24U)
#define SARADC_CWSEL_1_0_WSEL_T10_6_WIDTH        (2U)
#define SARADC_CWSEL_1_0_WSEL_T10_6(x)           (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_1_0_WSEL_T10_6_SHIFT)) & SARADC_CWSEL_1_0_WSEL_T10_6_MASK)

#define SARADC_CWSEL_1_0_WSEL_T10_7_MASK         (0x30000000U)
#define SARADC_CWSEL_1_0_WSEL_T10_7_SHIFT        (28U)
#define SARADC_CWSEL_1_0_WSEL_T10_7_WIDTH        (2U)
#define SARADC_CWSEL_1_0_WSEL_T10_7(x)           (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_1_0_WSEL_T10_7_SHIFT)) & SARADC_CWSEL_1_0_WSEL_T10_7_MASK)
/*! @} */

/*! @name CWSEL_1_1 - Channel Analog Watchdog Select for Type 1 */
/*! @{ */

#define SARADC_CWSEL_1_1_WSEL_T11_8_MASK         (0x3U)
#define SARADC_CWSEL_1_1_WSEL_T11_8_SHIFT        (0U)
#define SARADC_CWSEL_1_1_WSEL_T11_8_WIDTH        (2U)
#define SARADC_CWSEL_1_1_WSEL_T11_8(x)           (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_1_1_WSEL_T11_8_SHIFT)) & SARADC_CWSEL_1_1_WSEL_T11_8_MASK)

#define SARADC_CWSEL_1_1_WSEL_T11_9_MASK         (0x30U)
#define SARADC_CWSEL_1_1_WSEL_T11_9_SHIFT        (4U)
#define SARADC_CWSEL_1_1_WSEL_T11_9_WIDTH        (2U)
#define SARADC_CWSEL_1_1_WSEL_T11_9(x)           (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_1_1_WSEL_T11_9_SHIFT)) & SARADC_CWSEL_1_1_WSEL_T11_9_MASK)

#define SARADC_CWSEL_1_1_WSEL_T11_10_MASK        (0x300U)
#define SARADC_CWSEL_1_1_WSEL_T11_10_SHIFT       (8U)
#define SARADC_CWSEL_1_1_WSEL_T11_10_WIDTH       (2U)
#define SARADC_CWSEL_1_1_WSEL_T11_10(x)          (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_1_1_WSEL_T11_10_SHIFT)) & SARADC_CWSEL_1_1_WSEL_T11_10_MASK)
/*! @} */

/*! @name CWSEL_1_2 - Channel Analog Watchdog Select for Type 1 */
/*! @{ */

#define SARADC_CWSEL_1_2_WSEL_T12_16_MASK        (0x3U)
#define SARADC_CWSEL_1_2_WSEL_T12_16_SHIFT       (0U)
#define SARADC_CWSEL_1_2_WSEL_T12_16_WIDTH       (2U)
#define SARADC_CWSEL_1_2_WSEL_T12_16(x)          (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_1_2_WSEL_T12_16_SHIFT)) & SARADC_CWSEL_1_2_WSEL_T12_16_MASK)

