zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SARADC.h
#define SARADC_CWSEL_1_2_WSEL_T12_17_MASK        (0x30U)
#define SARADC_CWSEL_1_2_WSEL_T12_17_SHIFT       (4U)
#define SARADC_CWSEL_1_2_WSEL_T12_17_WIDTH       (2U)
#define SARADC_CWSEL_1_2_WSEL_T12_17(x)          (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_1_2_WSEL_T12_17_SHIFT)) & SARADC_CWSEL_1_2_WSEL_T12_17_MASK)

#define SARADC_CWSEL_1_2_WSEL_T12_18_MASK        (0x300U)
#define SARADC_CWSEL_1_2_WSEL_T12_18_SHIFT       (8U)
#define SARADC_CWSEL_1_2_WSEL_T12_18_WIDTH       (2U)
#define SARADC_CWSEL_1_2_WSEL_T12_18(x)          (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_1_2_WSEL_T12_18_SHIFT)) & SARADC_CWSEL_1_2_WSEL_T12_18_MASK)

#define SARADC_CWSEL_1_2_WSEL_T12_19_MASK        (0x3000U)
#define SARADC_CWSEL_1_2_WSEL_T12_19_SHIFT       (12U)
#define SARADC_CWSEL_1_2_WSEL_T12_19_WIDTH       (2U)
#define SARADC_CWSEL_1_2_WSEL_T12_19(x)          (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_1_2_WSEL_T12_19_SHIFT)) & SARADC_CWSEL_1_2_WSEL_T12_19_MASK)

#define SARADC_CWSEL_1_2_WSEL_T12_20_MASK        (0x30000U)
#define SARADC_CWSEL_1_2_WSEL_T12_20_SHIFT       (16U)
#define SARADC_CWSEL_1_2_WSEL_T12_20_WIDTH       (2U)
#define SARADC_CWSEL_1_2_WSEL_T12_20(x)          (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_1_2_WSEL_T12_20_SHIFT)) & SARADC_CWSEL_1_2_WSEL_T12_20_MASK)

#define SARADC_CWSEL_1_2_WSEL_T12_21_MASK        (0x300000U)
#define SARADC_CWSEL_1_2_WSEL_T12_21_SHIFT       (20U)
#define SARADC_CWSEL_1_2_WSEL_T12_21_WIDTH       (2U)
#define SARADC_CWSEL_1_2_WSEL_T12_21(x)          (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_1_2_WSEL_T12_21_SHIFT)) & SARADC_CWSEL_1_2_WSEL_T12_21_MASK)

#define SARADC_CWSEL_1_2_WSEL_T12_22_MASK        (0x3000000U)
#define SARADC_CWSEL_1_2_WSEL_T12_22_SHIFT       (24U)
#define SARADC_CWSEL_1_2_WSEL_T12_22_WIDTH       (2U)
#define SARADC_CWSEL_1_2_WSEL_T12_22(x)          (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_1_2_WSEL_T12_22_SHIFT)) & SARADC_CWSEL_1_2_WSEL_T12_22_MASK)

#define SARADC_CWSEL_1_2_WSEL_T12_23_MASK        (0x30000000U)
#define SARADC_CWSEL_1_2_WSEL_T12_23_SHIFT       (28U)
#define SARADC_CWSEL_1_2_WSEL_T12_23_WIDTH       (2U)
#define SARADC_CWSEL_1_2_WSEL_T12_23(x)          (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_1_2_WSEL_T12_23_SHIFT)) & SARADC_CWSEL_1_2_WSEL_T12_23_MASK)
/*! @} */

/*! @name CWSEL_1_3 - Channel Analog Watchdog Select for Type 1 */
/*! @{ */

#define SARADC_CWSEL_1_3_WSEL_T13_24_MASK        (0x3U)
#define SARADC_CWSEL_1_3_WSEL_T13_24_SHIFT       (0U)
#define SARADC_CWSEL_1_3_WSEL_T13_24_WIDTH       (2U)
#define SARADC_CWSEL_1_3_WSEL_T13_24(x)          (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_1_3_WSEL_T13_24_SHIFT)) & SARADC_CWSEL_1_3_WSEL_T13_24_MASK)

#define SARADC_CWSEL_1_3_WSEL_T13_25_MASK        (0x30U)
#define SARADC_CWSEL_1_3_WSEL_T13_25_SHIFT       (4U)
#define SARADC_CWSEL_1_3_WSEL_T13_25_WIDTH       (2U)
#define SARADC_CWSEL_1_3_WSEL_T13_25(x)          (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_1_3_WSEL_T13_25_SHIFT)) & SARADC_CWSEL_1_3_WSEL_T13_25_MASK)

#define SARADC_CWSEL_1_3_WSEL_T13_26_MASK        (0x300U)
#define SARADC_CWSEL_1_3_WSEL_T13_26_SHIFT       (8U)
#define SARADC_CWSEL_1_3_WSEL_T13_26_WIDTH       (2U)
#define SARADC_CWSEL_1_3_WSEL_T13_26(x)          (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_1_3_WSEL_T13_26_SHIFT)) & SARADC_CWSEL_1_3_WSEL_T13_26_MASK)
/*! @} */

/*! @name CWSEL_2_0 - Channel Analog Watchdog Select for Type 2 */
/*! @{ */

#define SARADC_CWSEL_2_0_WSEL_T20_0_MASK         (0x3U)
#define SARADC_CWSEL_2_0_WSEL_T20_0_SHIFT        (0U)
#define SARADC_CWSEL_2_0_WSEL_T20_0_WIDTH        (2U)
#define SARADC_CWSEL_2_0_WSEL_T20_0(x)           (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_2_0_WSEL_T20_0_SHIFT)) & SARADC_CWSEL_2_0_WSEL_T20_0_MASK)

#define SARADC_CWSEL_2_0_WSEL_T20_1_MASK         (0x30U)
#define SARADC_CWSEL_2_0_WSEL_T20_1_SHIFT        (4U)
#define SARADC_CWSEL_2_0_WSEL_T20_1_WIDTH        (2U)
#define SARADC_CWSEL_2_0_WSEL_T20_1(x)           (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_2_0_WSEL_T20_1_SHIFT)) & SARADC_CWSEL_2_0_WSEL_T20_1_MASK)

#define SARADC_CWSEL_2_0_WSEL_T20_2_MASK         (0x300U)
#define SARADC_CWSEL_2_0_WSEL_T20_2_SHIFT        (8U)
#define SARADC_CWSEL_2_0_WSEL_T20_2_WIDTH        (2U)
#define SARADC_CWSEL_2_0_WSEL_T20_2(x)           (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_2_0_WSEL_T20_2_SHIFT)) & SARADC_CWSEL_2_0_WSEL_T20_2_MASK)

#define SARADC_CWSEL_2_0_WSEL_T20_3_MASK         (0x3000U)
#define SARADC_CWSEL_2_0_WSEL_T20_3_SHIFT        (12U)
#define SARADC_CWSEL_2_0_WSEL_T20_3_WIDTH        (2U)
#define SARADC_CWSEL_2_0_WSEL_T20_3(x)           (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_2_0_WSEL_T20_3_SHIFT)) & SARADC_CWSEL_2_0_WSEL_T20_3_MASK)

#define SARADC_CWSEL_2_0_WSEL_T20_4_MASK         (0x30000U)
#define SARADC_CWSEL_2_0_WSEL_T20_4_SHIFT        (16U)
#define SARADC_CWSEL_2_0_WSEL_T20_4_WIDTH        (2U)
#define SARADC_CWSEL_2_0_WSEL_T20_4(x)           (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_2_0_WSEL_T20_4_SHIFT)) & SARADC_CWSEL_2_0_WSEL_T20_4_MASK)

#define SARADC_CWSEL_2_0_WSEL_T20_5_MASK         (0x300000U)
#define SARADC_CWSEL_2_0_WSEL_T20_5_SHIFT        (20U)
#define SARADC_CWSEL_2_0_WSEL_T20_5_WIDTH        (2U)
#define SARADC_CWSEL_2_0_WSEL_T20_5(x)           (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_2_0_WSEL_T20_5_SHIFT)) & SARADC_CWSEL_2_0_WSEL_T20_5_MASK)

#define SARADC_CWSEL_2_0_WSEL_T20_6_MASK         (0x3000000U)
#define SARADC_CWSEL_2_0_WSEL_T20_6_SHIFT        (24U)
#define SARADC_CWSEL_2_0_WSEL_T20_6_WIDTH        (2U)
#define SARADC_CWSEL_2_0_WSEL_T20_6(x)           (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_2_0_WSEL_T20_6_SHIFT)) & SARADC_CWSEL_2_0_WSEL_T20_6_MASK)

#define SARADC_CWSEL_2_0_WSEL_T20_7_MASK         (0x30000000U)
#define SARADC_CWSEL_2_0_WSEL_T20_7_SHIFT        (28U)
#define SARADC_CWSEL_2_0_WSEL_T20_7_WIDTH        (2U)
#define SARADC_CWSEL_2_0_WSEL_T20_7(x)           (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_2_0_WSEL_T20_7_SHIFT)) & SARADC_CWSEL_2_0_WSEL_T20_7_MASK)
/*! @} */

/*! @name CWSEL_2_1 - Channel Analog Watchdog Select for Type 2 */
/*! @{ */

#define SARADC_CWSEL_2_1_WSEL_T21_8_MASK         (0x3U)
#define SARADC_CWSEL_2_1_WSEL_T21_8_SHIFT        (0U)
#define SARADC_CWSEL_2_1_WSEL_T21_8_WIDTH        (2U)
#define SARADC_CWSEL_2_1_WSEL_T21_8(x)           (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_2_1_WSEL_T21_8_SHIFT)) & SARADC_CWSEL_2_1_WSEL_T21_8_MASK)

