zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SARADC.h
#define SARADC_CWSEL_2_1_WSEL_T21_9_MASK         (0x30U)
#define SARADC_CWSEL_2_1_WSEL_T21_9_SHIFT        (4U)
#define SARADC_CWSEL_2_1_WSEL_T21_9_WIDTH        (2U)
#define SARADC_CWSEL_2_1_WSEL_T21_9(x)           (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_2_1_WSEL_T21_9_SHIFT)) & SARADC_CWSEL_2_1_WSEL_T21_9_MASK)

#define SARADC_CWSEL_2_1_WSEL_T21_10_MASK        (0x300U)
#define SARADC_CWSEL_2_1_WSEL_T21_10_SHIFT       (8U)
#define SARADC_CWSEL_2_1_WSEL_T21_10_WIDTH       (2U)
#define SARADC_CWSEL_2_1_WSEL_T21_10(x)          (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_2_1_WSEL_T21_10_SHIFT)) & SARADC_CWSEL_2_1_WSEL_T21_10_MASK)

#define SARADC_CWSEL_2_1_WSEL_T21_11_MASK        (0x3000U)
#define SARADC_CWSEL_2_1_WSEL_T21_11_SHIFT       (12U)
#define SARADC_CWSEL_2_1_WSEL_T21_11_WIDTH       (2U)
#define SARADC_CWSEL_2_1_WSEL_T21_11(x)          (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_2_1_WSEL_T21_11_SHIFT)) & SARADC_CWSEL_2_1_WSEL_T21_11_MASK)

#define SARADC_CWSEL_2_1_WSEL_T21_12_MASK        (0x30000U)
#define SARADC_CWSEL_2_1_WSEL_T21_12_SHIFT       (16U)
#define SARADC_CWSEL_2_1_WSEL_T21_12_WIDTH       (2U)
#define SARADC_CWSEL_2_1_WSEL_T21_12(x)          (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_2_1_WSEL_T21_12_SHIFT)) & SARADC_CWSEL_2_1_WSEL_T21_12_MASK)

#define SARADC_CWSEL_2_1_WSEL_T21_13_MASK        (0x300000U)
#define SARADC_CWSEL_2_1_WSEL_T21_13_SHIFT       (20U)
#define SARADC_CWSEL_2_1_WSEL_T21_13_WIDTH       (2U)
#define SARADC_CWSEL_2_1_WSEL_T21_13(x)          (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_2_1_WSEL_T21_13_SHIFT)) & SARADC_CWSEL_2_1_WSEL_T21_13_MASK)

#define SARADC_CWSEL_2_1_WSEL_T21_14_MASK        (0x3000000U)
#define SARADC_CWSEL_2_1_WSEL_T21_14_SHIFT       (24U)
#define SARADC_CWSEL_2_1_WSEL_T21_14_WIDTH       (2U)
#define SARADC_CWSEL_2_1_WSEL_T21_14(x)          (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_2_1_WSEL_T21_14_SHIFT)) & SARADC_CWSEL_2_1_WSEL_T21_14_MASK)

#define SARADC_CWSEL_2_1_WSEL_T21_15_MASK        (0x30000000U)
#define SARADC_CWSEL_2_1_WSEL_T21_15_SHIFT       (28U)
#define SARADC_CWSEL_2_1_WSEL_T21_15_WIDTH       (2U)
#define SARADC_CWSEL_2_1_WSEL_T21_15(x)          (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_2_1_WSEL_T21_15_SHIFT)) & SARADC_CWSEL_2_1_WSEL_T21_15_MASK)
/*! @} */

/*! @name CWSEL_2_2 - Channel Analog Watchdog Select for Type 2 */
/*! @{ */

#define SARADC_CWSEL_2_2_WSEL_T22_16_MASK        (0x3U)
#define SARADC_CWSEL_2_2_WSEL_T22_16_SHIFT       (0U)
#define SARADC_CWSEL_2_2_WSEL_T22_16_WIDTH       (2U)
#define SARADC_CWSEL_2_2_WSEL_T22_16(x)          (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_2_2_WSEL_T22_16_SHIFT)) & SARADC_CWSEL_2_2_WSEL_T22_16_MASK)

#define SARADC_CWSEL_2_2_WSEL_T22_17_MASK        (0x30U)
#define SARADC_CWSEL_2_2_WSEL_T22_17_SHIFT       (4U)
#define SARADC_CWSEL_2_2_WSEL_T22_17_WIDTH       (2U)
#define SARADC_CWSEL_2_2_WSEL_T22_17(x)          (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_2_2_WSEL_T22_17_SHIFT)) & SARADC_CWSEL_2_2_WSEL_T22_17_MASK)

#define SARADC_CWSEL_2_2_WSEL_T22_18_MASK        (0x300U)
#define SARADC_CWSEL_2_2_WSEL_T22_18_SHIFT       (8U)
#define SARADC_CWSEL_2_2_WSEL_T22_18_WIDTH       (2U)
#define SARADC_CWSEL_2_2_WSEL_T22_18(x)          (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_2_2_WSEL_T22_18_SHIFT)) & SARADC_CWSEL_2_2_WSEL_T22_18_MASK)

#define SARADC_CWSEL_2_2_WSEL_T22_19_MASK        (0x3000U)
#define SARADC_CWSEL_2_2_WSEL_T22_19_SHIFT       (12U)
#define SARADC_CWSEL_2_2_WSEL_T22_19_WIDTH       (2U)
#define SARADC_CWSEL_2_2_WSEL_T22_19(x)          (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_2_2_WSEL_T22_19_SHIFT)) & SARADC_CWSEL_2_2_WSEL_T22_19_MASK)

#define SARADC_CWSEL_2_2_WSEL_T22_20_MASK        (0x30000U)
#define SARADC_CWSEL_2_2_WSEL_T22_20_SHIFT       (16U)
#define SARADC_CWSEL_2_2_WSEL_T22_20_WIDTH       (2U)
#define SARADC_CWSEL_2_2_WSEL_T22_20(x)          (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_2_2_WSEL_T22_20_SHIFT)) & SARADC_CWSEL_2_2_WSEL_T22_20_MASK)

#define SARADC_CWSEL_2_2_WSEL_T22_21_MASK        (0x300000U)
#define SARADC_CWSEL_2_2_WSEL_T22_21_SHIFT       (20U)
#define SARADC_CWSEL_2_2_WSEL_T22_21_WIDTH       (2U)
#define SARADC_CWSEL_2_2_WSEL_T22_21(x)          (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_2_2_WSEL_T22_21_SHIFT)) & SARADC_CWSEL_2_2_WSEL_T22_21_MASK)

#define SARADC_CWSEL_2_2_WSEL_T22_22_MASK        (0x3000000U)
#define SARADC_CWSEL_2_2_WSEL_T22_22_SHIFT       (24U)
#define SARADC_CWSEL_2_2_WSEL_T22_22_WIDTH       (2U)
#define SARADC_CWSEL_2_2_WSEL_T22_22(x)          (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_2_2_WSEL_T22_22_SHIFT)) & SARADC_CWSEL_2_2_WSEL_T22_22_MASK)

#define SARADC_CWSEL_2_2_WSEL_T22_23_MASK        (0x30000000U)
#define SARADC_CWSEL_2_2_WSEL_T22_23_SHIFT       (28U)
#define SARADC_CWSEL_2_2_WSEL_T22_23_WIDTH       (2U)
#define SARADC_CWSEL_2_2_WSEL_T22_23(x)          (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_2_2_WSEL_T22_23_SHIFT)) & SARADC_CWSEL_2_2_WSEL_T22_23_MASK)
/*! @} */

/*! @name CWSEL_2_3 - Channel Analog Watchdog Select for Type 2 */
/*! @{ */

#define SARADC_CWSEL_2_3_WSEL_T23_24_MASK        (0x3U)
#define SARADC_CWSEL_2_3_WSEL_T23_24_SHIFT       (0U)
#define SARADC_CWSEL_2_3_WSEL_T23_24_WIDTH       (2U)
#define SARADC_CWSEL_2_3_WSEL_T23_24(x)          (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_2_3_WSEL_T23_24_SHIFT)) & SARADC_CWSEL_2_3_WSEL_T23_24_MASK)

#define SARADC_CWSEL_2_3_WSEL_T23_25_MASK        (0x30U)
#define SARADC_CWSEL_2_3_WSEL_T23_25_SHIFT       (4U)
#define SARADC_CWSEL_2_3_WSEL_T23_25_WIDTH       (2U)
#define SARADC_CWSEL_2_3_WSEL_T23_25(x)          (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_2_3_WSEL_T23_25_SHIFT)) & SARADC_CWSEL_2_3_WSEL_T23_25_MASK)

#define SARADC_CWSEL_2_3_WSEL_T23_26_MASK        (0x300U)
#define SARADC_CWSEL_2_3_WSEL_T23_26_SHIFT       (8U)
#define SARADC_CWSEL_2_3_WSEL_T23_26_WIDTH       (2U)
#define SARADC_CWSEL_2_3_WSEL_T23_26(x)          (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_2_3_WSEL_T23_26_SHIFT)) & SARADC_CWSEL_2_3_WSEL_T23_26_MASK)

#define SARADC_CWSEL_2_3_WSEL_T23_27_MASK        (0x3000U)
#define SARADC_CWSEL_2_3_WSEL_T23_27_SHIFT       (12U)
#define SARADC_CWSEL_2_3_WSEL_T23_27_WIDTH       (2U)
#define SARADC_CWSEL_2_3_WSEL_T23_27(x)          (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_2_3_WSEL_T23_27_SHIFT)) & SARADC_CWSEL_2_3_WSEL_T23_27_MASK)

#define SARADC_CWSEL_2_3_WSEL_T23_28_MASK        (0x30000U)
#define SARADC_CWSEL_2_3_WSEL_T23_28_SHIFT       (16U)
#define SARADC_CWSEL_2_3_WSEL_T23_28_WIDTH       (2U)
#define SARADC_CWSEL_2_3_WSEL_T23_28(x)          (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_2_3_WSEL_T23_28_SHIFT)) & SARADC_CWSEL_2_3_WSEL_T23_28_MASK)

#define SARADC_CWSEL_2_3_WSEL_T23_29_MASK        (0x300000U)
#define SARADC_CWSEL_2_3_WSEL_T23_29_SHIFT       (20U)
#define SARADC_CWSEL_2_3_WSEL_T23_29_WIDTH       (2U)
#define SARADC_CWSEL_2_3_WSEL_T23_29(x)          (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_2_3_WSEL_T23_29_SHIFT)) & SARADC_CWSEL_2_3_WSEL_T23_29_MASK)

#define SARADC_CWSEL_2_3_WSEL_T23_30_MASK        (0x3000000U)
#define SARADC_CWSEL_2_3_WSEL_T23_30_SHIFT       (24U)
#define SARADC_CWSEL_2_3_WSEL_T23_30_WIDTH       (2U)
#define SARADC_CWSEL_2_3_WSEL_T23_30(x)          (((uint32_t)(((uint32_t)(x)) << SARADC_CWSEL_2_3_WSEL_T23_30_SHIFT)) & SARADC_CWSEL_2_3_WSEL_T23_30_MASK)

