zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SARADC.h
#define SARADC_CWEN0_CWEN19_MASK                 (0x80000U)
#define SARADC_CWEN0_CWEN19_SHIFT                (19U)
#define SARADC_CWEN0_CWEN19_WIDTH                (1U)
#define SARADC_CWEN0_CWEN19(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN0_CWEN19_SHIFT)) & SARADC_CWEN0_CWEN19_MASK)

#define SARADC_CWEN0_CWEN20_MASK                 (0x100000U)
#define SARADC_CWEN0_CWEN20_SHIFT                (20U)
#define SARADC_CWEN0_CWEN20_WIDTH                (1U)
#define SARADC_CWEN0_CWEN20(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN0_CWEN20_SHIFT)) & SARADC_CWEN0_CWEN20_MASK)

#define SARADC_CWEN0_CWEN21_MASK                 (0x200000U)
#define SARADC_CWEN0_CWEN21_SHIFT                (21U)
#define SARADC_CWEN0_CWEN21_WIDTH                (1U)
#define SARADC_CWEN0_CWEN21(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN0_CWEN21_SHIFT)) & SARADC_CWEN0_CWEN21_MASK)

#define SARADC_CWEN0_CWEN22_MASK                 (0x400000U)
#define SARADC_CWEN0_CWEN22_SHIFT                (22U)
#define SARADC_CWEN0_CWEN22_WIDTH                (1U)
#define SARADC_CWEN0_CWEN22(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN0_CWEN22_SHIFT)) & SARADC_CWEN0_CWEN22_MASK)

#define SARADC_CWEN0_CWEN23_MASK                 (0x800000U)
#define SARADC_CWEN0_CWEN23_SHIFT                (23U)
#define SARADC_CWEN0_CWEN23_WIDTH                (1U)
#define SARADC_CWEN0_CWEN23(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN0_CWEN23_SHIFT)) & SARADC_CWEN0_CWEN23_MASK)

#define SARADC_CWEN0_CWEN24_MASK                 (0x1000000U)
#define SARADC_CWEN0_CWEN24_SHIFT                (24U)
#define SARADC_CWEN0_CWEN24_WIDTH                (1U)
#define SARADC_CWEN0_CWEN24(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN0_CWEN24_SHIFT)) & SARADC_CWEN0_CWEN24_MASK)

#define SARADC_CWEN0_CWEN25_MASK                 (0x2000000U)
#define SARADC_CWEN0_CWEN25_SHIFT                (25U)
#define SARADC_CWEN0_CWEN25_WIDTH                (1U)
#define SARADC_CWEN0_CWEN25(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN0_CWEN25_SHIFT)) & SARADC_CWEN0_CWEN25_MASK)

#define SARADC_CWEN0_CWEN26_MASK                 (0x4000000U)
#define SARADC_CWEN0_CWEN26_SHIFT                (26U)
#define SARADC_CWEN0_CWEN26_WIDTH                (1U)
#define SARADC_CWEN0_CWEN26(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN0_CWEN26_SHIFT)) & SARADC_CWEN0_CWEN26_MASK)

#define SARADC_CWEN0_CWEN27_MASK                 (0x8000000U)
#define SARADC_CWEN0_CWEN27_SHIFT                (27U)
#define SARADC_CWEN0_CWEN27_WIDTH                (1U)
#define SARADC_CWEN0_CWEN27(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN0_CWEN27_SHIFT)) & SARADC_CWEN0_CWEN27_MASK)

#define SARADC_CWEN0_CWEN28_MASK                 (0x10000000U)
#define SARADC_CWEN0_CWEN28_SHIFT                (28U)
#define SARADC_CWEN0_CWEN28_WIDTH                (1U)
#define SARADC_CWEN0_CWEN28(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN0_CWEN28_SHIFT)) & SARADC_CWEN0_CWEN28_MASK)

#define SARADC_CWEN0_CWEN29_MASK                 (0x20000000U)
#define SARADC_CWEN0_CWEN29_SHIFT                (29U)
#define SARADC_CWEN0_CWEN29_WIDTH                (1U)
#define SARADC_CWEN0_CWEN29(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN0_CWEN29_SHIFT)) & SARADC_CWEN0_CWEN29_MASK)

#define SARADC_CWEN0_CWEN30_MASK                 (0x40000000U)
#define SARADC_CWEN0_CWEN30_SHIFT                (30U)
#define SARADC_CWEN0_CWEN30_WIDTH                (1U)
#define SARADC_CWEN0_CWEN30(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN0_CWEN30_SHIFT)) & SARADC_CWEN0_CWEN30_MASK)

#define SARADC_CWEN0_CWEN31_MASK                 (0x80000000U)
#define SARADC_CWEN0_CWEN31_SHIFT                (31U)
#define SARADC_CWEN0_CWEN31_WIDTH                (1U)
#define SARADC_CWEN0_CWEN31(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN0_CWEN31_SHIFT)) & SARADC_CWEN0_CWEN31_MASK)
/*! @} */

/*! @name CWEN1 - Channel Watchdog Enable for Type 1 */
/*! @{ */

#define SARADC_CWEN1_CWEN0_MASK                  (0x1U)
#define SARADC_CWEN1_CWEN0_SHIFT                 (0U)
#define SARADC_CWEN1_CWEN0_WIDTH                 (1U)
#define SARADC_CWEN1_CWEN0(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN1_CWEN0_SHIFT)) & SARADC_CWEN1_CWEN0_MASK)

#define SARADC_CWEN1_CWEN1_MASK                  (0x2U)
#define SARADC_CWEN1_CWEN1_SHIFT                 (1U)
#define SARADC_CWEN1_CWEN1_WIDTH                 (1U)
#define SARADC_CWEN1_CWEN1(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN1_CWEN1_SHIFT)) & SARADC_CWEN1_CWEN1_MASK)

#define SARADC_CWEN1_CWEN2_MASK                  (0x4U)
#define SARADC_CWEN1_CWEN2_SHIFT                 (2U)
#define SARADC_CWEN1_CWEN2_WIDTH                 (1U)
#define SARADC_CWEN1_CWEN2(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN1_CWEN2_SHIFT)) & SARADC_CWEN1_CWEN2_MASK)

#define SARADC_CWEN1_CWEN3_MASK                  (0x8U)
#define SARADC_CWEN1_CWEN3_SHIFT                 (3U)
#define SARADC_CWEN1_CWEN3_WIDTH                 (1U)
#define SARADC_CWEN1_CWEN3(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN1_CWEN3_SHIFT)) & SARADC_CWEN1_CWEN3_MASK)

#define SARADC_CWEN1_CWEN4_MASK                  (0x10U)
#define SARADC_CWEN1_CWEN4_SHIFT                 (4U)
#define SARADC_CWEN1_CWEN4_WIDTH                 (1U)
#define SARADC_CWEN1_CWEN4(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN1_CWEN4_SHIFT)) & SARADC_CWEN1_CWEN4_MASK)

#define SARADC_CWEN1_CWEN5_MASK                  (0x20U)
#define SARADC_CWEN1_CWEN5_SHIFT                 (5U)
#define SARADC_CWEN1_CWEN5_WIDTH                 (1U)
#define SARADC_CWEN1_CWEN5(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN1_CWEN5_SHIFT)) & SARADC_CWEN1_CWEN5_MASK)

#define SARADC_CWEN1_CWEN6_MASK                  (0x40U)
#define SARADC_CWEN1_CWEN6_SHIFT                 (6U)
#define SARADC_CWEN1_CWEN6_WIDTH                 (1U)
#define SARADC_CWEN1_CWEN6(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN1_CWEN6_SHIFT)) & SARADC_CWEN1_CWEN6_MASK)

#define SARADC_CWEN1_CWEN7_MASK                  (0x80U)
#define SARADC_CWEN1_CWEN7_SHIFT                 (7U)
#define SARADC_CWEN1_CWEN7_WIDTH                 (1U)
#define SARADC_CWEN1_CWEN7(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN1_CWEN7_SHIFT)) & SARADC_CWEN1_CWEN7_MASK)

