zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SARADC.h
#define SARADC_CWEN1_CWEN8_MASK                  (0x100U)
#define SARADC_CWEN1_CWEN8_SHIFT                 (8U)
#define SARADC_CWEN1_CWEN8_WIDTH                 (1U)
#define SARADC_CWEN1_CWEN8(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN1_CWEN8_SHIFT)) & SARADC_CWEN1_CWEN8_MASK)

#define SARADC_CWEN1_CWEN9_MASK                  (0x200U)
#define SARADC_CWEN1_CWEN9_SHIFT                 (9U)
#define SARADC_CWEN1_CWEN9_WIDTH                 (1U)
#define SARADC_CWEN1_CWEN9(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN1_CWEN9_SHIFT)) & SARADC_CWEN1_CWEN9_MASK)

#define SARADC_CWEN1_CWEN10_MASK                 (0x400U)
#define SARADC_CWEN1_CWEN10_SHIFT                (10U)
#define SARADC_CWEN1_CWEN10_WIDTH                (1U)
#define SARADC_CWEN1_CWEN10(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN1_CWEN10_SHIFT)) & SARADC_CWEN1_CWEN10_MASK)

#define SARADC_CWEN1_CWEN16_MASK                 (0x10000U)
#define SARADC_CWEN1_CWEN16_SHIFT                (16U)
#define SARADC_CWEN1_CWEN16_WIDTH                (1U)
#define SARADC_CWEN1_CWEN16(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN1_CWEN16_SHIFT)) & SARADC_CWEN1_CWEN16_MASK)

#define SARADC_CWEN1_CWEN17_MASK                 (0x20000U)
#define SARADC_CWEN1_CWEN17_SHIFT                (17U)
#define SARADC_CWEN1_CWEN17_WIDTH                (1U)
#define SARADC_CWEN1_CWEN17(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN1_CWEN17_SHIFT)) & SARADC_CWEN1_CWEN17_MASK)

#define SARADC_CWEN1_CWEN18_MASK                 (0x40000U)
#define SARADC_CWEN1_CWEN18_SHIFT                (18U)
#define SARADC_CWEN1_CWEN18_WIDTH                (1U)
#define SARADC_CWEN1_CWEN18(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN1_CWEN18_SHIFT)) & SARADC_CWEN1_CWEN18_MASK)

#define SARADC_CWEN1_CWEN19_MASK                 (0x80000U)
#define SARADC_CWEN1_CWEN19_SHIFT                (19U)
#define SARADC_CWEN1_CWEN19_WIDTH                (1U)
#define SARADC_CWEN1_CWEN19(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN1_CWEN19_SHIFT)) & SARADC_CWEN1_CWEN19_MASK)

#define SARADC_CWEN1_CWEN20_MASK                 (0x100000U)
#define SARADC_CWEN1_CWEN20_SHIFT                (20U)
#define SARADC_CWEN1_CWEN20_WIDTH                (1U)
#define SARADC_CWEN1_CWEN20(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN1_CWEN20_SHIFT)) & SARADC_CWEN1_CWEN20_MASK)

#define SARADC_CWEN1_CWEN21_MASK                 (0x200000U)
#define SARADC_CWEN1_CWEN21_SHIFT                (21U)
#define SARADC_CWEN1_CWEN21_WIDTH                (1U)
#define SARADC_CWEN1_CWEN21(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN1_CWEN21_SHIFT)) & SARADC_CWEN1_CWEN21_MASK)

#define SARADC_CWEN1_CWEN22_MASK                 (0x400000U)
#define SARADC_CWEN1_CWEN22_SHIFT                (22U)
#define SARADC_CWEN1_CWEN22_WIDTH                (1U)
#define SARADC_CWEN1_CWEN22(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN1_CWEN22_SHIFT)) & SARADC_CWEN1_CWEN22_MASK)

#define SARADC_CWEN1_CWEN23_MASK                 (0x800000U)
#define SARADC_CWEN1_CWEN23_SHIFT                (23U)
#define SARADC_CWEN1_CWEN23_WIDTH                (1U)
#define SARADC_CWEN1_CWEN23(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN1_CWEN23_SHIFT)) & SARADC_CWEN1_CWEN23_MASK)

#define SARADC_CWEN1_CWEN24_MASK                 (0x1000000U)
#define SARADC_CWEN1_CWEN24_SHIFT                (24U)
#define SARADC_CWEN1_CWEN24_WIDTH                (1U)
#define SARADC_CWEN1_CWEN24(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN1_CWEN24_SHIFT)) & SARADC_CWEN1_CWEN24_MASK)

#define SARADC_CWEN1_CWEN25_MASK                 (0x2000000U)
#define SARADC_CWEN1_CWEN25_SHIFT                (25U)
#define SARADC_CWEN1_CWEN25_WIDTH                (1U)
#define SARADC_CWEN1_CWEN25(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN1_CWEN25_SHIFT)) & SARADC_CWEN1_CWEN25_MASK)

#define SARADC_CWEN1_CWEN26_MASK                 (0x4000000U)
#define SARADC_CWEN1_CWEN26_SHIFT                (26U)
#define SARADC_CWEN1_CWEN26_WIDTH                (1U)
#define SARADC_CWEN1_CWEN26(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN1_CWEN26_SHIFT)) & SARADC_CWEN1_CWEN26_MASK)
/*! @} */

/*! @name CWEN2 - Channel Watchdog Enable for Type 2 */
/*! @{ */

#define SARADC_CWEN2_CWEN0_MASK                  (0x1U)
#define SARADC_CWEN2_CWEN0_SHIFT                 (0U)
#define SARADC_CWEN2_CWEN0_WIDTH                 (1U)
#define SARADC_CWEN2_CWEN0(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN2_CWEN0_SHIFT)) & SARADC_CWEN2_CWEN0_MASK)

#define SARADC_CWEN2_CWEN1_MASK                  (0x2U)
#define SARADC_CWEN2_CWEN1_SHIFT                 (1U)
#define SARADC_CWEN2_CWEN1_WIDTH                 (1U)
#define SARADC_CWEN2_CWEN1(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN2_CWEN1_SHIFT)) & SARADC_CWEN2_CWEN1_MASK)

#define SARADC_CWEN2_CWEN2_MASK                  (0x4U)
#define SARADC_CWEN2_CWEN2_SHIFT                 (2U)
#define SARADC_CWEN2_CWEN2_WIDTH                 (1U)
#define SARADC_CWEN2_CWEN2(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN2_CWEN2_SHIFT)) & SARADC_CWEN2_CWEN2_MASK)

#define SARADC_CWEN2_CWEN3_MASK                  (0x8U)
#define SARADC_CWEN2_CWEN3_SHIFT                 (3U)
#define SARADC_CWEN2_CWEN3_WIDTH                 (1U)
#define SARADC_CWEN2_CWEN3(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN2_CWEN3_SHIFT)) & SARADC_CWEN2_CWEN3_MASK)

#define SARADC_CWEN2_CWEN4_MASK                  (0x10U)
#define SARADC_CWEN2_CWEN4_SHIFT                 (4U)
#define SARADC_CWEN2_CWEN4_WIDTH                 (1U)
#define SARADC_CWEN2_CWEN4(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN2_CWEN4_SHIFT)) & SARADC_CWEN2_CWEN4_MASK)

#define SARADC_CWEN2_CWEN5_MASK                  (0x20U)
#define SARADC_CWEN2_CWEN5_SHIFT                 (5U)
#define SARADC_CWEN2_CWEN5_WIDTH                 (1U)
#define SARADC_CWEN2_CWEN5(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN2_CWEN5_SHIFT)) & SARADC_CWEN2_CWEN5_MASK)

#define SARADC_CWEN2_CWEN6_MASK                  (0x40U)
#define SARADC_CWEN2_CWEN6_SHIFT                 (6U)
#define SARADC_CWEN2_CWEN6_WIDTH                 (1U)
#define SARADC_CWEN2_CWEN6(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN2_CWEN6_SHIFT)) & SARADC_CWEN2_CWEN6_MASK)

#define SARADC_CWEN2_CWEN7_MASK                  (0x80U)
#define SARADC_CWEN2_CWEN7_SHIFT                 (7U)
#define SARADC_CWEN2_CWEN7_WIDTH                 (1U)
#define SARADC_CWEN2_CWEN7(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN2_CWEN7_SHIFT)) & SARADC_CWEN2_CWEN7_MASK)

#define SARADC_CWEN2_CWEN8_MASK                  (0x100U)
#define SARADC_CWEN2_CWEN8_SHIFT                 (8U)
#define SARADC_CWEN2_CWEN8_WIDTH                 (1U)
#define SARADC_CWEN2_CWEN8(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN2_CWEN8_SHIFT)) & SARADC_CWEN2_CWEN8_MASK)

#define SARADC_CWEN2_CWEN9_MASK                  (0x200U)
#define SARADC_CWEN2_CWEN9_SHIFT                 (9U)
#define SARADC_CWEN2_CWEN9_WIDTH                 (1U)
#define SARADC_CWEN2_CWEN9(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN2_CWEN9_SHIFT)) & SARADC_CWEN2_CWEN9_MASK)

#define SARADC_CWEN2_CWEN10_MASK                 (0x400U)
#define SARADC_CWEN2_CWEN10_SHIFT                (10U)
#define SARADC_CWEN2_CWEN10_WIDTH                (1U)
#define SARADC_CWEN2_CWEN10(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN2_CWEN10_SHIFT)) & SARADC_CWEN2_CWEN10_MASK)

#define SARADC_CWEN2_CWEN11_MASK                 (0x800U)
#define SARADC_CWEN2_CWEN11_SHIFT                (11U)
#define SARADC_CWEN2_CWEN11_WIDTH                (1U)
#define SARADC_CWEN2_CWEN11(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN2_CWEN11_SHIFT)) & SARADC_CWEN2_CWEN11_MASK)

#define SARADC_CWEN2_CWEN12_MASK                 (0x1000U)
#define SARADC_CWEN2_CWEN12_SHIFT                (12U)
#define SARADC_CWEN2_CWEN12_WIDTH                (1U)
#define SARADC_CWEN2_CWEN12(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN2_CWEN12_SHIFT)) & SARADC_CWEN2_CWEN12_MASK)

#define SARADC_CWEN2_CWEN13_MASK                 (0x2000U)
#define SARADC_CWEN2_CWEN13_SHIFT                (13U)
#define SARADC_CWEN2_CWEN13_WIDTH                (1U)
#define SARADC_CWEN2_CWEN13(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN2_CWEN13_SHIFT)) & SARADC_CWEN2_CWEN13_MASK)

#define SARADC_CWEN2_CWEN14_MASK                 (0x4000U)
#define SARADC_CWEN2_CWEN14_SHIFT                (14U)
#define SARADC_CWEN2_CWEN14_WIDTH                (1U)
#define SARADC_CWEN2_CWEN14(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN2_CWEN14_SHIFT)) & SARADC_CWEN2_CWEN14_MASK)

