zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SARADC.h
#define SARADC_CWEN2_CWEN15_MASK                 (0x8000U)
#define SARADC_CWEN2_CWEN15_SHIFT                (15U)
#define SARADC_CWEN2_CWEN15_WIDTH                (1U)
#define SARADC_CWEN2_CWEN15(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN2_CWEN15_SHIFT)) & SARADC_CWEN2_CWEN15_MASK)

#define SARADC_CWEN2_CWEN16_MASK                 (0x10000U)
#define SARADC_CWEN2_CWEN16_SHIFT                (16U)
#define SARADC_CWEN2_CWEN16_WIDTH                (1U)
#define SARADC_CWEN2_CWEN16(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN2_CWEN16_SHIFT)) & SARADC_CWEN2_CWEN16_MASK)

#define SARADC_CWEN2_CWEN17_MASK                 (0x20000U)
#define SARADC_CWEN2_CWEN17_SHIFT                (17U)
#define SARADC_CWEN2_CWEN17_WIDTH                (1U)
#define SARADC_CWEN2_CWEN17(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN2_CWEN17_SHIFT)) & SARADC_CWEN2_CWEN17_MASK)

#define SARADC_CWEN2_CWEN18_MASK                 (0x40000U)
#define SARADC_CWEN2_CWEN18_SHIFT                (18U)
#define SARADC_CWEN2_CWEN18_WIDTH                (1U)
#define SARADC_CWEN2_CWEN18(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN2_CWEN18_SHIFT)) & SARADC_CWEN2_CWEN18_MASK)

#define SARADC_CWEN2_CWEN19_MASK                 (0x80000U)
#define SARADC_CWEN2_CWEN19_SHIFT                (19U)
#define SARADC_CWEN2_CWEN19_WIDTH                (1U)
#define SARADC_CWEN2_CWEN19(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN2_CWEN19_SHIFT)) & SARADC_CWEN2_CWEN19_MASK)

#define SARADC_CWEN2_CWEN20_MASK                 (0x100000U)
#define SARADC_CWEN2_CWEN20_SHIFT                (20U)
#define SARADC_CWEN2_CWEN20_WIDTH                (1U)
#define SARADC_CWEN2_CWEN20(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN2_CWEN20_SHIFT)) & SARADC_CWEN2_CWEN20_MASK)

#define SARADC_CWEN2_CWEN21_MASK                 (0x200000U)
#define SARADC_CWEN2_CWEN21_SHIFT                (21U)
#define SARADC_CWEN2_CWEN21_WIDTH                (1U)
#define SARADC_CWEN2_CWEN21(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN2_CWEN21_SHIFT)) & SARADC_CWEN2_CWEN21_MASK)

#define SARADC_CWEN2_CWEN22_MASK                 (0x400000U)
#define SARADC_CWEN2_CWEN22_SHIFT                (22U)
#define SARADC_CWEN2_CWEN22_WIDTH                (1U)
#define SARADC_CWEN2_CWEN22(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN2_CWEN22_SHIFT)) & SARADC_CWEN2_CWEN22_MASK)

#define SARADC_CWEN2_CWEN23_MASK                 (0x800000U)
#define SARADC_CWEN2_CWEN23_SHIFT                (23U)
#define SARADC_CWEN2_CWEN23_WIDTH                (1U)
#define SARADC_CWEN2_CWEN23(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN2_CWEN23_SHIFT)) & SARADC_CWEN2_CWEN23_MASK)

#define SARADC_CWEN2_CWEN24_MASK                 (0x1000000U)
#define SARADC_CWEN2_CWEN24_SHIFT                (24U)
#define SARADC_CWEN2_CWEN24_WIDTH                (1U)
#define SARADC_CWEN2_CWEN24(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN2_CWEN24_SHIFT)) & SARADC_CWEN2_CWEN24_MASK)

#define SARADC_CWEN2_CWEN25_MASK                 (0x2000000U)
#define SARADC_CWEN2_CWEN25_SHIFT                (25U)
#define SARADC_CWEN2_CWEN25_WIDTH                (1U)
#define SARADC_CWEN2_CWEN25(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN2_CWEN25_SHIFT)) & SARADC_CWEN2_CWEN25_MASK)

#define SARADC_CWEN2_CWEN26_MASK                 (0x4000000U)
#define SARADC_CWEN2_CWEN26_SHIFT                (26U)
#define SARADC_CWEN2_CWEN26_WIDTH                (1U)
#define SARADC_CWEN2_CWEN26(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN2_CWEN26_SHIFT)) & SARADC_CWEN2_CWEN26_MASK)

#define SARADC_CWEN2_CWEN27_MASK                 (0x8000000U)
#define SARADC_CWEN2_CWEN27_SHIFT                (27U)
#define SARADC_CWEN2_CWEN27_WIDTH                (1U)
#define SARADC_CWEN2_CWEN27(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN2_CWEN27_SHIFT)) & SARADC_CWEN2_CWEN27_MASK)

#define SARADC_CWEN2_CWEN28_MASK                 (0x10000000U)
#define SARADC_CWEN2_CWEN28_SHIFT                (28U)
#define SARADC_CWEN2_CWEN28_WIDTH                (1U)
#define SARADC_CWEN2_CWEN28(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN2_CWEN28_SHIFT)) & SARADC_CWEN2_CWEN28_MASK)

#define SARADC_CWEN2_CWEN29_MASK                 (0x20000000U)
#define SARADC_CWEN2_CWEN29_SHIFT                (29U)
#define SARADC_CWEN2_CWEN29_WIDTH                (1U)
#define SARADC_CWEN2_CWEN29(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN2_CWEN29_SHIFT)) & SARADC_CWEN2_CWEN29_MASK)

#define SARADC_CWEN2_CWEN30_MASK                 (0x40000000U)
#define SARADC_CWEN2_CWEN30_SHIFT                (30U)
#define SARADC_CWEN2_CWEN30_WIDTH                (1U)
#define SARADC_CWEN2_CWEN30(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN2_CWEN30_SHIFT)) & SARADC_CWEN2_CWEN30_MASK)

#define SARADC_CWEN2_CWEN31_MASK                 (0x80000000U)
#define SARADC_CWEN2_CWEN31_SHIFT                (31U)
#define SARADC_CWEN2_CWEN31_WIDTH                (1U)
#define SARADC_CWEN2_CWEN31(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_CWEN2_CWEN31_SHIFT)) & SARADC_CWEN2_CWEN31_MASK)
/*! @} */

/*! @name AWOR0 - Analog Watchdog Out of Range for Type 0 */
/*! @{ */

#define SARADC_AWOR0_AWOR_CH0_MASK               (0x1U)
#define SARADC_AWOR0_AWOR_CH0_SHIFT              (0U)
#define SARADC_AWOR0_AWOR_CH0_WIDTH              (1U)
#define SARADC_AWOR0_AWOR_CH0(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR0_AWOR_CH0_SHIFT)) & SARADC_AWOR0_AWOR_CH0_MASK)

#define SARADC_AWOR0_AWOR_CH1_MASK               (0x2U)
#define SARADC_AWOR0_AWOR_CH1_SHIFT              (1U)
#define SARADC_AWOR0_AWOR_CH1_WIDTH              (1U)
#define SARADC_AWOR0_AWOR_CH1(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR0_AWOR_CH1_SHIFT)) & SARADC_AWOR0_AWOR_CH1_MASK)

#define SARADC_AWOR0_AWOR_CH2_MASK               (0x4U)
#define SARADC_AWOR0_AWOR_CH2_SHIFT              (2U)
#define SARADC_AWOR0_AWOR_CH2_WIDTH              (1U)
#define SARADC_AWOR0_AWOR_CH2(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR0_AWOR_CH2_SHIFT)) & SARADC_AWOR0_AWOR_CH2_MASK)

