zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SARADC.h
#define SARADC_AWOR0_AWOR_CH3_MASK               (0x8U)
#define SARADC_AWOR0_AWOR_CH3_SHIFT              (3U)
#define SARADC_AWOR0_AWOR_CH3_WIDTH              (1U)
#define SARADC_AWOR0_AWOR_CH3(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR0_AWOR_CH3_SHIFT)) & SARADC_AWOR0_AWOR_CH3_MASK)

#define SARADC_AWOR0_AWOR_CH4_MASK               (0x10U)
#define SARADC_AWOR0_AWOR_CH4_SHIFT              (4U)
#define SARADC_AWOR0_AWOR_CH4_WIDTH              (1U)
#define SARADC_AWOR0_AWOR_CH4(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR0_AWOR_CH4_SHIFT)) & SARADC_AWOR0_AWOR_CH4_MASK)

#define SARADC_AWOR0_AWOR_CH5_MASK               (0x20U)
#define SARADC_AWOR0_AWOR_CH5_SHIFT              (5U)
#define SARADC_AWOR0_AWOR_CH5_WIDTH              (1U)
#define SARADC_AWOR0_AWOR_CH5(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR0_AWOR_CH5_SHIFT)) & SARADC_AWOR0_AWOR_CH5_MASK)

#define SARADC_AWOR0_AWOR_CH6_MASK               (0x40U)
#define SARADC_AWOR0_AWOR_CH6_SHIFT              (6U)
#define SARADC_AWOR0_AWOR_CH6_WIDTH              (1U)
#define SARADC_AWOR0_AWOR_CH6(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR0_AWOR_CH6_SHIFT)) & SARADC_AWOR0_AWOR_CH6_MASK)

#define SARADC_AWOR0_AWOR_CH7_MASK               (0x80U)
#define SARADC_AWOR0_AWOR_CH7_SHIFT              (7U)
#define SARADC_AWOR0_AWOR_CH7_WIDTH              (1U)
#define SARADC_AWOR0_AWOR_CH7(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR0_AWOR_CH7_SHIFT)) & SARADC_AWOR0_AWOR_CH7_MASK)

#define SARADC_AWOR0_AWOR_CH8_MASK               (0x100U)
#define SARADC_AWOR0_AWOR_CH8_SHIFT              (8U)
#define SARADC_AWOR0_AWOR_CH8_WIDTH              (1U)
#define SARADC_AWOR0_AWOR_CH8(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR0_AWOR_CH8_SHIFT)) & SARADC_AWOR0_AWOR_CH8_MASK)

#define SARADC_AWOR0_AWOR_CH9_MASK               (0x200U)
#define SARADC_AWOR0_AWOR_CH9_SHIFT              (9U)
#define SARADC_AWOR0_AWOR_CH9_WIDTH              (1U)
#define SARADC_AWOR0_AWOR_CH9(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR0_AWOR_CH9_SHIFT)) & SARADC_AWOR0_AWOR_CH9_MASK)

#define SARADC_AWOR0_AWOR_CH10_MASK              (0x400U)
#define SARADC_AWOR0_AWOR_CH10_SHIFT             (10U)
#define SARADC_AWOR0_AWOR_CH10_WIDTH             (1U)
#define SARADC_AWOR0_AWOR_CH10(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR0_AWOR_CH10_SHIFT)) & SARADC_AWOR0_AWOR_CH10_MASK)

#define SARADC_AWOR0_AWOR_CH11_MASK              (0x800U)
#define SARADC_AWOR0_AWOR_CH11_SHIFT             (11U)
#define SARADC_AWOR0_AWOR_CH11_WIDTH             (1U)
#define SARADC_AWOR0_AWOR_CH11(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR0_AWOR_CH11_SHIFT)) & SARADC_AWOR0_AWOR_CH11_MASK)

#define SARADC_AWOR0_AWOR_CH12_MASK              (0x1000U)
#define SARADC_AWOR0_AWOR_CH12_SHIFT             (12U)
#define SARADC_AWOR0_AWOR_CH12_WIDTH             (1U)
#define SARADC_AWOR0_AWOR_CH12(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR0_AWOR_CH12_SHIFT)) & SARADC_AWOR0_AWOR_CH12_MASK)

#define SARADC_AWOR0_AWOR_CH13_MASK              (0x2000U)
#define SARADC_AWOR0_AWOR_CH13_SHIFT             (13U)
#define SARADC_AWOR0_AWOR_CH13_WIDTH             (1U)
#define SARADC_AWOR0_AWOR_CH13(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR0_AWOR_CH13_SHIFT)) & SARADC_AWOR0_AWOR_CH13_MASK)

#define SARADC_AWOR0_AWOR_CH14_MASK              (0x4000U)
#define SARADC_AWOR0_AWOR_CH14_SHIFT             (14U)
#define SARADC_AWOR0_AWOR_CH14_WIDTH             (1U)
#define SARADC_AWOR0_AWOR_CH14(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR0_AWOR_CH14_SHIFT)) & SARADC_AWOR0_AWOR_CH14_MASK)

#define SARADC_AWOR0_AWOR_CH15_MASK              (0x8000U)
#define SARADC_AWOR0_AWOR_CH15_SHIFT             (15U)
#define SARADC_AWOR0_AWOR_CH15_WIDTH             (1U)
#define SARADC_AWOR0_AWOR_CH15(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR0_AWOR_CH15_SHIFT)) & SARADC_AWOR0_AWOR_CH15_MASK)

#define SARADC_AWOR0_AWOR_CH16_MASK              (0x10000U)
#define SARADC_AWOR0_AWOR_CH16_SHIFT             (16U)
#define SARADC_AWOR0_AWOR_CH16_WIDTH             (1U)
#define SARADC_AWOR0_AWOR_CH16(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR0_AWOR_CH16_SHIFT)) & SARADC_AWOR0_AWOR_CH16_MASK)

#define SARADC_AWOR0_AWOR_CH17_MASK              (0x20000U)
#define SARADC_AWOR0_AWOR_CH17_SHIFT             (17U)
#define SARADC_AWOR0_AWOR_CH17_WIDTH             (1U)
#define SARADC_AWOR0_AWOR_CH17(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR0_AWOR_CH17_SHIFT)) & SARADC_AWOR0_AWOR_CH17_MASK)

#define SARADC_AWOR0_AWOR_CH18_MASK              (0x40000U)
#define SARADC_AWOR0_AWOR_CH18_SHIFT             (18U)
#define SARADC_AWOR0_AWOR_CH18_WIDTH             (1U)
#define SARADC_AWOR0_AWOR_CH18(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR0_AWOR_CH18_SHIFT)) & SARADC_AWOR0_AWOR_CH18_MASK)

#define SARADC_AWOR0_AWOR_CH19_MASK              (0x80000U)
#define SARADC_AWOR0_AWOR_CH19_SHIFT             (19U)
#define SARADC_AWOR0_AWOR_CH19_WIDTH             (1U)
#define SARADC_AWOR0_AWOR_CH19(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR0_AWOR_CH19_SHIFT)) & SARADC_AWOR0_AWOR_CH19_MASK)

#define SARADC_AWOR0_AWOR_CH20_MASK              (0x100000U)
#define SARADC_AWOR0_AWOR_CH20_SHIFT             (20U)
#define SARADC_AWOR0_AWOR_CH20_WIDTH             (1U)
#define SARADC_AWOR0_AWOR_CH20(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR0_AWOR_CH20_SHIFT)) & SARADC_AWOR0_AWOR_CH20_MASK)

#define SARADC_AWOR0_AWOR_CH21_MASK              (0x200000U)
#define SARADC_AWOR0_AWOR_CH21_SHIFT             (21U)
#define SARADC_AWOR0_AWOR_CH21_WIDTH             (1U)
#define SARADC_AWOR0_AWOR_CH21(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR0_AWOR_CH21_SHIFT)) & SARADC_AWOR0_AWOR_CH21_MASK)

#define SARADC_AWOR0_AWOR_CH22_MASK              (0x400000U)
#define SARADC_AWOR0_AWOR_CH22_SHIFT             (22U)
#define SARADC_AWOR0_AWOR_CH22_WIDTH             (1U)
#define SARADC_AWOR0_AWOR_CH22(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR0_AWOR_CH22_SHIFT)) & SARADC_AWOR0_AWOR_CH22_MASK)

#define SARADC_AWOR0_AWOR_CH23_MASK              (0x800000U)
#define SARADC_AWOR0_AWOR_CH23_SHIFT             (23U)
#define SARADC_AWOR0_AWOR_CH23_WIDTH             (1U)
#define SARADC_AWOR0_AWOR_CH23(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR0_AWOR_CH23_SHIFT)) & SARADC_AWOR0_AWOR_CH23_MASK)

#define SARADC_AWOR0_AWOR_CH24_MASK              (0x1000000U)
#define SARADC_AWOR0_AWOR_CH24_SHIFT             (24U)
#define SARADC_AWOR0_AWOR_CH24_WIDTH             (1U)
#define SARADC_AWOR0_AWOR_CH24(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR0_AWOR_CH24_SHIFT)) & SARADC_AWOR0_AWOR_CH24_MASK)

#define SARADC_AWOR0_AWOR_CH25_MASK              (0x2000000U)
#define SARADC_AWOR0_AWOR_CH25_SHIFT             (25U)
#define SARADC_AWOR0_AWOR_CH25_WIDTH             (1U)
#define SARADC_AWOR0_AWOR_CH25(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR0_AWOR_CH25_SHIFT)) & SARADC_AWOR0_AWOR_CH25_MASK)

#define SARADC_AWOR0_AWOR_CH26_MASK              (0x4000000U)
#define SARADC_AWOR0_AWOR_CH26_SHIFT             (26U)
#define SARADC_AWOR0_AWOR_CH26_WIDTH             (1U)
#define SARADC_AWOR0_AWOR_CH26(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR0_AWOR_CH26_SHIFT)) & SARADC_AWOR0_AWOR_CH26_MASK)

#define SARADC_AWOR0_AWOR_CH27_MASK              (0x8000000U)
#define SARADC_AWOR0_AWOR_CH27_SHIFT             (27U)
#define SARADC_AWOR0_AWOR_CH27_WIDTH             (1U)
#define SARADC_AWOR0_AWOR_CH27(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR0_AWOR_CH27_SHIFT)) & SARADC_AWOR0_AWOR_CH27_MASK)

#define SARADC_AWOR0_AWOR_CH28_MASK              (0x10000000U)
#define SARADC_AWOR0_AWOR_CH28_SHIFT             (28U)
#define SARADC_AWOR0_AWOR_CH28_WIDTH             (1U)
#define SARADC_AWOR0_AWOR_CH28(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR0_AWOR_CH28_SHIFT)) & SARADC_AWOR0_AWOR_CH28_MASK)

#define SARADC_AWOR0_AWOR_CH29_MASK              (0x20000000U)
#define SARADC_AWOR0_AWOR_CH29_SHIFT             (29U)
#define SARADC_AWOR0_AWOR_CH29_WIDTH             (1U)
#define SARADC_AWOR0_AWOR_CH29(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR0_AWOR_CH29_SHIFT)) & SARADC_AWOR0_AWOR_CH29_MASK)

