zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SARADC.h
#define SARADC_AWOR0_AWOR_CH30_MASK              (0x40000000U)
#define SARADC_AWOR0_AWOR_CH30_SHIFT             (30U)
#define SARADC_AWOR0_AWOR_CH30_WIDTH             (1U)
#define SARADC_AWOR0_AWOR_CH30(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR0_AWOR_CH30_SHIFT)) & SARADC_AWOR0_AWOR_CH30_MASK)

#define SARADC_AWOR0_AWOR_CH31_MASK              (0x80000000U)
#define SARADC_AWOR0_AWOR_CH31_SHIFT             (31U)
#define SARADC_AWOR0_AWOR_CH31_WIDTH             (1U)
#define SARADC_AWOR0_AWOR_CH31(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR0_AWOR_CH31_SHIFT)) & SARADC_AWOR0_AWOR_CH31_MASK)
/*! @} */

/*! @name AWOR1 - Analog Watchdog Out of Range for Type 1 */
/*! @{ */

#define SARADC_AWOR1_AWOR_CH0_MASK               (0x1U)
#define SARADC_AWOR1_AWOR_CH0_SHIFT              (0U)
#define SARADC_AWOR1_AWOR_CH0_WIDTH              (1U)
#define SARADC_AWOR1_AWOR_CH0(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR1_AWOR_CH0_SHIFT)) & SARADC_AWOR1_AWOR_CH0_MASK)

#define SARADC_AWOR1_AWOR_CH1_MASK               (0x2U)
#define SARADC_AWOR1_AWOR_CH1_SHIFT              (1U)
#define SARADC_AWOR1_AWOR_CH1_WIDTH              (1U)
#define SARADC_AWOR1_AWOR_CH1(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR1_AWOR_CH1_SHIFT)) & SARADC_AWOR1_AWOR_CH1_MASK)

#define SARADC_AWOR1_AWOR_CH2_MASK               (0x4U)
#define SARADC_AWOR1_AWOR_CH2_SHIFT              (2U)
#define SARADC_AWOR1_AWOR_CH2_WIDTH              (1U)
#define SARADC_AWOR1_AWOR_CH2(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR1_AWOR_CH2_SHIFT)) & SARADC_AWOR1_AWOR_CH2_MASK)

#define SARADC_AWOR1_AWOR_CH3_MASK               (0x8U)
#define SARADC_AWOR1_AWOR_CH3_SHIFT              (3U)
#define SARADC_AWOR1_AWOR_CH3_WIDTH              (1U)
#define SARADC_AWOR1_AWOR_CH3(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR1_AWOR_CH3_SHIFT)) & SARADC_AWOR1_AWOR_CH3_MASK)

#define SARADC_AWOR1_AWOR_CH4_MASK               (0x10U)
#define SARADC_AWOR1_AWOR_CH4_SHIFT              (4U)
#define SARADC_AWOR1_AWOR_CH4_WIDTH              (1U)
#define SARADC_AWOR1_AWOR_CH4(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR1_AWOR_CH4_SHIFT)) & SARADC_AWOR1_AWOR_CH4_MASK)

#define SARADC_AWOR1_AWOR_CH5_MASK               (0x20U)
#define SARADC_AWOR1_AWOR_CH5_SHIFT              (5U)
#define SARADC_AWOR1_AWOR_CH5_WIDTH              (1U)
#define SARADC_AWOR1_AWOR_CH5(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR1_AWOR_CH5_SHIFT)) & SARADC_AWOR1_AWOR_CH5_MASK)

#define SARADC_AWOR1_AWOR_CH6_MASK               (0x40U)
#define SARADC_AWOR1_AWOR_CH6_SHIFT              (6U)
#define SARADC_AWOR1_AWOR_CH6_WIDTH              (1U)
#define SARADC_AWOR1_AWOR_CH6(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR1_AWOR_CH6_SHIFT)) & SARADC_AWOR1_AWOR_CH6_MASK)

#define SARADC_AWOR1_AWOR_CH7_MASK               (0x80U)
#define SARADC_AWOR1_AWOR_CH7_SHIFT              (7U)
#define SARADC_AWOR1_AWOR_CH7_WIDTH              (1U)
#define SARADC_AWOR1_AWOR_CH7(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR1_AWOR_CH7_SHIFT)) & SARADC_AWOR1_AWOR_CH7_MASK)

#define SARADC_AWOR1_AWOR_CH8_MASK               (0x100U)
#define SARADC_AWOR1_AWOR_CH8_SHIFT              (8U)
#define SARADC_AWOR1_AWOR_CH8_WIDTH              (1U)
#define SARADC_AWOR1_AWOR_CH8(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR1_AWOR_CH8_SHIFT)) & SARADC_AWOR1_AWOR_CH8_MASK)

#define SARADC_AWOR1_AWOR_CH9_MASK               (0x200U)
#define SARADC_AWOR1_AWOR_CH9_SHIFT              (9U)
#define SARADC_AWOR1_AWOR_CH9_WIDTH              (1U)
#define SARADC_AWOR1_AWOR_CH9(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR1_AWOR_CH9_SHIFT)) & SARADC_AWOR1_AWOR_CH9_MASK)

#define SARADC_AWOR1_AWOR_CH10_MASK              (0x400U)
#define SARADC_AWOR1_AWOR_CH10_SHIFT             (10U)
#define SARADC_AWOR1_AWOR_CH10_WIDTH             (1U)
#define SARADC_AWOR1_AWOR_CH10(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR1_AWOR_CH10_SHIFT)) & SARADC_AWOR1_AWOR_CH10_MASK)

#define SARADC_AWOR1_AWOR_CH16_MASK              (0x10000U)
#define SARADC_AWOR1_AWOR_CH16_SHIFT             (16U)
#define SARADC_AWOR1_AWOR_CH16_WIDTH             (1U)
#define SARADC_AWOR1_AWOR_CH16(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR1_AWOR_CH16_SHIFT)) & SARADC_AWOR1_AWOR_CH16_MASK)

#define SARADC_AWOR1_AWOR_CH17_MASK              (0x20000U)
#define SARADC_AWOR1_AWOR_CH17_SHIFT             (17U)
#define SARADC_AWOR1_AWOR_CH17_WIDTH             (1U)
#define SARADC_AWOR1_AWOR_CH17(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR1_AWOR_CH17_SHIFT)) & SARADC_AWOR1_AWOR_CH17_MASK)

#define SARADC_AWOR1_AWOR_CH18_MASK              (0x40000U)
#define SARADC_AWOR1_AWOR_CH18_SHIFT             (18U)
#define SARADC_AWOR1_AWOR_CH18_WIDTH             (1U)
#define SARADC_AWOR1_AWOR_CH18(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR1_AWOR_CH18_SHIFT)) & SARADC_AWOR1_AWOR_CH18_MASK)

#define SARADC_AWOR1_AWOR_CH19_MASK              (0x80000U)
#define SARADC_AWOR1_AWOR_CH19_SHIFT             (19U)
#define SARADC_AWOR1_AWOR_CH19_WIDTH             (1U)
#define SARADC_AWOR1_AWOR_CH19(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR1_AWOR_CH19_SHIFT)) & SARADC_AWOR1_AWOR_CH19_MASK)

#define SARADC_AWOR1_AWOR_CH20_MASK              (0x100000U)
#define SARADC_AWOR1_AWOR_CH20_SHIFT             (20U)
#define SARADC_AWOR1_AWOR_CH20_WIDTH             (1U)
#define SARADC_AWOR1_AWOR_CH20(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR1_AWOR_CH20_SHIFT)) & SARADC_AWOR1_AWOR_CH20_MASK)

#define SARADC_AWOR1_AWOR_CH21_MASK              (0x200000U)
#define SARADC_AWOR1_AWOR_CH21_SHIFT             (21U)
#define SARADC_AWOR1_AWOR_CH21_WIDTH             (1U)
#define SARADC_AWOR1_AWOR_CH21(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR1_AWOR_CH21_SHIFT)) & SARADC_AWOR1_AWOR_CH21_MASK)

#define SARADC_AWOR1_AWOR_CH22_MASK              (0x400000U)
#define SARADC_AWOR1_AWOR_CH22_SHIFT             (22U)
#define SARADC_AWOR1_AWOR_CH22_WIDTH             (1U)
#define SARADC_AWOR1_AWOR_CH22(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR1_AWOR_CH22_SHIFT)) & SARADC_AWOR1_AWOR_CH22_MASK)

