zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SARADC.h
#define SARADC_AWOR2_AWOR_CH17_MASK              (0x20000U)
#define SARADC_AWOR2_AWOR_CH17_SHIFT             (17U)
#define SARADC_AWOR2_AWOR_CH17_WIDTH             (1U)
#define SARADC_AWOR2_AWOR_CH17(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR2_AWOR_CH17_SHIFT)) & SARADC_AWOR2_AWOR_CH17_MASK)

#define SARADC_AWOR2_AWOR_CH18_MASK              (0x40000U)
#define SARADC_AWOR2_AWOR_CH18_SHIFT             (18U)
#define SARADC_AWOR2_AWOR_CH18_WIDTH             (1U)
#define SARADC_AWOR2_AWOR_CH18(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR2_AWOR_CH18_SHIFT)) & SARADC_AWOR2_AWOR_CH18_MASK)

#define SARADC_AWOR2_AWOR_CH19_MASK              (0x80000U)
#define SARADC_AWOR2_AWOR_CH19_SHIFT             (19U)
#define SARADC_AWOR2_AWOR_CH19_WIDTH             (1U)
#define SARADC_AWOR2_AWOR_CH19(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR2_AWOR_CH19_SHIFT)) & SARADC_AWOR2_AWOR_CH19_MASK)

#define SARADC_AWOR2_AWOR_CH20_MASK              (0x100000U)
#define SARADC_AWOR2_AWOR_CH20_SHIFT             (20U)
#define SARADC_AWOR2_AWOR_CH20_WIDTH             (1U)
#define SARADC_AWOR2_AWOR_CH20(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR2_AWOR_CH20_SHIFT)) & SARADC_AWOR2_AWOR_CH20_MASK)

#define SARADC_AWOR2_AWOR_CH21_MASK              (0x200000U)
#define SARADC_AWOR2_AWOR_CH21_SHIFT             (21U)
#define SARADC_AWOR2_AWOR_CH21_WIDTH             (1U)
#define SARADC_AWOR2_AWOR_CH21(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR2_AWOR_CH21_SHIFT)) & SARADC_AWOR2_AWOR_CH21_MASK)

#define SARADC_AWOR2_AWOR_CH22_MASK              (0x400000U)
#define SARADC_AWOR2_AWOR_CH22_SHIFT             (22U)
#define SARADC_AWOR2_AWOR_CH22_WIDTH             (1U)
#define SARADC_AWOR2_AWOR_CH22(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR2_AWOR_CH22_SHIFT)) & SARADC_AWOR2_AWOR_CH22_MASK)

#define SARADC_AWOR2_AWOR_CH23_MASK              (0x800000U)
#define SARADC_AWOR2_AWOR_CH23_SHIFT             (23U)
#define SARADC_AWOR2_AWOR_CH23_WIDTH             (1U)
#define SARADC_AWOR2_AWOR_CH23(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR2_AWOR_CH23_SHIFT)) & SARADC_AWOR2_AWOR_CH23_MASK)

#define SARADC_AWOR2_AWOR_CH24_MASK              (0x1000000U)
#define SARADC_AWOR2_AWOR_CH24_SHIFT             (24U)
#define SARADC_AWOR2_AWOR_CH24_WIDTH             (1U)
#define SARADC_AWOR2_AWOR_CH24(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR2_AWOR_CH24_SHIFT)) & SARADC_AWOR2_AWOR_CH24_MASK)

#define SARADC_AWOR2_AWOR_CH25_MASK              (0x2000000U)
#define SARADC_AWOR2_AWOR_CH25_SHIFT             (25U)
#define SARADC_AWOR2_AWOR_CH25_WIDTH             (1U)
#define SARADC_AWOR2_AWOR_CH25(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR2_AWOR_CH25_SHIFT)) & SARADC_AWOR2_AWOR_CH25_MASK)

#define SARADC_AWOR2_AWOR_CH26_MASK              (0x4000000U)
#define SARADC_AWOR2_AWOR_CH26_SHIFT             (26U)
#define SARADC_AWOR2_AWOR_CH26_WIDTH             (1U)
#define SARADC_AWOR2_AWOR_CH26(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR2_AWOR_CH26_SHIFT)) & SARADC_AWOR2_AWOR_CH26_MASK)

#define SARADC_AWOR2_AWOR_CH27_MASK              (0x8000000U)
#define SARADC_AWOR2_AWOR_CH27_SHIFT             (27U)
#define SARADC_AWOR2_AWOR_CH27_WIDTH             (1U)
#define SARADC_AWOR2_AWOR_CH27(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR2_AWOR_CH27_SHIFT)) & SARADC_AWOR2_AWOR_CH27_MASK)

#define SARADC_AWOR2_AWOR_CH28_MASK              (0x10000000U)
#define SARADC_AWOR2_AWOR_CH28_SHIFT             (28U)
#define SARADC_AWOR2_AWOR_CH28_WIDTH             (1U)
#define SARADC_AWOR2_AWOR_CH28(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR2_AWOR_CH28_SHIFT)) & SARADC_AWOR2_AWOR_CH28_MASK)

#define SARADC_AWOR2_AWOR_CH29_MASK              (0x20000000U)
#define SARADC_AWOR2_AWOR_CH29_SHIFT             (29U)
#define SARADC_AWOR2_AWOR_CH29_WIDTH             (1U)
#define SARADC_AWOR2_AWOR_CH29(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR2_AWOR_CH29_SHIFT)) & SARADC_AWOR2_AWOR_CH29_MASK)

#define SARADC_AWOR2_AWOR_CH30_MASK              (0x40000000U)
#define SARADC_AWOR2_AWOR_CH30_SHIFT             (30U)
#define SARADC_AWOR2_AWOR_CH30_WIDTH             (1U)
#define SARADC_AWOR2_AWOR_CH30(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR2_AWOR_CH30_SHIFT)) & SARADC_AWOR2_AWOR_CH30_MASK)

#define SARADC_AWOR2_AWOR_CH31_MASK              (0x80000000U)
#define SARADC_AWOR2_AWOR_CH31_SHIFT             (31U)
#define SARADC_AWOR2_AWOR_CH31_WIDTH             (1U)
#define SARADC_AWOR2_AWOR_CH31(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_AWOR2_AWOR_CH31_SHIFT)) & SARADC_AWOR2_AWOR_CH31_MASK)
/*! @} */

/*! @name STC1 - Self-Test Configuration 1 */
/*! @{ */

#define SARADC_STC1_AWDEVBG_MASK                 (0x1U)
#define SARADC_STC1_AWDEVBG_SHIFT                (0U)
#define SARADC_STC1_AWDEVBG_WIDTH                (1U)
#define SARADC_STC1_AWDEVBG(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_STC1_AWDEVBG_SHIFT)) & SARADC_STC1_AWDEVBG_MASK)

#define SARADC_STC1_AWDEVDD_MASK                 (0x2U)
#define SARADC_STC1_AWDEVDD_SHIFT                (1U)
#define SARADC_STC1_AWDEVDD_WIDTH                (1U)
#define SARADC_STC1_AWDEVDD(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_STC1_AWDEVDD_SHIFT)) & SARADC_STC1_AWDEVDD_MASK)

#define SARADC_STC1_AWDEVRHL_MASK                (0x4U)
#define SARADC_STC1_AWDEVRHL_SHIFT               (2U)
#define SARADC_STC1_AWDEVRHL_WIDTH               (1U)
#define SARADC_STC1_AWDEVRHL(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_STC1_AWDEVRHL_SHIFT)) & SARADC_STC1_AWDEVRHL_MASK)

#define SARADC_STC1_WDTESPLY_MASK                (0x8U)
#define SARADC_STC1_WDTESPLY_SHIFT               (3U)
#define SARADC_STC1_WDTESPLY_WIDTH               (1U)
#define SARADC_STC1_WDTESPLY(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_STC1_WDTESPLY_SHIFT)) & SARADC_STC1_WDTESPLY_MASK)

#define SARADC_STC1_AWDEOFS_MASK                 (0x100U)
#define SARADC_STC1_AWDEOFS_SHIFT                (8U)
#define SARADC_STC1_AWDEOFS_WIDTH                (1U)
#define SARADC_STC1_AWDEOFS(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_STC1_AWDEOFS_SHIFT)) & SARADC_STC1_AWDEOFS_MASK)

