zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SARADC.h
#define SARADC_STC1_WDTEOFS_MASK                 (0x200U)
#define SARADC_STC1_WDTEOFS_SHIFT                (9U)
#define SARADC_STC1_WDTEOFS_WIDTH                (1U)
#define SARADC_STC1_WDTEOFS(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_STC1_WDTEOFS_SHIFT)) & SARADC_STC1_WDTEOFS_MASK)

#define SARADC_STC1_AWDECAP_MASK                 (0x10000U)
#define SARADC_STC1_AWDECAP_SHIFT                (16U)
#define SARADC_STC1_AWDECAP_WIDTH                (1U)
#define SARADC_STC1_AWDECAP(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_STC1_AWDECAP_SHIFT)) & SARADC_STC1_AWDECAP_MASK)

#define SARADC_STC1_WDTECAP_MASK                 (0x20000U)
#define SARADC_STC1_WDTECAP_SHIFT                (17U)
#define SARADC_STC1_WDTECAP_WIDTH                (1U)
#define SARADC_STC1_WDTECAP(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_STC1_WDTECAP_SHIFT)) & SARADC_STC1_WDTECAP_MASK)
/*! @} */

/*! @name STC2 - Self-Test Configuration 2 */
/*! @{ */

#define SARADC_STC2_FMA_S_MASK                   (0x1U)
#define SARADC_STC2_FMA_S_SHIFT                  (0U)
#define SARADC_STC2_FMA_S_WIDTH                  (1U)
#define SARADC_STC2_FMA_S(x)                     (((uint32_t)(((uint32_t)(x)) << SARADC_STC2_FMA_S_SHIFT)) & SARADC_STC2_FMA_S_MASK)

#define SARADC_STC2_FMA_OFS_MASK                 (0x2U)
#define SARADC_STC2_FMA_OFS_SHIFT                (1U)
#define SARADC_STC2_FMA_OFS_WIDTH                (1U)
#define SARADC_STC2_FMA_OFS(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_STC2_FMA_OFS_SHIFT)) & SARADC_STC2_FMA_OFS_MASK)

#define SARADC_STC2_FMA_CAP_MASK                 (0x4U)
#define SARADC_STC2_FMA_CAP_SHIFT                (2U)
#define SARADC_STC2_FMA_CAP_WIDTH                (1U)
#define SARADC_STC2_FMA_CAP(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_STC2_FMA_CAP_SHIFT)) & SARADC_STC2_FMA_CAP_MASK)

#define SARADC_STC2_FMAWDTER_MASK                (0x8U)
#define SARADC_STC2_FMAWDTER_SHIFT               (3U)
#define SARADC_STC2_FMAWDTER_WIDTH               (1U)
#define SARADC_STC2_FMAWDTER(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_STC2_FMAWDTER_SHIFT)) & SARADC_STC2_FMAWDTER_MASK)

#define SARADC_STC2_FMAWDSER_MASK                (0x10U)
#define SARADC_STC2_FMAWDSER_SHIFT               (4U)
#define SARADC_STC2_FMAWDSER_WIDTH               (1U)
#define SARADC_STC2_FMAWDSER(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_STC2_FMAWDSER_SHIFT)) & SARADC_STC2_FMAWDSER_MASK)

#define SARADC_STC2_ST_EN_MASK                   (0x20U)
#define SARADC_STC2_ST_EN_SHIFT                  (5U)
#define SARADC_STC2_ST_EN_WIDTH                  (1U)
#define SARADC_STC2_ST_EN(x)                     (((uint32_t)(((uint32_t)(x)) << SARADC_STC2_ST_EN_SHIFT)) & SARADC_STC2_ST_EN_MASK)

#define SARADC_STC2_MSKVBGER_MASK                (0x40U)
#define SARADC_STC2_MSKVBGER_SHIFT               (6U)
#define SARADC_STC2_MSKVBGER_WIDTH               (1U)
#define SARADC_STC2_MSKVBGER(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_STC2_MSKVBGER_SHIFT)) & SARADC_STC2_MSKVBGER_MASK)

#define SARADC_STC2_MSKVDDER_MASK                (0x80U)
#define SARADC_STC2_MSKVDDER_SHIFT               (7U)
#define SARADC_STC2_MSKVDDER_WIDTH               (1U)
#define SARADC_STC2_MSKVDDER(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_STC2_MSKVDDER_SHIFT)) & SARADC_STC2_MSKVDDER_MASK)

#define SARADC_STC2_MSKVRERR_MASK                (0x100U)
#define SARADC_STC2_MSKVRERR_SHIFT               (8U)
#define SARADC_STC2_MSKVRERR_WIDTH               (1U)
#define SARADC_STC2_MSKVRERR(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_STC2_MSKVRERR_SHIFT)) & SARADC_STC2_MSKVRERR_MASK)

#define SARADC_STC2_MSKOFSER_MASK                (0x200U)
#define SARADC_STC2_MSKOFSER_SHIFT               (9U)
#define SARADC_STC2_MSKOFSER_WIDTH               (1U)
#define SARADC_STC2_MSKOFSER(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_STC2_MSKOFSER_SHIFT)) & SARADC_STC2_MSKOFSER_MASK)

#define SARADC_STC2_MSKCAPER_MASK                (0x400U)
#define SARADC_STC2_MSKCAPER_SHIFT               (10U)
#define SARADC_STC2_MSKCAPER_WIDTH               (1U)
#define SARADC_STC2_MSKCAPER(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_STC2_MSKCAPER_SHIFT)) & SARADC_STC2_MSKCAPER_MASK)

#define SARADC_STC2_MSKEOA_S_MASK                (0x800U)
#define SARADC_STC2_MSKEOA_S_SHIFT               (11U)
#define SARADC_STC2_MSKEOA_S_WIDTH               (1U)
#define SARADC_STC2_MSKEOA_S(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_STC2_MSKEOA_S_SHIFT)) & SARADC_STC2_MSKEOA_S_MASK)

#define SARADC_STC2_MSKEOA_O_MASK                (0x1000U)
#define SARADC_STC2_MSKEOA_O_SHIFT               (12U)
#define SARADC_STC2_MSKEOA_O_WIDTH               (1U)
#define SARADC_STC2_MSKEOA_O(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_STC2_MSKEOA_O_SHIFT)) & SARADC_STC2_MSKEOA_O_MASK)

#define SARADC_STC2_MSKEOA_C_MASK                (0x2000U)
#define SARADC_STC2_MSKEOA_C_SHIFT               (13U)
#define SARADC_STC2_MSKEOA_C_WIDTH               (1U)
#define SARADC_STC2_MSKEOA_C(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_STC2_MSKEOA_C_SHIFT)) & SARADC_STC2_MSKEOA_C_MASK)

#define SARADC_STC2_MSKEOC_S_MASK                (0x4000U)
#define SARADC_STC2_MSKEOC_S_SHIFT               (14U)
#define SARADC_STC2_MSKEOC_S_WIDTH               (1U)
#define SARADC_STC2_MSKEOC_S(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_STC2_MSKEOC_S_SHIFT)) & SARADC_STC2_MSKEOC_S_MASK)

#define SARADC_STC2_MSKEOC_O_MASK                (0x8000U)
#define SARADC_STC2_MSKEOC_O_SHIFT               (15U)
#define SARADC_STC2_MSKEOC_O_WIDTH               (1U)
#define SARADC_STC2_MSKEOC_O(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_STC2_MSKEOC_O_SHIFT)) & SARADC_STC2_MSKEOC_O_MASK)

#define SARADC_STC2_MSKEOC_C_MASK                (0x10000U)
#define SARADC_STC2_MSKEOC_C_SHIFT               (16U)
#define SARADC_STC2_MSKEOC_C_WIDTH               (1U)
#define SARADC_STC2_MSKEOC_C(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_STC2_MSKEOC_C_SHIFT)) & SARADC_STC2_MSKEOC_C_MASK)

#define SARADC_STC2_MSKWDERR_MASK                (0x20000U)
#define SARADC_STC2_MSKWDERR_SHIFT               (17U)
#define SARADC_STC2_MSKWDERR_WIDTH               (1U)
#define SARADC_STC2_MSKWDERR(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_STC2_MSKWDERR_SHIFT)) & SARADC_STC2_MSKWDERR_MASK)

#define SARADC_STC2_SERR_MASK                    (0x40000U)
#define SARADC_STC2_SERR_SHIFT                   (18U)
#define SARADC_STC2_SERR_WIDTH                   (1U)
#define SARADC_STC2_SERR(x)                      (((uint32_t)(((uint32_t)(x)) << SARADC_STC2_SERR_SHIFT)) & SARADC_STC2_SERR_MASK)

#define SARADC_STC2_ALG_MASK                     (0xC0000000U)
#define SARADC_STC2_ALG_SHIFT                    (30U)
#define SARADC_STC2_ALG_WIDTH                    (2U)
#define SARADC_STC2_ALG(x)                       (((uint32_t)(((uint32_t)(x)) << SARADC_STC2_ALG_SHIFT)) & SARADC_STC2_ALG_MASK)
/*! @} */

