zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SARADC.h
/*! @name STBR - Self-Test Baud Rate */
/*! @{ */

#define SARADC_STBR_BR_MASK                      (0xFFU)
#define SARADC_STBR_BR_SHIFT                     (0U)
#define SARADC_STBR_BR_WIDTH                     (8U)
#define SARADC_STBR_BR(x)                        (((uint32_t)(((uint32_t)(x)) << SARADC_STBR_BR_SHIFT)) & SARADC_STBR_BR_MASK)

#define SARADC_STBR_WDT_MASK                     (0x70000U)
#define SARADC_STBR_WDT_SHIFT                    (16U)
#define SARADC_STBR_WDT_WIDTH                    (3U)
#define SARADC_STBR_WDT(x)                       (((uint32_t)(((uint32_t)(x)) << SARADC_STBR_WDT_SHIFT)) & SARADC_STBR_WDT_MASK)
/*! @} */

/*! @name STS1_P - Self-Test Status 1 for P-SARADC */
/*! @{ */

#define SARADC_STS1_P_VRNUMBER_MASK              (0x7U)
#define SARADC_STS1_P_VRNUMBER_SHIFT             (0U)
#define SARADC_STS1_P_VRNUMBER_WIDTH             (3U)
#define SARADC_STS1_P_VRNUMBER(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_STS1_P_VRNUMBER_SHIFT)) & SARADC_STS1_P_VRNUMBER_MASK)

#define SARADC_STS1_P_ERRVBG_MASK                (0x8U)
#define SARADC_STS1_P_ERRVBG_SHIFT               (3U)
#define SARADC_STS1_P_ERRVBG_WIDTH               (1U)
#define SARADC_STS1_P_ERRVBG(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_STS1_P_ERRVBG_SHIFT)) & SARADC_STS1_P_ERRVBG_MASK)

#define SARADC_STS1_P_ERRVDD_MASK                (0x10U)
#define SARADC_STS1_P_ERRVDD_SHIFT               (4U)
#define SARADC_STS1_P_ERRVDD_WIDTH               (1U)
#define SARADC_STS1_P_ERRVDD(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_STS1_P_ERRVDD_SHIFT)) & SARADC_STS1_P_ERRVDD_MASK)

#define SARADC_STS1_P_ERRVRTST_MASK              (0x20U)
#define SARADC_STS1_P_ERRVRTST_SHIFT             (5U)
#define SARADC_STS1_P_ERRVRTST_WIDTH             (1U)
#define SARADC_STS1_P_ERRVRTST(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_STS1_P_ERRVRTST_SHIFT)) & SARADC_STS1_P_ERRVRTST_MASK)

#define SARADC_STS1_P_ERROFS_MASK                (0x40U)
#define SARADC_STS1_P_ERROFS_SHIFT               (6U)
#define SARADC_STS1_P_ERROFS_WIDTH               (1U)
#define SARADC_STS1_P_ERROFS(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_STS1_P_ERROFS_SHIFT)) & SARADC_STS1_P_ERROFS_MASK)

#define SARADC_STS1_P_ERRCAP_MASK                (0x80U)
#define SARADC_STS1_P_ERRCAP_SHIFT               (7U)
#define SARADC_STS1_P_ERRCAP_WIDTH               (1U)
#define SARADC_STS1_P_ERRCAP(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_STS1_P_ERRCAP_SHIFT)) & SARADC_STS1_P_ERRCAP_MASK)

#define SARADC_STS1_P_CAPNUM_MASK                (0xFF00U)
#define SARADC_STS1_P_CAPNUM_SHIFT               (8U)
#define SARADC_STS1_P_CAPNUM_WIDTH               (8U)
#define SARADC_STS1_P_CAPNUM(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_STS1_P_CAPNUM_SHIFT)) & SARADC_STS1_P_CAPNUM_MASK)

#define SARADC_STS1_P_WDGEOA_S_MASK              (0x10000U)
#define SARADC_STS1_P_WDGEOA_S_SHIFT             (16U)
#define SARADC_STS1_P_WDGEOA_S_WIDTH             (1U)
#define SARADC_STS1_P_WDGEOA_S(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_STS1_P_WDGEOA_S_SHIFT)) & SARADC_STS1_P_WDGEOA_S_MASK)

#define SARADC_STS1_P_WDGEOA_O_MASK              (0x20000U)
#define SARADC_STS1_P_WDGEOA_O_SHIFT             (17U)
#define SARADC_STS1_P_WDGEOA_O_WIDTH             (1U)
#define SARADC_STS1_P_WDGEOA_O(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_STS1_P_WDGEOA_O_SHIFT)) & SARADC_STS1_P_WDGEOA_O_MASK)

#define SARADC_STS1_P_WDGEOA_C_MASK              (0x40000U)
#define SARADC_STS1_P_WDGEOA_C_SHIFT             (18U)
#define SARADC_STS1_P_WDGEOA_C_WIDTH             (1U)
#define SARADC_STS1_P_WDGEOA_C(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_STS1_P_WDGEOA_C_SHIFT)) & SARADC_STS1_P_WDGEOA_C_MASK)

#define SARADC_STS1_P_STEOCSUP_MASK              (0x80000U)
#define SARADC_STS1_P_STEOCSUP_SHIFT             (19U)
#define SARADC_STS1_P_STEOCSUP_WIDTH             (1U)
#define SARADC_STS1_P_STEOCSUP(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_STS1_P_STEOCSUP_SHIFT)) & SARADC_STS1_P_STEOCSUP_MASK)

#define SARADC_STS1_P_STEOCOFS_MASK              (0x100000U)
#define SARADC_STS1_P_STEOCOFS_SHIFT             (20U)
#define SARADC_STS1_P_STEOCOFS_WIDTH             (1U)
#define SARADC_STS1_P_STEOCOFS(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_STS1_P_STEOCOFS_SHIFT)) & SARADC_STS1_P_STEOCOFS_MASK)

#define SARADC_STS1_P_STEOCCAP_MASK              (0x200000U)
#define SARADC_STS1_P_STEOCCAP_SHIFT             (21U)
#define SARADC_STS1_P_STEOCCAP_WIDTH             (1U)
#define SARADC_STS1_P_STEOCCAP(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_STS1_P_STEOCCAP_SHIFT)) & SARADC_STS1_P_STEOCCAP_MASK)

#define SARADC_STS1_P_OVERWR_MASK                (0x400000U)
#define SARADC_STS1_P_OVERWR_SHIFT               (22U)
#define SARADC_STS1_P_OVERWR_WIDTH               (1U)
#define SARADC_STS1_P_OVERWR(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_STS1_P_OVERWR_SHIFT)) & SARADC_STS1_P_OVERWR_MASK)

#define SARADC_STS1_P_WDTERR_MASK                (0x800000U)
#define SARADC_STS1_P_WDTERR_SHIFT               (23U)
#define SARADC_STS1_P_WDTERR_WIDTH               (1U)
#define SARADC_STS1_P_WDTERR(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_STS1_P_WDTERR_SHIFT)) & SARADC_STS1_P_WDTERR_MASK)
/*! @} */

/*! @name STS1_M - Self-Test Status 1 for M-SARADC */
/*! @{ */

#define SARADC_STS1_M_VRNUMBER_MASK              (0x7U)
#define SARADC_STS1_M_VRNUMBER_SHIFT             (0U)
#define SARADC_STS1_M_VRNUMBER_WIDTH             (3U)
#define SARADC_STS1_M_VRNUMBER(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_STS1_M_VRNUMBER_SHIFT)) & SARADC_STS1_M_VRNUMBER_MASK)

#define SARADC_STS1_M_ERRVBG_MASK                (0x8U)
#define SARADC_STS1_M_ERRVBG_SHIFT               (3U)
#define SARADC_STS1_M_ERRVBG_WIDTH               (1U)
#define SARADC_STS1_M_ERRVBG(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_STS1_M_ERRVBG_SHIFT)) & SARADC_STS1_M_ERRVBG_MASK)

#define SARADC_STS1_M_ERRVDD_MASK                (0x10U)
#define SARADC_STS1_M_ERRVDD_SHIFT               (4U)
#define SARADC_STS1_M_ERRVDD_WIDTH               (1U)
#define SARADC_STS1_M_ERRVDD(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_STS1_M_ERRVDD_SHIFT)) & SARADC_STS1_M_ERRVDD_MASK)

