zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SARADC.h
#define SARADC_STS1_M_ERRVRTST_MASK              (0x20U)
#define SARADC_STS1_M_ERRVRTST_SHIFT             (5U)
#define SARADC_STS1_M_ERRVRTST_WIDTH             (1U)
#define SARADC_STS1_M_ERRVRTST(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_STS1_M_ERRVRTST_SHIFT)) & SARADC_STS1_M_ERRVRTST_MASK)

#define SARADC_STS1_M_ERROFS_MASK                (0x40U)
#define SARADC_STS1_M_ERROFS_SHIFT               (6U)
#define SARADC_STS1_M_ERROFS_WIDTH               (1U)
#define SARADC_STS1_M_ERROFS(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_STS1_M_ERROFS_SHIFT)) & SARADC_STS1_M_ERROFS_MASK)

#define SARADC_STS1_M_ERRCAP_MASK                (0x80U)
#define SARADC_STS1_M_ERRCAP_SHIFT               (7U)
#define SARADC_STS1_M_ERRCAP_WIDTH               (1U)
#define SARADC_STS1_M_ERRCAP(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_STS1_M_ERRCAP_SHIFT)) & SARADC_STS1_M_ERRCAP_MASK)

#define SARADC_STS1_M_CAPNUM_MASK                (0xFF00U)
#define SARADC_STS1_M_CAPNUM_SHIFT               (8U)
#define SARADC_STS1_M_CAPNUM_WIDTH               (8U)
#define SARADC_STS1_M_CAPNUM(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_STS1_M_CAPNUM_SHIFT)) & SARADC_STS1_M_CAPNUM_MASK)

#define SARADC_STS1_M_WDGEOA_S_MASK              (0x10000U)
#define SARADC_STS1_M_WDGEOA_S_SHIFT             (16U)
#define SARADC_STS1_M_WDGEOA_S_WIDTH             (1U)
#define SARADC_STS1_M_WDGEOA_S(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_STS1_M_WDGEOA_S_SHIFT)) & SARADC_STS1_M_WDGEOA_S_MASK)

#define SARADC_STS1_M_WDGEOA_O_MASK              (0x20000U)
#define SARADC_STS1_M_WDGEOA_O_SHIFT             (17U)
#define SARADC_STS1_M_WDGEOA_O_WIDTH             (1U)
#define SARADC_STS1_M_WDGEOA_O(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_STS1_M_WDGEOA_O_SHIFT)) & SARADC_STS1_M_WDGEOA_O_MASK)

#define SARADC_STS1_M_WDGEOA_C_MASK              (0x40000U)
#define SARADC_STS1_M_WDGEOA_C_SHIFT             (18U)
#define SARADC_STS1_M_WDGEOA_C_WIDTH             (1U)
#define SARADC_STS1_M_WDGEOA_C(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_STS1_M_WDGEOA_C_SHIFT)) & SARADC_STS1_M_WDGEOA_C_MASK)

#define SARADC_STS1_M_STEOCSUP_MASK              (0x80000U)
#define SARADC_STS1_M_STEOCSUP_SHIFT             (19U)
#define SARADC_STS1_M_STEOCSUP_WIDTH             (1U)
#define SARADC_STS1_M_STEOCSUP(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_STS1_M_STEOCSUP_SHIFT)) & SARADC_STS1_M_STEOCSUP_MASK)

#define SARADC_STS1_M_STEOCOFS_MASK              (0x100000U)
#define SARADC_STS1_M_STEOCOFS_SHIFT             (20U)
#define SARADC_STS1_M_STEOCOFS_WIDTH             (1U)
#define SARADC_STS1_M_STEOCOFS(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_STS1_M_STEOCOFS_SHIFT)) & SARADC_STS1_M_STEOCOFS_MASK)

#define SARADC_STS1_M_STEOCCAP_MASK              (0x200000U)
#define SARADC_STS1_M_STEOCCAP_SHIFT             (21U)
#define SARADC_STS1_M_STEOCCAP_WIDTH             (1U)
#define SARADC_STS1_M_STEOCCAP(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_STS1_M_STEOCCAP_SHIFT)) & SARADC_STS1_M_STEOCCAP_MASK)

#define SARADC_STS1_M_OVERWR_MASK                (0x400000U)
#define SARADC_STS1_M_OVERWR_SHIFT               (22U)
#define SARADC_STS1_M_OVERWR_WIDTH               (1U)
#define SARADC_STS1_M_OVERWR(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_STS1_M_OVERWR_SHIFT)) & SARADC_STS1_M_OVERWR_MASK)

#define SARADC_STS1_M_WDTERR_MASK                (0x800000U)
#define SARADC_STS1_M_WDTERR_SHIFT               (23U)
#define SARADC_STS1_M_WDTERR_WIDTH               (1U)
#define SARADC_STS1_M_WDTERR(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_STS1_M_WDTERR_SHIFT)) & SARADC_STS1_M_WDTERR_MASK)
/*! @} */

/*! @name STS2_P - Self-Test Status 2 for P-SARADC */
/*! @{ */

#define SARADC_STS2_P_DATVBGER_MASK              (0xFFFFU)
#define SARADC_STS2_P_DATVBGER_SHIFT             (0U)
#define SARADC_STS2_P_DATVBGER_WIDTH             (16U)
#define SARADC_STS2_P_DATVBGER(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_STS2_P_DATVBGER_SHIFT)) & SARADC_STS2_P_DATVBGER_MASK)

#define SARADC_STS2_P_DATVRER_MASK               (0xFFFF0000U)
#define SARADC_STS2_P_DATVRER_SHIFT              (16U)
#define SARADC_STS2_P_DATVRER_WIDTH              (16U)
#define SARADC_STS2_P_DATVRER(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_STS2_P_DATVRER_SHIFT)) & SARADC_STS2_P_DATVRER_MASK)
/*! @} */

/*! @name STS2_M - Self-Test Status 2 for M-SARADC */
/*! @{ */

#define SARADC_STS2_M_DATVBGER_MASK              (0xFFFFU)
#define SARADC_STS2_M_DATVBGER_SHIFT             (0U)
#define SARADC_STS2_M_DATVBGER_WIDTH             (16U)
#define SARADC_STS2_M_DATVBGER(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_STS2_M_DATVBGER_SHIFT)) & SARADC_STS2_M_DATVBGER_MASK)

#define SARADC_STS2_M_DATVRER_MASK               (0xFFFF0000U)
#define SARADC_STS2_M_DATVRER_SHIFT              (16U)
#define SARADC_STS2_M_DATVRER_WIDTH              (16U)
#define SARADC_STS2_M_DATVRER(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_STS2_M_DATVRER_SHIFT)) & SARADC_STS2_M_DATVRER_MASK)
/*! @} */

/*! @name STS3_P - Self-Test Status 3 for P-SARADC */
/*! @{ */

#define SARADC_STS3_P_DATVDERI_MASK              (0x3U)
#define SARADC_STS3_P_DATVDERI_SHIFT             (0U)
#define SARADC_STS3_P_DATVDERI_WIDTH             (2U)
#define SARADC_STS3_P_DATVDERI(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_STS3_P_DATVDERI_SHIFT)) & SARADC_STS3_P_DATVDERI_MASK)

#define SARADC_STS3_P_OVFERVDD_MASK              (0x8000U)
#define SARADC_STS3_P_OVFERVDD_SHIFT             (15U)
#define SARADC_STS3_P_OVFERVDD_WIDTH             (1U)
#define SARADC_STS3_P_OVFERVDD(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_STS3_P_OVFERVDD_SHIFT)) & SARADC_STS3_P_OVFERVDD_MASK)

#define SARADC_STS3_P_DATVDERF_MASK              (0xFFFF0000U)
#define SARADC_STS3_P_DATVDERF_SHIFT             (16U)
#define SARADC_STS3_P_DATVDERF_WIDTH             (16U)
#define SARADC_STS3_P_DATVDERF(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_STS3_P_DATVDERF_SHIFT)) & SARADC_STS3_P_DATVDERF_MASK)
/*! @} */

/*! @name STS3_M - Self-Test Status 3 for M-SARADC */
/*! @{ */

#define SARADC_STS3_M_DATVDERI_MASK              (0x3U)
#define SARADC_STS3_M_DATVDERI_SHIFT             (0U)
#define SARADC_STS3_M_DATVDERI_WIDTH             (2U)
#define SARADC_STS3_M_DATVDERI(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_STS3_M_DATVDERI_SHIFT)) & SARADC_STS3_M_DATVDERI_MASK)

