zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SARADC.h
#define SARADC_STS3_M_OVFERVDD_MASK              (0x8000U)
#define SARADC_STS3_M_OVFERVDD_SHIFT             (15U)
#define SARADC_STS3_M_OVFERVDD_WIDTH             (1U)
#define SARADC_STS3_M_OVFERVDD(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_STS3_M_OVFERVDD_SHIFT)) & SARADC_STS3_M_OVFERVDD_MASK)

#define SARADC_STS3_M_DATVDERF_MASK              (0xFFFF0000U)
#define SARADC_STS3_M_DATVDERF_SHIFT             (16U)
#define SARADC_STS3_M_DATVDERF_WIDTH             (16U)
#define SARADC_STS3_M_DATVDERF(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_STS3_M_DATVDERF_SHIFT)) & SARADC_STS3_M_DATVDERF_MASK)
/*! @} */

/*! @name STS4_P - Self-Test Status 4 for P-SARADC */
/*! @{ */

#define SARADC_STS4_P_DATOFSER_MASK              (0xFFFFU)
#define SARADC_STS4_P_DATOFSER_SHIFT             (0U)
#define SARADC_STS4_P_DATOFSER_WIDTH             (16U)
#define SARADC_STS4_P_DATOFSER(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_STS4_P_DATOFSER_SHIFT)) & SARADC_STS4_P_DATOFSER_MASK)

#define SARADC_STS4_P_DATCAPER_MASK              (0xFFFF0000U)
#define SARADC_STS4_P_DATCAPER_SHIFT             (16U)
#define SARADC_STS4_P_DATCAPER_WIDTH             (16U)
#define SARADC_STS4_P_DATCAPER(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_STS4_P_DATCAPER_SHIFT)) & SARADC_STS4_P_DATCAPER_MASK)
/*! @} */

/*! @name STS4_M - Self-Test Status 4 for M-SARADC */
/*! @{ */

#define SARADC_STS4_M_DATOFSER_MASK              (0xFFFFU)
#define SARADC_STS4_M_DATOFSER_SHIFT             (0U)
#define SARADC_STS4_M_DATOFSER_WIDTH             (16U)
#define SARADC_STS4_M_DATOFSER(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_STS4_M_DATOFSER_SHIFT)) & SARADC_STS4_M_DATOFSER_MASK)

#define SARADC_STS4_M_DATCAPER_MASK              (0xFFFF0000U)
#define SARADC_STS4_M_DATCAPER_SHIFT             (16U)
#define SARADC_STS4_M_DATCAPER_WIDTH             (16U)
#define SARADC_STS4_M_DATCAPER(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_STS4_M_DATCAPER_SHIFT)) & SARADC_STS4_M_DATCAPER_MASK)
/*! @} */

/*! @name STD1_P - Self-Test Conversion Data 1 for P-SARADC */
/*! @{ */

#define SARADC_STD1_P_TCDATA_MASK                (0xFFFFU)
#define SARADC_STD1_P_TCDATA_SHIFT               (0U)
#define SARADC_STD1_P_TCDATA_WIDTH               (16U)
#define SARADC_STD1_P_TCDATA(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_STD1_P_TCDATA_SHIFT)) & SARADC_STD1_P_TCDATA_MASK)

#define SARADC_STD1_P_OWERWR_MASK                (0x40000U)
#define SARADC_STD1_P_OWERWR_SHIFT               (18U)
#define SARADC_STD1_P_OWERWR_WIDTH               (1U)
#define SARADC_STD1_P_OWERWR(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_STD1_P_OWERWR_SHIFT)) & SARADC_STD1_P_OWERWR_MASK)

#define SARADC_STD1_P_VALID_MASK                 (0x80000U)
#define SARADC_STD1_P_VALID_SHIFT                (19U)
#define SARADC_STD1_P_VALID_WIDTH                (1U)
#define SARADC_STD1_P_VALID(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_STD1_P_VALID_SHIFT)) & SARADC_STD1_P_VALID_MASK)
/*! @} */

/*! @name STD1_M - Self-Test Conversion Data 1 for M-SARADC */
/*! @{ */

#define SARADC_STD1_M_TCDATA_MASK                (0xFFFFU)
#define SARADC_STD1_M_TCDATA_SHIFT               (0U)
#define SARADC_STD1_M_TCDATA_WIDTH               (16U)
#define SARADC_STD1_M_TCDATA(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_STD1_M_TCDATA_SHIFT)) & SARADC_STD1_M_TCDATA_MASK)

#define SARADC_STD1_M_OWERWR_MASK                (0x40000U)
#define SARADC_STD1_M_OWERWR_SHIFT               (18U)
#define SARADC_STD1_M_OWERWR_WIDTH               (1U)
#define SARADC_STD1_M_OWERWR(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_STD1_M_OWERWR_SHIFT)) & SARADC_STD1_M_OWERWR_MASK)

#define SARADC_STD1_M_VALID_MASK                 (0x80000U)
#define SARADC_STD1_M_VALID_SHIFT                (19U)
#define SARADC_STD1_M_VALID_WIDTH                (1U)
#define SARADC_STD1_M_VALID(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_STD1_M_VALID_SHIFT)) & SARADC_STD1_M_VALID_MASK)
/*! @} */

/*! @name STD2_P - Self-Test Conversion Data 2 for P-SARADC */
/*! @{ */

#define SARADC_STD2_P_ITCDATA_MASK               (0x3U)
#define SARADC_STD2_P_ITCDATA_SHIFT              (0U)
#define SARADC_STD2_P_ITCDATA_WIDTH              (2U)
#define SARADC_STD2_P_ITCDATA(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_STD2_P_ITCDATA_SHIFT)) & SARADC_STD2_P_ITCDATA_MASK)

#define SARADC_STD2_P_OWERWR_MASK                (0x4000U)
#define SARADC_STD2_P_OWERWR_SHIFT               (14U)
#define SARADC_STD2_P_OWERWR_WIDTH               (1U)
#define SARADC_STD2_P_OWERWR(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_STD2_P_OWERWR_SHIFT)) & SARADC_STD2_P_OWERWR_MASK)

#define SARADC_STD2_P_VALID_MASK                 (0x8000U)
#define SARADC_STD2_P_VALID_SHIFT                (15U)
#define SARADC_STD2_P_VALID_WIDTH                (1U)
#define SARADC_STD2_P_VALID(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_STD2_P_VALID_SHIFT)) & SARADC_STD2_P_VALID_MASK)

#define SARADC_STD2_P_FTCDATA_MASK               (0xFFFF0000U)
#define SARADC_STD2_P_FTCDATA_SHIFT              (16U)
#define SARADC_STD2_P_FTCDATA_WIDTH              (16U)
#define SARADC_STD2_P_FTCDATA(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_STD2_P_FTCDATA_SHIFT)) & SARADC_STD2_P_FTCDATA_MASK)
/*! @} */

/*! @name STD2_M - Self-Test Conversion Data 2 for M-SARADC */
/*! @{ */

#define SARADC_STD2_M_ITCDATA_MASK               (0x3U)
#define SARADC_STD2_M_ITCDATA_SHIFT              (0U)
#define SARADC_STD2_M_ITCDATA_WIDTH              (2U)
#define SARADC_STD2_M_ITCDATA(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_STD2_M_ITCDATA_SHIFT)) & SARADC_STD2_M_ITCDATA_MASK)

#define SARADC_STD2_M_OWERWR_MASK                (0x4000U)
#define SARADC_STD2_M_OWERWR_SHIFT               (14U)
#define SARADC_STD2_M_OWERWR_WIDTH               (1U)
#define SARADC_STD2_M_OWERWR(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_STD2_M_OWERWR_SHIFT)) & SARADC_STD2_M_OWERWR_MASK)

