zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SARADC.h
#define SARADC_STD2_M_VALID_MASK                 (0x8000U)
#define SARADC_STD2_M_VALID_SHIFT                (15U)
#define SARADC_STD2_M_VALID_WIDTH                (1U)
#define SARADC_STD2_M_VALID(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_STD2_M_VALID_SHIFT)) & SARADC_STD2_M_VALID_MASK)

#define SARADC_STD2_M_FTCDATA_MASK               (0xFFFF0000U)
#define SARADC_STD2_M_FTCDATA_SHIFT              (16U)
#define SARADC_STD2_M_FTCDATA_WIDTH              (16U)
#define SARADC_STD2_M_FTCDATA(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_STD2_M_FTCDATA_SHIFT)) & SARADC_STD2_M_FTCDATA_MASK)
/*! @} */

/*! @name STAWVBG - Self Test Analog Watchdog Threshold for Bandgap Supply */
/*! @{ */

#define SARADC_STAWVBG_THRLVBG_MASK              (0xFFFFU)
#define SARADC_STAWVBG_THRLVBG_SHIFT             (0U)
#define SARADC_STAWVBG_THRLVBG_WIDTH             (16U)
#define SARADC_STAWVBG_THRLVBG(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_STAWVBG_THRLVBG_SHIFT)) & SARADC_STAWVBG_THRLVBG_MASK)

#define SARADC_STAWVBG_THRHVBG_MASK              (0xFFFF0000U)
#define SARADC_STAWVBG_THRHVBG_SHIFT             (16U)
#define SARADC_STAWVBG_THRHVBG_WIDTH             (16U)
#define SARADC_STAWVBG_THRHVBG(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_STAWVBG_THRHVBG_SHIFT)) & SARADC_STAWVBG_THRHVBG_MASK)
/*! @} */

/*! @name STAWVDDI - Self Test Analog Watchdog Threshold for VDD (Integer Part) */
/*! @{ */

#define SARADC_STAWVDDI_THRLVDDI_MASK            (0xFFFFU)
#define SARADC_STAWVDDI_THRLVDDI_SHIFT           (0U)
#define SARADC_STAWVDDI_THRLVDDI_WIDTH           (16U)
#define SARADC_STAWVDDI_THRLVDDI(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_STAWVDDI_THRLVDDI_SHIFT)) & SARADC_STAWVDDI_THRLVDDI_MASK)

#define SARADC_STAWVDDI_THRHVDDI_MASK            (0xFFFF0000U)
#define SARADC_STAWVDDI_THRHVDDI_SHIFT           (16U)
#define SARADC_STAWVDDI_THRHVDDI_WIDTH           (16U)
#define SARADC_STAWVDDI_THRHVDDI(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_STAWVDDI_THRHVDDI_SHIFT)) & SARADC_STAWVDDI_THRHVDDI_MASK)
/*! @} */

/*! @name STAWVDDF - Self Test Analog Watchdog Threshold for VDD (Fractional Part) */
/*! @{ */

#define SARADC_STAWVDDF_THRLVDDF_MASK            (0xFFFFU)
#define SARADC_STAWVDDF_THRLVDDF_SHIFT           (0U)
#define SARADC_STAWVDDF_THRLVDDF_WIDTH           (16U)
#define SARADC_STAWVDDF_THRLVDDF(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_STAWVDDF_THRLVDDF_SHIFT)) & SARADC_STAWVDDF_THRLVDDF_MASK)

#define SARADC_STAWVDDF_THRHVDDF_MASK            (0xFFFF0000U)
#define SARADC_STAWVDDF_THRHVDDF_SHIFT           (16U)
#define SARADC_STAWVDDF_THRHVDDF_WIDTH           (16U)
#define SARADC_STAWVDDF_THRHVDDF(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_STAWVDDF_THRHVDDF_SHIFT)) & SARADC_STAWVDDF_THRHVDDF_MASK)
/*! @} */

/*! @name STAWVRHL - Self Test Analog Watchdog Threshold for Reference High Supply */
/*! @{ */

#define SARADC_STAWVRHL_THRLVRHL_MASK            (0xFFFFU)
#define SARADC_STAWVRHL_THRLVRHL_SHIFT           (0U)
#define SARADC_STAWVRHL_THRLVRHL_WIDTH           (16U)
#define SARADC_STAWVRHL_THRLVRHL(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_STAWVRHL_THRLVRHL_SHIFT)) & SARADC_STAWVRHL_THRLVRHL_MASK)

#define SARADC_STAWVRHL_VRCORXN_MASK             (0xFF0000U)
#define SARADC_STAWVRHL_VRCORXN_SHIFT            (16U)
#define SARADC_STAWVRHL_VRCORXN_WIDTH            (8U)
#define SARADC_STAWVRHL_VRCORXN(x)               (((uint32_t)(((uint32_t)(x)) << SARADC_STAWVRHL_VRCORXN_SHIFT)) & SARADC_STAWVRHL_VRCORXN_MASK)

#define SARADC_STAWVRHL_VREFL_MASK               (0xFF000000U)
#define SARADC_STAWVRHL_VREFL_SHIFT              (24U)
#define SARADC_STAWVRHL_VREFL_WIDTH              (8U)
#define SARADC_STAWVRHL_VREFL(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_STAWVRHL_VREFL_SHIFT)) & SARADC_STAWVRHL_VREFL_MASK)
/*! @} */

/*! @name STAWOFS - Self Test Analog Watchdog Threshold for Offset */
/*! @{ */

#define SARADC_STAWOFS_THRLOFS_MASK              (0xFFFFU)
#define SARADC_STAWOFS_THRLOFS_SHIFT             (0U)
#define SARADC_STAWOFS_THRLOFS_WIDTH             (16U)
#define SARADC_STAWOFS_THRLOFS(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_STAWOFS_THRLOFS_SHIFT)) & SARADC_STAWOFS_THRLOFS_MASK)

#define SARADC_STAWOFS_THRHOFS_MASK              (0xFFFF0000U)
#define SARADC_STAWOFS_THRHOFS_SHIFT             (16U)
#define SARADC_STAWOFS_THRHOFS_WIDTH             (16U)
#define SARADC_STAWOFS_THRHOFS(x)                (((uint32_t)(((uint32_t)(x)) << SARADC_STAWOFS_THRHOFS_SHIFT)) & SARADC_STAWOFS_THRHOFS_MASK)
/*! @} */

/*! @name STAWCAPM - Self Test Analog Watchdog Threshold for MSB Capacitor */
/*! @{ */

#define SARADC_STAWCAPM_THRLCAPM_MASK            (0xFFFFU)
#define SARADC_STAWCAPM_THRLCAPM_SHIFT           (0U)
#define SARADC_STAWCAPM_THRLCAPM_WIDTH           (16U)
#define SARADC_STAWCAPM_THRLCAPM(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_STAWCAPM_THRLCAPM_SHIFT)) & SARADC_STAWCAPM_THRLCAPM_MASK)

#define SARADC_STAWCAPM_THRHCAPM_MASK            (0xFFFF0000U)
#define SARADC_STAWCAPM_THRHCAPM_SHIFT           (16U)
#define SARADC_STAWCAPM_THRHCAPM_WIDTH           (16U)
#define SARADC_STAWCAPM_THRHCAPM(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_STAWCAPM_THRHCAPM_SHIFT)) & SARADC_STAWCAPM_THRHCAPM_MASK)
/*! @} */

/*! @name STAWCAPI - Self Test Analog Watchdog Threshold for ISB Capacitor */
/*! @{ */

#define SARADC_STAWCAPI_THRLCAPI_MASK            (0xFFFFU)
#define SARADC_STAWCAPI_THRLCAPI_SHIFT           (0U)
#define SARADC_STAWCAPI_THRLCAPI_WIDTH           (16U)
#define SARADC_STAWCAPI_THRLCAPI(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_STAWCAPI_THRLCAPI_SHIFT)) & SARADC_STAWCAPI_THRLCAPI_MASK)

#define SARADC_STAWCAPI_THRHCAPI_MASK            (0xFFFF0000U)
#define SARADC_STAWCAPI_THRHCAPI_SHIFT           (16U)
#define SARADC_STAWCAPI_THRHCAPI_WIDTH           (16U)
#define SARADC_STAWCAPI_THRHCAPI(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_STAWCAPI_THRHCAPI_SHIFT)) & SARADC_STAWCAPI_THRHCAPI_MASK)
/*! @} */

