zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SARADC.h
/*! @name STAWCAPL - Self Test Analog Watchdog Threshold for LSB Capacitor */
/*! @{ */

#define SARADC_STAWCAPL_THRLCAPL_MASK            (0xFFFFU)
#define SARADC_STAWCAPL_THRLCAPL_SHIFT           (0U)
#define SARADC_STAWCAPL_THRLCAPL_WIDTH           (16U)
#define SARADC_STAWCAPL_THRLCAPL(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_STAWCAPL_THRLCAPL_SHIFT)) & SARADC_STAWCAPL_THRLCAPL_MASK)

#define SARADC_STAWCAPL_THRHCAPL_MASK            (0xFFFF0000U)
#define SARADC_STAWCAPL_THRHCAPL_SHIFT           (16U)
#define SARADC_STAWCAPL_THRHCAPL_WIDTH           (16U)
#define SARADC_STAWCAPL_THRHCAPL(x)              (((uint32_t)(((uint32_t)(x)) << SARADC_STAWCAPL_THRHCAPL_SHIFT)) & SARADC_STAWCAPL_THRHCAPL_MASK)
/*! @} */

/*! @name GCC_P - Gain Calibration Control for P-SARADC Converter */
/*! @{ */

#define SARADC_GCC_P_GAIN_CAL_MASK               (0x1FFFFU)
#define SARADC_GCC_P_GAIN_CAL_SHIFT              (0U)
#define SARADC_GCC_P_GAIN_CAL_WIDTH              (17U)
#define SARADC_GCC_P_GAIN_CAL(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_GCC_P_GAIN_CAL_SHIFT)) & SARADC_GCC_P_GAIN_CAL_MASK)

#define SARADC_GCC_P_VALID_MASK                  (0x1000000U)
#define SARADC_GCC_P_VALID_SHIFT                 (24U)
#define SARADC_GCC_P_VALID_WIDTH                 (1U)
#define SARADC_GCC_P_VALID(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_GCC_P_VALID_SHIFT)) & SARADC_GCC_P_VALID_MASK)
/*! @} */

/*! @name GCC_M - Gain Calibration Control for M-SARADC SARADC Converter */
/*! @{ */

#define SARADC_GCC_M_GAIN_CAL_MASK               (0x1FFFFU)
#define SARADC_GCC_M_GAIN_CAL_SHIFT              (0U)
#define SARADC_GCC_M_GAIN_CAL_WIDTH              (17U)
#define SARADC_GCC_M_GAIN_CAL(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_GCC_M_GAIN_CAL_SHIFT)) & SARADC_GCC_M_GAIN_CAL_MASK)

#define SARADC_GCC_M_VALID_MASK                  (0x1000000U)
#define SARADC_GCC_M_VALID_SHIFT                 (24U)
#define SARADC_GCC_M_VALID_WIDTH                 (1U)
#define SARADC_GCC_M_VALID(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_GCC_M_VALID_SHIFT)) & SARADC_GCC_M_VALID_MASK)
/*! @} */

/*! @name GCR_P - Gain Calculation Result for P-SARADC Converter */
/*! @{ */

#define SARADC_GCR_P_GCALR_MASK                  (0x1FFFFU)
#define SARADC_GCR_P_GCALR_SHIFT                 (0U)
#define SARADC_GCR_P_GCALR_WIDTH                 (17U)
#define SARADC_GCR_P_GCALR(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_GCR_P_GCALR_SHIFT)) & SARADC_GCR_P_GCALR_MASK)

#define SARADC_GCR_P_VALID_MASK                  (0x1000000U)
#define SARADC_GCR_P_VALID_SHIFT                 (24U)
#define SARADC_GCR_P_VALID_WIDTH                 (1U)
#define SARADC_GCR_P_VALID(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_GCR_P_VALID_SHIFT)) & SARADC_GCR_P_VALID_MASK)
/*! @} */

/*! @name GCR_M - Gain Calculation Result for M-SARADC Converter */
/*! @{ */

#define SARADC_GCR_M_GCALR_MASK                  (0x1FFFFU)
#define SARADC_GCR_M_GCALR_SHIFT                 (0U)
#define SARADC_GCR_M_GCALR_WIDTH                 (17U)
#define SARADC_GCR_M_GCALR(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_GCR_M_GCALR_SHIFT)) & SARADC_GCR_M_GCALR_MASK)

#define SARADC_GCR_M_VALID_MASK                  (0x1000000U)
#define SARADC_GCR_M_VALID_SHIFT                 (24U)
#define SARADC_GCR_M_VALID_WIDTH                 (1U)
#define SARADC_GCR_M_VALID(x)                    (((uint32_t)(((uint32_t)(x)) << SARADC_GCR_M_VALID_SHIFT)) & SARADC_GCR_M_VALID_MASK)
/*! @} */

/*! @name CALSTSP0 - Calibration Fail Status 0 for P-SARADC */
/*! @{ */

#define SARADC_CALSTSP0_CAP0_MASK                (0x1U)
#define SARADC_CALSTSP0_CAP0_SHIFT               (0U)
#define SARADC_CALSTSP0_CAP0_WIDTH               (1U)
#define SARADC_CALSTSP0_CAP0(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSP0_CAP0_SHIFT)) & SARADC_CALSTSP0_CAP0_MASK)

#define SARADC_CALSTSP0_CAP1_MASK                (0x2U)
#define SARADC_CALSTSP0_CAP1_SHIFT               (1U)
#define SARADC_CALSTSP0_CAP1_WIDTH               (1U)
#define SARADC_CALSTSP0_CAP1(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSP0_CAP1_SHIFT)) & SARADC_CALSTSP0_CAP1_MASK)

#define SARADC_CALSTSP0_CAP2_MASK                (0x4U)
#define SARADC_CALSTSP0_CAP2_SHIFT               (2U)
#define SARADC_CALSTSP0_CAP2_WIDTH               (1U)
#define SARADC_CALSTSP0_CAP2(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSP0_CAP2_SHIFT)) & SARADC_CALSTSP0_CAP2_MASK)

#define SARADC_CALSTSP0_CAP3_MASK                (0x8U)
#define SARADC_CALSTSP0_CAP3_SHIFT               (3U)
#define SARADC_CALSTSP0_CAP3_WIDTH               (1U)
#define SARADC_CALSTSP0_CAP3(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSP0_CAP3_SHIFT)) & SARADC_CALSTSP0_CAP3_MASK)

#define SARADC_CALSTSP0_CAP4_MASK                (0x10U)
#define SARADC_CALSTSP0_CAP4_SHIFT               (4U)
#define SARADC_CALSTSP0_CAP4_WIDTH               (1U)
#define SARADC_CALSTSP0_CAP4(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSP0_CAP4_SHIFT)) & SARADC_CALSTSP0_CAP4_MASK)

#define SARADC_CALSTSP0_CAP5_MASK                (0x20U)
#define SARADC_CALSTSP0_CAP5_SHIFT               (5U)
#define SARADC_CALSTSP0_CAP5_WIDTH               (1U)
#define SARADC_CALSTSP0_CAP5(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSP0_CAP5_SHIFT)) & SARADC_CALSTSP0_CAP5_MASK)

#define SARADC_CALSTSP0_CAP6_MASK                (0x40U)
#define SARADC_CALSTSP0_CAP6_SHIFT               (6U)
#define SARADC_CALSTSP0_CAP6_WIDTH               (1U)
#define SARADC_CALSTSP0_CAP6(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSP0_CAP6_SHIFT)) & SARADC_CALSTSP0_CAP6_MASK)

#define SARADC_CALSTSP0_CAP7_MASK                (0x80U)
#define SARADC_CALSTSP0_CAP7_SHIFT               (7U)
#define SARADC_CALSTSP0_CAP7_WIDTH               (1U)
#define SARADC_CALSTSP0_CAP7(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSP0_CAP7_SHIFT)) & SARADC_CALSTSP0_CAP7_MASK)

