zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SARADC.h
#define SARADC_CALSTSP0_CAP8_MASK                (0x100U)
#define SARADC_CALSTSP0_CAP8_SHIFT               (8U)
#define SARADC_CALSTSP0_CAP8_WIDTH               (1U)
#define SARADC_CALSTSP0_CAP8(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSP0_CAP8_SHIFT)) & SARADC_CALSTSP0_CAP8_MASK)

#define SARADC_CALSTSP0_CAP9_MASK                (0x200U)
#define SARADC_CALSTSP0_CAP9_SHIFT               (9U)
#define SARADC_CALSTSP0_CAP9_WIDTH               (1U)
#define SARADC_CALSTSP0_CAP9(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSP0_CAP9_SHIFT)) & SARADC_CALSTSP0_CAP9_MASK)

#define SARADC_CALSTSP0_CAP10_MASK               (0x400U)
#define SARADC_CALSTSP0_CAP10_SHIFT              (10U)
#define SARADC_CALSTSP0_CAP10_WIDTH              (1U)
#define SARADC_CALSTSP0_CAP10(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSP0_CAP10_SHIFT)) & SARADC_CALSTSP0_CAP10_MASK)

#define SARADC_CALSTSP0_CAP11_MASK               (0x800U)
#define SARADC_CALSTSP0_CAP11_SHIFT              (11U)
#define SARADC_CALSTSP0_CAP11_WIDTH              (1U)
#define SARADC_CALSTSP0_CAP11(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSP0_CAP11_SHIFT)) & SARADC_CALSTSP0_CAP11_MASK)

#define SARADC_CALSTSP0_CAP12_MASK               (0x1000U)
#define SARADC_CALSTSP0_CAP12_SHIFT              (12U)
#define SARADC_CALSTSP0_CAP12_WIDTH              (1U)
#define SARADC_CALSTSP0_CAP12(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSP0_CAP12_SHIFT)) & SARADC_CALSTSP0_CAP12_MASK)

#define SARADC_CALSTSP0_CAP13_MASK               (0x2000U)
#define SARADC_CALSTSP0_CAP13_SHIFT              (13U)
#define SARADC_CALSTSP0_CAP13_WIDTH              (1U)
#define SARADC_CALSTSP0_CAP13(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSP0_CAP13_SHIFT)) & SARADC_CALSTSP0_CAP13_MASK)

#define SARADC_CALSTSP0_CAP14_MASK               (0x4000U)
#define SARADC_CALSTSP0_CAP14_SHIFT              (14U)
#define SARADC_CALSTSP0_CAP14_WIDTH              (1U)
#define SARADC_CALSTSP0_CAP14(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSP0_CAP14_SHIFT)) & SARADC_CALSTSP0_CAP14_MASK)

#define SARADC_CALSTSP0_CAP15_MASK               (0x8000U)
#define SARADC_CALSTSP0_CAP15_SHIFT              (15U)
#define SARADC_CALSTSP0_CAP15_WIDTH              (1U)
#define SARADC_CALSTSP0_CAP15(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSP0_CAP15_SHIFT)) & SARADC_CALSTSP0_CAP15_MASK)

#define SARADC_CALSTSP0_CAP16_MASK               (0x10000U)
#define SARADC_CALSTSP0_CAP16_SHIFT              (16U)
#define SARADC_CALSTSP0_CAP16_WIDTH              (1U)
#define SARADC_CALSTSP0_CAP16(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSP0_CAP16_SHIFT)) & SARADC_CALSTSP0_CAP16_MASK)

#define SARADC_CALSTSP0_CAP17_MASK               (0x20000U)
#define SARADC_CALSTSP0_CAP17_SHIFT              (17U)
#define SARADC_CALSTSP0_CAP17_WIDTH              (1U)
#define SARADC_CALSTSP0_CAP17(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSP0_CAP17_SHIFT)) & SARADC_CALSTSP0_CAP17_MASK)

#define SARADC_CALSTSP0_CAP18_MASK               (0x40000U)
#define SARADC_CALSTSP0_CAP18_SHIFT              (18U)
#define SARADC_CALSTSP0_CAP18_WIDTH              (1U)
#define SARADC_CALSTSP0_CAP18(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSP0_CAP18_SHIFT)) & SARADC_CALSTSP0_CAP18_MASK)

#define SARADC_CALSTSP0_CAP19_MASK               (0x80000U)
#define SARADC_CALSTSP0_CAP19_SHIFT              (19U)
#define SARADC_CALSTSP0_CAP19_WIDTH              (1U)
#define SARADC_CALSTSP0_CAP19(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSP0_CAP19_SHIFT)) & SARADC_CALSTSP0_CAP19_MASK)

#define SARADC_CALSTSP0_CAP20_MASK               (0x100000U)
#define SARADC_CALSTSP0_CAP20_SHIFT              (20U)
#define SARADC_CALSTSP0_CAP20_WIDTH              (1U)
#define SARADC_CALSTSP0_CAP20(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSP0_CAP20_SHIFT)) & SARADC_CALSTSP0_CAP20_MASK)

#define SARADC_CALSTSP0_CAP21_MASK               (0x200000U)
#define SARADC_CALSTSP0_CAP21_SHIFT              (21U)
#define SARADC_CALSTSP0_CAP21_WIDTH              (1U)
#define SARADC_CALSTSP0_CAP21(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSP0_CAP21_SHIFT)) & SARADC_CALSTSP0_CAP21_MASK)

#define SARADC_CALSTSP0_CAP22_MASK               (0x400000U)
#define SARADC_CALSTSP0_CAP22_SHIFT              (22U)
#define SARADC_CALSTSP0_CAP22_WIDTH              (1U)
#define SARADC_CALSTSP0_CAP22(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSP0_CAP22_SHIFT)) & SARADC_CALSTSP0_CAP22_MASK)

#define SARADC_CALSTSP0_CAP23_MASK               (0x800000U)
#define SARADC_CALSTSP0_CAP23_SHIFT              (23U)
#define SARADC_CALSTSP0_CAP23_WIDTH              (1U)
#define SARADC_CALSTSP0_CAP23(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSP0_CAP23_SHIFT)) & SARADC_CALSTSP0_CAP23_MASK)

#define SARADC_CALSTSP0_CAP24_MASK               (0x1000000U)
#define SARADC_CALSTSP0_CAP24_SHIFT              (24U)
#define SARADC_CALSTSP0_CAP24_WIDTH              (1U)
#define SARADC_CALSTSP0_CAP24(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSP0_CAP24_SHIFT)) & SARADC_CALSTSP0_CAP24_MASK)

#define SARADC_CALSTSP0_CAP25_MASK               (0x2000000U)
#define SARADC_CALSTSP0_CAP25_SHIFT              (25U)
#define SARADC_CALSTSP0_CAP25_WIDTH              (1U)
#define SARADC_CALSTSP0_CAP25(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSP0_CAP25_SHIFT)) & SARADC_CALSTSP0_CAP25_MASK)

#define SARADC_CALSTSP0_CAP26_MASK               (0x4000000U)
#define SARADC_CALSTSP0_CAP26_SHIFT              (26U)
#define SARADC_CALSTSP0_CAP26_WIDTH              (1U)
#define SARADC_CALSTSP0_CAP26(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSP0_CAP26_SHIFT)) & SARADC_CALSTSP0_CAP26_MASK)

#define SARADC_CALSTSP0_CAP27_MASK               (0x8000000U)
#define SARADC_CALSTSP0_CAP27_SHIFT              (27U)
#define SARADC_CALSTSP0_CAP27_WIDTH              (1U)
#define SARADC_CALSTSP0_CAP27(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSP0_CAP27_SHIFT)) & SARADC_CALSTSP0_CAP27_MASK)

#define SARADC_CALSTSP0_CAP28_MASK               (0x10000000U)
#define SARADC_CALSTSP0_CAP28_SHIFT              (28U)
#define SARADC_CALSTSP0_CAP28_WIDTH              (1U)
#define SARADC_CALSTSP0_CAP28(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSP0_CAP28_SHIFT)) & SARADC_CALSTSP0_CAP28_MASK)

#define SARADC_CALSTSP0_CAP29_MASK               (0x20000000U)
#define SARADC_CALSTSP0_CAP29_SHIFT              (29U)
#define SARADC_CALSTSP0_CAP29_WIDTH              (1U)
#define SARADC_CALSTSP0_CAP29(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSP0_CAP29_SHIFT)) & SARADC_CALSTSP0_CAP29_MASK)

#define SARADC_CALSTSP0_CAP30_MASK               (0x40000000U)
#define SARADC_CALSTSP0_CAP30_SHIFT              (30U)
#define SARADC_CALSTSP0_CAP30_WIDTH              (1U)
#define SARADC_CALSTSP0_CAP30(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSP0_CAP30_SHIFT)) & SARADC_CALSTSP0_CAP30_MASK)

#define SARADC_CALSTSP0_CAP31_MASK               (0x80000000U)
#define SARADC_CALSTSP0_CAP31_SHIFT              (31U)
#define SARADC_CALSTSP0_CAP31_WIDTH              (1U)
#define SARADC_CALSTSP0_CAP31(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSP0_CAP31_SHIFT)) & SARADC_CALSTSP0_CAP31_MASK)
/*! @} */

/*! @name CALSTSP1 - Calibration Fail Status 1 for P-SARADC */
/*! @{ */

#define SARADC_CALSTSP1_CAP32_MASK               (0x1U)
#define SARADC_CALSTSP1_CAP32_SHIFT              (0U)
#define SARADC_CALSTSP1_CAP32_WIDTH              (1U)
#define SARADC_CALSTSP1_CAP32(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSP1_CAP32_SHIFT)) & SARADC_CALSTSP1_CAP32_MASK)

#define SARADC_CALSTSP1_OFS_MASK                 (0x2U)
#define SARADC_CALSTSP1_OFS_SHIFT                (1U)
#define SARADC_CALSTSP1_OFS_WIDTH                (1U)
#define SARADC_CALSTSP1_OFS(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSP1_OFS_SHIFT)) & SARADC_CALSTSP1_OFS_MASK)
/*! @} */

/*! @name CALSTSM0 - Calibration Fail Status 0 for M-SARADC */
/*! @{ */

