zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SARADC.h
#define SARADC_CALSTSM0_CAP0_MASK                (0x1U)
#define SARADC_CALSTSM0_CAP0_SHIFT               (0U)
#define SARADC_CALSTSM0_CAP0_WIDTH               (1U)
#define SARADC_CALSTSM0_CAP0(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSM0_CAP0_SHIFT)) & SARADC_CALSTSM0_CAP0_MASK)

#define SARADC_CALSTSM0_CAP1_MASK                (0x2U)
#define SARADC_CALSTSM0_CAP1_SHIFT               (1U)
#define SARADC_CALSTSM0_CAP1_WIDTH               (1U)
#define SARADC_CALSTSM0_CAP1(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSM0_CAP1_SHIFT)) & SARADC_CALSTSM0_CAP1_MASK)

#define SARADC_CALSTSM0_CAP2_MASK                (0x4U)
#define SARADC_CALSTSM0_CAP2_SHIFT               (2U)
#define SARADC_CALSTSM0_CAP2_WIDTH               (1U)
#define SARADC_CALSTSM0_CAP2(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSM0_CAP2_SHIFT)) & SARADC_CALSTSM0_CAP2_MASK)

#define SARADC_CALSTSM0_CAP3_MASK                (0x8U)
#define SARADC_CALSTSM0_CAP3_SHIFT               (3U)
#define SARADC_CALSTSM0_CAP3_WIDTH               (1U)
#define SARADC_CALSTSM0_CAP3(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSM0_CAP3_SHIFT)) & SARADC_CALSTSM0_CAP3_MASK)

#define SARADC_CALSTSM0_CAP4_MASK                (0x10U)
#define SARADC_CALSTSM0_CAP4_SHIFT               (4U)
#define SARADC_CALSTSM0_CAP4_WIDTH               (1U)
#define SARADC_CALSTSM0_CAP4(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSM0_CAP4_SHIFT)) & SARADC_CALSTSM0_CAP4_MASK)

#define SARADC_CALSTSM0_CAP5_MASK                (0x20U)
#define SARADC_CALSTSM0_CAP5_SHIFT               (5U)
#define SARADC_CALSTSM0_CAP5_WIDTH               (1U)
#define SARADC_CALSTSM0_CAP5(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSM0_CAP5_SHIFT)) & SARADC_CALSTSM0_CAP5_MASK)

#define SARADC_CALSTSM0_CAP6_MASK                (0x40U)
#define SARADC_CALSTSM0_CAP6_SHIFT               (6U)
#define SARADC_CALSTSM0_CAP6_WIDTH               (1U)
#define SARADC_CALSTSM0_CAP6(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSM0_CAP6_SHIFT)) & SARADC_CALSTSM0_CAP6_MASK)

#define SARADC_CALSTSM0_CAP7_MASK                (0x80U)
#define SARADC_CALSTSM0_CAP7_SHIFT               (7U)
#define SARADC_CALSTSM0_CAP7_WIDTH               (1U)
#define SARADC_CALSTSM0_CAP7(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSM0_CAP7_SHIFT)) & SARADC_CALSTSM0_CAP7_MASK)

#define SARADC_CALSTSM0_CAP8_MASK                (0x100U)
#define SARADC_CALSTSM0_CAP8_SHIFT               (8U)
#define SARADC_CALSTSM0_CAP8_WIDTH               (1U)
#define SARADC_CALSTSM0_CAP8(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSM0_CAP8_SHIFT)) & SARADC_CALSTSM0_CAP8_MASK)

#define SARADC_CALSTSM0_CAP9_MASK                (0x200U)
#define SARADC_CALSTSM0_CAP9_SHIFT               (9U)
#define SARADC_CALSTSM0_CAP9_WIDTH               (1U)
#define SARADC_CALSTSM0_CAP9(x)                  (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSM0_CAP9_SHIFT)) & SARADC_CALSTSM0_CAP9_MASK)

#define SARADC_CALSTSM0_CAP10_MASK               (0x400U)
#define SARADC_CALSTSM0_CAP10_SHIFT              (10U)
#define SARADC_CALSTSM0_CAP10_WIDTH              (1U)
#define SARADC_CALSTSM0_CAP10(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSM0_CAP10_SHIFT)) & SARADC_CALSTSM0_CAP10_MASK)

#define SARADC_CALSTSM0_CAP11_MASK               (0x800U)
#define SARADC_CALSTSM0_CAP11_SHIFT              (11U)
#define SARADC_CALSTSM0_CAP11_WIDTH              (1U)
#define SARADC_CALSTSM0_CAP11(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSM0_CAP11_SHIFT)) & SARADC_CALSTSM0_CAP11_MASK)

#define SARADC_CALSTSM0_CAP12_MASK               (0x1000U)
#define SARADC_CALSTSM0_CAP12_SHIFT              (12U)
#define SARADC_CALSTSM0_CAP12_WIDTH              (1U)
#define SARADC_CALSTSM0_CAP12(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSM0_CAP12_SHIFT)) & SARADC_CALSTSM0_CAP12_MASK)

#define SARADC_CALSTSM0_CAP13_MASK               (0x2000U)
#define SARADC_CALSTSM0_CAP13_SHIFT              (13U)
#define SARADC_CALSTSM0_CAP13_WIDTH              (1U)
#define SARADC_CALSTSM0_CAP13(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSM0_CAP13_SHIFT)) & SARADC_CALSTSM0_CAP13_MASK)

#define SARADC_CALSTSM0_CAP14_MASK               (0x4000U)
#define SARADC_CALSTSM0_CAP14_SHIFT              (14U)
#define SARADC_CALSTSM0_CAP14_WIDTH              (1U)
#define SARADC_CALSTSM0_CAP14(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSM0_CAP14_SHIFT)) & SARADC_CALSTSM0_CAP14_MASK)

#define SARADC_CALSTSM0_CAP15_MASK               (0x8000U)
#define SARADC_CALSTSM0_CAP15_SHIFT              (15U)
#define SARADC_CALSTSM0_CAP15_WIDTH              (1U)
#define SARADC_CALSTSM0_CAP15(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSM0_CAP15_SHIFT)) & SARADC_CALSTSM0_CAP15_MASK)

#define SARADC_CALSTSM0_CAP16_MASK               (0x10000U)
#define SARADC_CALSTSM0_CAP16_SHIFT              (16U)
#define SARADC_CALSTSM0_CAP16_WIDTH              (1U)
#define SARADC_CALSTSM0_CAP16(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSM0_CAP16_SHIFT)) & SARADC_CALSTSM0_CAP16_MASK)

#define SARADC_CALSTSM0_CAP17_MASK               (0x20000U)
#define SARADC_CALSTSM0_CAP17_SHIFT              (17U)
#define SARADC_CALSTSM0_CAP17_WIDTH              (1U)
#define SARADC_CALSTSM0_CAP17(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSM0_CAP17_SHIFT)) & SARADC_CALSTSM0_CAP17_MASK)

#define SARADC_CALSTSM0_CAP18_MASK               (0x40000U)
#define SARADC_CALSTSM0_CAP18_SHIFT              (18U)
#define SARADC_CALSTSM0_CAP18_WIDTH              (1U)
#define SARADC_CALSTSM0_CAP18(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSM0_CAP18_SHIFT)) & SARADC_CALSTSM0_CAP18_MASK)

#define SARADC_CALSTSM0_CAP19_MASK               (0x80000U)
#define SARADC_CALSTSM0_CAP19_SHIFT              (19U)
#define SARADC_CALSTSM0_CAP19_WIDTH              (1U)
#define SARADC_CALSTSM0_CAP19(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSM0_CAP19_SHIFT)) & SARADC_CALSTSM0_CAP19_MASK)

