zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SARADC.h
#define SARADC_CALSTSM0_CAP20_MASK               (0x100000U)
#define SARADC_CALSTSM0_CAP20_SHIFT              (20U)
#define SARADC_CALSTSM0_CAP20_WIDTH              (1U)
#define SARADC_CALSTSM0_CAP20(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSM0_CAP20_SHIFT)) & SARADC_CALSTSM0_CAP20_MASK)

#define SARADC_CALSTSM0_CAP21_MASK               (0x200000U)
#define SARADC_CALSTSM0_CAP21_SHIFT              (21U)
#define SARADC_CALSTSM0_CAP21_WIDTH              (1U)
#define SARADC_CALSTSM0_CAP21(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSM0_CAP21_SHIFT)) & SARADC_CALSTSM0_CAP21_MASK)

#define SARADC_CALSTSM0_CAP22_MASK               (0x400000U)
#define SARADC_CALSTSM0_CAP22_SHIFT              (22U)
#define SARADC_CALSTSM0_CAP22_WIDTH              (1U)
#define SARADC_CALSTSM0_CAP22(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSM0_CAP22_SHIFT)) & SARADC_CALSTSM0_CAP22_MASK)

#define SARADC_CALSTSM0_CAP23_MASK               (0x800000U)
#define SARADC_CALSTSM0_CAP23_SHIFT              (23U)
#define SARADC_CALSTSM0_CAP23_WIDTH              (1U)
#define SARADC_CALSTSM0_CAP23(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSM0_CAP23_SHIFT)) & SARADC_CALSTSM0_CAP23_MASK)

#define SARADC_CALSTSM0_CAP24_MASK               (0x1000000U)
#define SARADC_CALSTSM0_CAP24_SHIFT              (24U)
#define SARADC_CALSTSM0_CAP24_WIDTH              (1U)
#define SARADC_CALSTSM0_CAP24(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSM0_CAP24_SHIFT)) & SARADC_CALSTSM0_CAP24_MASK)

#define SARADC_CALSTSM0_CAP25_MASK               (0x2000000U)
#define SARADC_CALSTSM0_CAP25_SHIFT              (25U)
#define SARADC_CALSTSM0_CAP25_WIDTH              (1U)
#define SARADC_CALSTSM0_CAP25(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSM0_CAP25_SHIFT)) & SARADC_CALSTSM0_CAP25_MASK)

#define SARADC_CALSTSM0_CAP26_MASK               (0x4000000U)
#define SARADC_CALSTSM0_CAP26_SHIFT              (26U)
#define SARADC_CALSTSM0_CAP26_WIDTH              (1U)
#define SARADC_CALSTSM0_CAP26(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSM0_CAP26_SHIFT)) & SARADC_CALSTSM0_CAP26_MASK)

#define SARADC_CALSTSM0_CAP27_MASK               (0x8000000U)
#define SARADC_CALSTSM0_CAP27_SHIFT              (27U)
#define SARADC_CALSTSM0_CAP27_WIDTH              (1U)
#define SARADC_CALSTSM0_CAP27(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSM0_CAP27_SHIFT)) & SARADC_CALSTSM0_CAP27_MASK)

#define SARADC_CALSTSM0_CAP28_MASK               (0x10000000U)
#define SARADC_CALSTSM0_CAP28_SHIFT              (28U)
#define SARADC_CALSTSM0_CAP28_WIDTH              (1U)
#define SARADC_CALSTSM0_CAP28(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSM0_CAP28_SHIFT)) & SARADC_CALSTSM0_CAP28_MASK)

#define SARADC_CALSTSM0_CAP29_MASK               (0x20000000U)
#define SARADC_CALSTSM0_CAP29_SHIFT              (29U)
#define SARADC_CALSTSM0_CAP29_WIDTH              (1U)
#define SARADC_CALSTSM0_CAP29(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSM0_CAP29_SHIFT)) & SARADC_CALSTSM0_CAP29_MASK)

#define SARADC_CALSTSM0_CAP30_MASK               (0x40000000U)
#define SARADC_CALSTSM0_CAP30_SHIFT              (30U)
#define SARADC_CALSTSM0_CAP30_WIDTH              (1U)
#define SARADC_CALSTSM0_CAP30(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSM0_CAP30_SHIFT)) & SARADC_CALSTSM0_CAP30_MASK)

#define SARADC_CALSTSM0_CAP31_MASK               (0x80000000U)
#define SARADC_CALSTSM0_CAP31_SHIFT              (31U)
#define SARADC_CALSTSM0_CAP31_WIDTH              (1U)
#define SARADC_CALSTSM0_CAP31(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSM0_CAP31_SHIFT)) & SARADC_CALSTSM0_CAP31_MASK)
/*! @} */

/*! @name CALSTSM1 - Calibration Fail Status 1 for M-SARADC */
/*! @{ */

#define SARADC_CALSTSM1_CAP32_MASK               (0x1U)
#define SARADC_CALSTSM1_CAP32_SHIFT              (0U)
#define SARADC_CALSTSM1_CAP32_WIDTH              (1U)
#define SARADC_CALSTSM1_CAP32(x)                 (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSM1_CAP32_SHIFT)) & SARADC_CALSTSM1_CAP32_MASK)

#define SARADC_CALSTSM1_OFS_MASK                 (0x2U)
#define SARADC_CALSTSM1_OFS_SHIFT                (1U)
#define SARADC_CALSTSM1_OFS_WIDTH                (1U)
#define SARADC_CALSTSM1_OFS(x)                   (((uint32_t)(((uint32_t)(x)) << SARADC_CALSTSM1_OFS_SHIFT)) & SARADC_CALSTSM1_OFS_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group SARADC_Register_Masks */

/*!
 * @}
 */ /* end of group SARADC_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_SARADC_H_) */
